const COMPETITOR_COMMUNICATION_POST = [
  {
    "party": "พลังประชารัฐ",
    "partymentioned": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2020-02-25",
    "postmessage": "วันนี้ท่านบอกว่าเรามีไอโอ ท่านก็มีไอโอ ศุภชัย ใจสมุทร รองเลขาธิการพรรคภูมิใจไทย ขอใช้สิทธิประท้วงถูกฝ่ายค้านพาดพิง ระหว่างการอภิปรายไม่ไว้วางใจ",
    "postengagement": 7278,
    "postreaction": 3817,
    "postcomment": 2420,
    "postshare": 1041,
    "posturl": "https://www.facebook.com/493026767870664/posts/823212621518742"
  },
  {
    "party": "พลังประชารัฐ",
    "partymentioned": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2019-05-26",
    "postmessage": "พปชร. เข้าเทียบเชิญ ปชป. ร่วมรัฐบาล ย้ำ ยังไม่หารือเก้าอี้รัฐมนตรี อุตตม มั่นใจจัดตั้งรัฐบาลได้ หวังพรรคร่วม โหวตเลือกพลเอกประยุทธ์ เป็นนายก . ด้านเฉลิมชัย ระบุ ยังไม่ตกลงร่วมรัฐบาล รอมีมติหารือที่ประชุมร่วมกรรมการบริหารพรรคและ ส.ส.พรุ่งนี้ ชี้หากร่วมรัฐบาลต้องได้กระทรวงเศรษฐกิจเพื่อผลักดันนโยบาย แก้ปัญหาปากท้องประชาชน” . แกนนำพรรคพลังประชารัฐ นำโดย นายอุตตม สาวนายน /สนธิรัตน์ สนธิจิรวงศ์ เลขาธิการพรรค/สุริยะ จึงรุ่งเรืองกิจ กรรมการบริการบริหาพรรค/ เดินทางมาทาบทามพรรคประชาธิปัตย์ เข้าร่วมรัฐบาล ซึ่งมีนายเฉลิมชัย ศรีอ่อน เลขาธิการพรรคประชาธิปัตย์/นายนิพนธ์ บุญญามณี รองหัวหน้าพรรคตามภารกิจ ให้การต้อนรับ . โดยนายอุตตม บอกว่า วันนี้มาเรียนเชิญพรรคประชาธิปัตย์ในการร่วมกันจัดตั้งรัฐบาลเพื่อเดินหน้าประเทศไทย เพื่อประชาชน ตามที่พรรคเคยให้สัญญาไว้ และการมาเทียบเชิญเป็นกระบวนการตามประเพณีทางการเมืองที่ทำมาโดยตลอด ส่วนเก้าอี้รัฐมนตรียังไม่มีการพูดคุยกันในรายละเอียด ทั้งนี้หากแต่ละพรรคร่วมรัฐบาลมีนโบายก็จะต้องนำมาพูดคุยกันต่อไป ทั้งการแบ่งงาน และการร่วมกันทำงาน โดยการพูดคุยนโยบายของแต่ละพรรคนั้นจะต้องให้เกิดการสอดรับกัน . และมั่นใจว่าพรรคพลังประชารัฐจะสามารถตั้งรัฐบาลแต่หากมีการร่วมรัฐบาล ก็คาดหวังว่า อยากจะให้พรรคร่วมสนับสนุน พลเอกประยุทธ์ จันทร์โอชา เป็นนายกรัฐมนตรีของพรรคพลังประชารัฐด้วย . ส่วนที่พรรคประชาธิปัตย์เคยหาเสียงไว้ว่าจะไม่สนับสนุนพลเอกประยุทธ์ จันทร์โอชา เป็นนายกรัฐมนตรีนั้น ก็ต้องดูว่าเป็นเรื่องของพรรคประชาธิปัตย์จริงหรือไม่ ซึ่งทั้งหมดอยู่ที่ที่ประชุมพรรคประชาธิปัตย์จะหารือกันและมองว่า ความเห็นนั้นเป็นเรื่องที่ผ่านไปแล้ว วันนี้ขออย่าสร้างเงื่อนไข และขอให้เดินหน้าไปด้วยกัน . นายอุตตม ยังเชื่อมั่นอีกว่า จะสามารถบริหารจัดการรัฐบาลเสียงปริมน้ำได้ . ส่วนที่นายวิษณุ เครืองาม รองนายกรัฐมนตรี เคยให้สัมภาษณ์ไว้ว่าจะมีการจัดตั้งรัฐบาลภายในเดือนมิถุนายน นายอุตตมระบุว่า ส่วนตัวก็ได้ติดตามข่าวมาแบบเดียวกัน แต่ก็ต้องรอเปิดการประชุมโหวตเลือกนายกรัฐมนตรีในสภาก่อน พร้อมปฏิเสธคำถามของผู้สื่อข่าวถึงการนำสินสอดมาสู่ขอพรรคประชาธิปัตย์ว่ามีจำนวนเท่าใด . ขณะที่นายเฉลิมชัย บอกก่อนเข้าร่วมหารือว่า ที่พรรคพลังประชารัฐจะทาบทามให้เข้าร่วมเป็นรัฐบาล โดยยืนยันว่า ขณะนี้ยังไม่มีการต่อรองตำแหน่งรัฐมนตรี และการพูดคุยกันวันนี้จะต้องมีการนำเข้าชี้แจงในที่ประชุมคณะกรรมการบริหารพรรคช่วงเย็นวันพรุ่งนี้ โดยการหารือจะต้องพูดคึยกันในหลายปัจจัย ซึ่งสิ่งที่อดีตหัวหน้าพรรคประชาธิปัตย์ อภิสิทธิ์ เวชชาชีวะ เคยระบุก่อนการเลือกตั้งว่าไม่สนับสนุนการสืบทอดอำนาจ และพลเอกประยุทธ์ จันทร์โอชา นั้นก็เป็นปัจจัยหนึ่งที่จะนำมาพิจารณา แต่ก็ต้องพิจารณาควบคู่กันการให้ประเทศชาติต้องเดินหน้า . ทั้งนี้การร่วมรัฐบาลจะตัดสินใจแยกจากการสนับสนุนบุคคลเป็นนายกรัฐมนตรีหรือไม่ ก็ต้องมีการหารือกันในที่ประชุมพรรค แต่ยืนยันว่า ไม่ว่าจะตัดสินใจอย่างไรก็ต้องมีเหตุผลรองรับ และจะสามารถอธิบายกับประชาชนที่เลือกพรรคประชาธิปัตย์ได้อย่างแน่นอน ซึ่งหากพรรคประชาธิปัตย์ตัดสินใจเข้าร่วมรัฐบาล จะต้องได้ตำแหน่งรัฐมนตรีในกระทรวงเศรษฐกิจหลักที่จะสามารถนำมาผลักดันนโยบายเพื่อแก้ปัญหาปากท้อง และราคาพืชผลทางการเกษตรให้กับประชาชนได้ . นายเฉลิมชัย บอกด้วยว่า การประชุมร่วมระหว่างคณะกรรมการบริหารและส.ส. ของพรรคไม่ใช่เพียงพิธีกรรม . ทั้งนี้แม้ว่ารัฐบาลจะมีเสียงปริ่มน้ำใกล้เคียงกัน แต่เชื่อว่า สามารถดำรงอยู่ได้เพราะการประสานงานที่ดี ยืนยันว่าการที่นายชวน หลีกภัย ได้รับเลือกเป็นประธานสภาผู้แทนราษฎร ไม่เกี่ยวกับการต่อรองตำแหน่งรัฐมนตรี เพราะวันนี้มีเพียงนายชวนเท่านั้นที่เหมาะสมดำรงตำแหน่งนี้เพื่อให้ประเทศเดินหน้าไปได้ หากมีการพูดคุยเรื่องตำแหน่งรัฐมนตรีก็จะมีการแถลงข่าวให้ทราบในเวลาที่เหมาะสม . ทั้งนี้ตนเองมีเพียงเสียงเดียว ไม่สามารถควบคุมทิศทางของที่ประชุมร่วมคณะกรรมการบริหารและส.ส. ของพรรคได้ จึงอยู่ที่การตัดสินใจร่วมกันของที่ประชุม ซึ่งผลการตัดสินใจจะส่งผลกับอนาคตของพรรคแน่นอน #จัดตั้งรัฐบาล #พรรคพลังประชารัฐ #พรรคประชาธิปัตย์",
    "postengagement": 2028,
    "postreaction": 1569,
    "postcomment": 421,
    "postshare": 38,
    "posturl": "https://www.facebook.com/493026767870664/posts/608893062950700"
  },
  {
    "party": "พลังประชารัฐ",
    "partymentioned": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2019-07-24",
    "postmessage": "“บิ๊กตู่”ยิ้มแย้ม โชว์ลีลาแถลงนโยบายรัฐบาลต่อรัฐสภา ระบุ คิดถึงทุกคนและติดตามการประชุมก่อนส่งต่อหน่วยงานแก้ปัญหา ยืนยันประเทศต้องเดินแบบก้าวหน้า สังคมสงบ สามัคคี เอื้ออาทร คนไทยมีคุณภาพชีวิตที่ดีขึ้น การประชุมรัฐสภาเพื่อแถลงนโยบายรัฐบาลต่อรัฐสภามีนายชวน หลีกภัย ประธานรัฐสภา ทำหน้าที่ประธานที่ประชุม โดยพล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรี เริ่มแถลงนโยบาย ด้วยลีลาที่ไม่ธรรมดา มีการใช้คำพูดเชิงหยอกล้อสร้างสีสันให้กับช่วงแรกของการแถลงนโยบาย พล.อ.ประยุทธ์ ระบุว่า ผมคิดถึงพวกท่านมาโดยตลอด แม้ไม่ได้มาเจอแต่ผมก็ดูโทรทัศน์ทุกวัน ผมก็จดประเด็นไว้ตลอด ว่าใครพูดอะไร แล้วก็นำข้อวิพากษ์วิจารณ์ ส่งต่อให้หน่วยงานที่เกี่ยวข้องไปแก้ปัญหา วันนี้จึงถือเป็นเกียรติที่ได้มาพบปะทุกท่าน มาเสนอนโยบายในนาม ครม.ใหม่ ซึ่งเป็นนโยบายในกรอบกว้างๆ ต่อจากนี้จะรับฟังความคิดเห็นและนำไปทำเป็นแผนขั้นตอนการดำเนินการ ไม่ว่าพรรคการเมืองใดเสนอนโยบายเข้ามา ทุกอย่างเข้ามาอยู่ในนโยบายของคณะรัฐมนตรี \"ถ้าผมพูดเร็วไปก็ขอให้เปิดเอกสารตามไปด้วย เพราะได้แจกล่วงหน้ามาแล้ว 3 วัน”แล้ว พล.อ.ประยุทธ์ กล่าวอีกว่า สังคมไทยต้องเดินหน้า คนไทยต้องมีคุณภาพชีวิตที่ดีขึ้นพร้อมรับกับศตวรรษที่ 21 มีใครไม่เห็นด้วยในเรื่องนี้บ้าง หลายคนก็ยังไม่เข้าใจเศรษฐกิจพอเพียง การเจริญเติบโตของเศรษฐกิจไทยอยู่ที่การเปลี่ยนแปลงทางเทคโนโลยี วันนี้เราต้องยอมรับว่าอยู่ในระหว่างการเปลี่ยนผ่าน เราต้องสู้กับความยากจน ภัยคุกคามที่ไม่มีแบบแผน ความเหลื่อมล้ำ โดยต้องสร้างโอกาสให้ทุกคนเข้าถึงโอกาสได้อย่างเท่าเทียมกัน ขณะที่ สส.พรรคเพื่อไทย นำโดยนายจิรายุ ห่วงทรัพย์ ส.ส.กทม. และ นพ.ชลน่าน ศรีแก้ว ส.ส.น่าน ได้ประท้วงการแถลงของพล.อ.ประยุทธ์ โดยมีช่วงหนึ่งพล.อ.ประยุทธ์ กล่าวแซว นพ.ชลน่านว่า \"ดาวสภาอยู่แล้ว เชิญครับ\" \"ผมไม่ทะเลาะกับพวกท่านอยู่แล้ว เอาละผมจะอ่านให้ฟัง อ่านภาษาไทยเนี่ยแหละ คุณเปิดหนังสือและอ่านตามผมไปด้วย\" พล.อ.ประยุทธ์ กล่าว จากนั้น​พล.อ.ประยุทธ์ จึงได้หยิบเอกสารนโยบายของคณะรัฐมนตรีเล่มสีน้ำเงินที่ส่งให้รัฐสภามาอ่านตามตัวอักษรต่อไป #พรรคพลังประชารัฐ​ #PPRP",
    "postengagement": 4728,
    "postreaction": 3417,
    "postcomment": 1171,
    "postshare": 140,
    "posturl": "https://www.facebook.com/493026767870664/posts/650594262113913"
  },
  {
    "party": "พลังประชารัฐ",
    "partymentioned": "อนาคตใหม่/ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2019-05-16",
    "postmessage": "ธนกรจวก\"ธนาธร\" โกหกหน้าตาย ใส่ร้าย พปชร. ลั่นไม่ไม่มีใครเสนอดึง 20 ส.ส. อนค. แลกกับคดี เพราะแทรกแซงกระบวนการยุติธรรมไม่ได้ เผยเตรียมมอบฝ่าย ก.ม.ดำเนินคดี นายธนกร วังบุญคงชนะ รองโฆษกพรรคพลังประชารัฐ กล่าวถึงกรณีที่นายธนาธร จึงรุ่งเรืองกิจ หัวหน้าพรรคอนาคตใหม่ ระบุว่า พรรคพลังประชารัฐติดต่อแม่นายธนาธร ขอ 20 ส.ส. มาร่วมงานแลกกับการไม่ดำเนินคดีกับนายธนาธรว่า เรื่องดังกล่าว #ไม่เป็นความจริง พรรคไม่มีนโยบายแบบนี้และไม่เคยมอบหมายใคร นายธนาธรโกหกหน้าตาย พูดเท็จใส่ร้ายพรรคพลังประชารัฐ เป็นการเล่นการเมืองที่สกปรกที่สุดเท่าที่เคยมีมา ไม่มีใครในพรรคทำแบบนี้ นึกไม่ถึงว่านายธนาธรจะกระทำแบบนี้ มีเจตนาพิเศษที่จะใส่ร้ายสร้างความเสียหายให้กับพรรคพลังประชารัฐอย่างไม่น่าให้อภัย ทั้งนี้ พรรคพลังประชารัฐทำการเมืองตรงไปตรงมา โปร่งใสตามระบอบประชาธิปไตย ภายใต้รัฐธรรมนูญ ไม่เคยคิดว่าคนรุ่นใหม่อย่างนายธนาธรจะกระทำแบบนี้ได้ นายธนกร กล่าวอีกว่า พรรคจะมอบหมายให้ฝ่ายกฎหมายพิจารณา #ดำเนินคดีกับนายธนาธร ต่อไป เพราะทำให้พรรคเสียหาย เสื่อมเสียชื่อเสียง ไหนบอกว่าเป็นการเมืองแบบคนรุ่นใหม่ แล้วทำไมถึงทำแบบนี้ นอกจากนี้ การพูดของนายธนาธรยังสร้างความเสียหายให้กับกระบวนการยุติธรรมด้วย เพราะไม่มีใครแทรกแซงกระบวนการยุติธรรมได้ นายธนาธรมีหลายคดี ซึ่งพรรคก็ไม่เกี่ยวข้องด้วย ดังนั้น อยากให้นายธนาธรเตรียมตัวเป็นฝ่ายค้านที่ดี ทำการเมืองอย่างสร้างสรรค์ แสดงออกถึงความรักชาติบ้านเมืองบ้าง อย่าคิดแต่เรื่องที่จะทำให้คนไทยไม่สบายใจจะดีกว่า #พรรคพลังประชารัฐ #PPRP",
    "postengagement": 4099,
    "postreaction": 2635,
    "postcomment": 1144,
    "postshare": 320,
    "posturl": "https://www.facebook.com/493026767870664/posts/602109873629019"
  },
  {
    "party": "พลังประชารัฐ",
    "partymentioned": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2019-12-25",
    "postmessage": "ที่ผ่านมา ... อาจจะมีกระทบกระทั่งกันบ้าง แต่สุดท้ายวัฒนธรรมแบบไทย ๆ ก็ยังงดงามอยู่เสมอ ส.ส.สิระ เจนจาคะ พรรคพลังประชารัฐ ถือโอกาสช่วงเทศกาลปีใหม่ มอบกระเช้าของขวัญ ให้พล.ต.อ.เสรีพิศุทธ์ เตมียเวส ในฐานะประธานกมธ.ป.ป.ช. พร้อมกล่าวว่า \"อะไรที่เคยล่วงเกินที่ผ่านมา ต้องขออภัยด้วยครับ\" ขณะที่พล.ต.อ.เสรีพิศุทธ์ กล่าวตอบด้วยท่าทีที่ยิ้มแย้มว่า \"ต่อไปก็ขอให้เรามาตั้งใจทำงานกันนะ\" จากนั้น นายไพบูลย์ นิติตะวัน ส.ส.บัญชีรายชื่อพรรคพลังประชารัฐ ได้เข้ามาร่วมเฟรมถ่ายภาพร่วมกันเป็นที่ระลึก โดยบรรยากาศเป็นไปด้วยความชื่นมื่น !!",
    "postengagement": 2412,
    "postreaction": 2089,
    "postcomment": 250,
    "postshare": 73,
    "posturl": "https://www.facebook.com/493026767870664/posts/773116786528326"
  },
  {
    "party": "ภูมิใจไทย",
    "partymentioned": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2021-06-06",
    "postmessage": "ศูนย์ฉีดวัคซีนกลางบางซื่อ เปิดให้ผู้ที่ลงทะเบียน เข้ารับการฉีดวัคซีนแล้ว ตามแผนปูพรมฉีดวัคซีน เพื่อสร้างภูมิคุ้มกันหมู่ . ตามแผนการฉีดวัคซีน โดยเริ่มปูพรมตั้งแต่วันที่ 7 มิถุนายน 64 เป็นต้นไป ดังนั้นพล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงกลาโหม พร้อมด้วยนายอนุทิน ชาญวีรกูล รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข นายศักดิ์สยาม ชิดชอบรัฐมนตรีว่าการกระทรวงคมนาคม จึงได้ลงพื้นที่ตรวจเยี่ยมศูนย์ฉีดวัคซีนกลางบางซื่อ . เพื่อขอบคุณเจ้าหน้าที่ ผู้ที่อยู่หน้างาน และกำลังใจให้ทุกคนที่เดินทางเข้ามาฉีดวัคซีน ทั้งนี้ ศูนย์ฉีดวัคซีนกลางบางซื่อ มีเป้าหมายการฉีดวัคซีนให้แก่ประชาชนได้อย่างน้อยวันละประมาณ 10,000 คน แบ่งเป็นส่วนราชการหรือองค์กรต่างๆ 5,000 คน และประชาชนทั่วไป 5,000 คน ซึ่งสามารถดำเนินการได้อย่างมีประสิทธิภาพ มีบุคลากรทางการแพทย์สนับสนุนกว่า 500 คน #อนุทิน #สาธารณสุข #ศักดิ์สยาม #คมนาคม #ศูนย์ฉีดวัคซีนกลางบางซื่อ #คนภูมิใจไทย",
    "postengagement": 4244,
    "postreaction": 4035,
    "postcomment": 119,
    "postshare": 90,
    "posturl": "https://www.facebook.com/182657125936067/posts/871489857052787"
  },
  {
    "party": "ภูมิใจไทย",
    "partymentioned": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2021-09-04",
    "postmessage": "สาธารณสุขร่วมกับการท่องเที่ยวแห่งประเทศไทย เพิ่มพื้นที่ท่องเที่ยวนำร่อง รองรับการเปิดประเทศ . นายพิพัฒน์ รัชกิจประการ รัฐมนตรีว่าการกระทรวงการท่องเที่ยวและกีฬา ประชุมร่วมกับ ดร.สาธิต ปิตุเตชะ รัฐมนตรีช่วยว่าการกระทรวงสาธารณสุข โดยที่ประชุมมีมติเห็นชอบในการหาแนวทางและมาตรการในการเปิดประเทศภายใน 120 วันตามนโยบายรัฐบาล . โดยในช่วงแรก จะเปิดรับนักท่องเที่ยวในพื้นที่กรุงเทพมหานคร, เชียงใหม่, พัทยา, หัวหิน และพื้นที่ท่องเที่ยวนำร่องเพิ่มเติม ได้แก่ เชียงคาน จ.เลย และ จ.หนองคาย รวมถึงพื้นที่เกาะกูด เกาะช้าง จ.ตราด และเกาะเสม็ด จ.ระยอง ในรูปแบบ bubble and seal route และมอบให้การท่องเที่ยวแห่งประเทศไทยบรรจุในแผนเปิดพื้นที่รับนักท่องเที่ยว เสนอคณะรัฐมนตรีต่อไป #พิพัฒน์ #กระทรวงการท่องเที่ยวและกีฬา #การท่องเที่ยวแห่งประเทศไทย #คนภูมิใจไทย",
    "postengagement": 2698,
    "postreaction": 2542,
    "postcomment": 81,
    "postshare": 75,
    "posturl": "https://www.facebook.com/182657125936067/posts/926836961518076"
  },
  {
    "party": "ประชาธิปัตย์",
    "partymentioned": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-05-31",
    "postmessage": "เกษตรกรชาวสวนยางเฮ! ประกันรายได้ยางพารา ระยะ 2 เดินหน้าต่อ เริ่ม มิ.ย.นี้ พร้อมจัดเงินกู้รองรับผู้ประกอบการไม้ยางและยางแห้ง วันที่ 1 มิถุนายน 2563 เวลา 16.00 น. นายจุรินทร์ ลักษณวิศิษฏ์ หัวหน้าพรรคประชาธิปัตย์ รองนายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงพาณิชย์ ให้สัมภาษณ์ภายหลังประชุมคณะกรรมการนโยบายยางธรรมชาติ ครั้งที่ 1/2563 โดยมีพลเอกประยุทธ์ จันทร์โอชา นายกรัฐมนตรีเป็นประธาน และนายเฉลิมชัย ศรีอ่อน รัฐมนตรีว่าการกระทรวงเกษตรและสหกรณ์ เข้าร่วมประชุม ที่ห้องประชุม ตึกภักดีบดินทร์ ทําเนียบรัฐบาล ว่าที่ประชุมมีความเห็นชอบในหลักการคือ 1. ให้มีการประกันรายได้เกษตรกรชาวสวนยาง ระยะที่ 2 คือ ฤดูการผลิตที่จะเริ่มต้น ตั้งแต่เดือนมิถุนายนนี้ เป็นต้นไป 2. การเห็นชอบวงเงินกู้ที่รัฐบาลจะช่วยชดเชยดอกเบี้ยให้ไม่เกินร้อยละ 3 ตามความเป็นจริงสำหรับผู้ประกอบการไม้ยางพารา และผลิตภัณฑ์ที่เกี่ยวข้อง เช่น เฟอร์นิเจอร์ เป็นต้น ในวงเงิน 20,000 ล้านบาท โดยรัฐบาลจะช่วยชดเชยดอกเบี้ยให้ไม่เกินร้อยละ 3 ไม่เกิน 600 ล้านบาท และ 3. ที่ประชุมเห็นชอบให้มีการช่วยเหลือผู้ประกอบการธุรกิจยางแห้ง คือ ยางแผ่น ยางแท่ง เป็นต้น ในวงเงิน 20,000 ล้านบาท เป็นเงินกู้จะช่วยชดเชยดอกเบี้ยให้ร้อยละ 2-3 ตามความเป็นจริง โดยจะใช้เงินชดเชยดอกเบี้ยให้ไม่เกิน 600 ล้านบาท ส่วนน้ำยางข้นไปพิจารณาอีกครั้งหนึ่ง เนื่องจากยังไม่มีการเสนอเข้ามา แต่ผู้ประกอบการอยากให้รัฐเข้าไปช่วย เช่นเดียวกัน สำหรับธุรกิจทำน้ำยางข้นและถุงมือยาง ซึ่งต้องให้การยางแห่งประเทศไทยเป็นผู้นำไปหาหรือร่วมกันพิจารณาแล้วก็จะเสนอในการประชุมครั้งต่อๆ ไปถ้าเห็นร่วมกัน “ถือว่าอย่างน้อยคณะกรรมการนโยบายยางธรรมชาติที่นายกฯ เป็นประธานก็เห็นชอบในหลักการแล้วเพราะฉะนั้นในเรื่องภาพรวมของการประกันรายได้เกษตรกรชาวสวนยางนั้น ไม่มีอะไรน่าเป็นห่วง เป็นไปตามนโยบายรัฐบาลที่แถลงต่อรัฐสภาต่อไป” นายจุรินทร์ กล่าว --- ติดตามข่าวสารเพิ่มเติมได้ที่ Instagram : Democratparty.th Twitter : @democratTH YouTube : พรรคประชาธิปัตย์ Democrat Party, Thailand #DemocratPartyTH #พรรคประชาธิปัตย์",
    "postengagement": 5850,
    "postreaction": 5385,
    "postcomment": 244,
    "postshare": 221,
    "posturl": "https://www.facebook.com/296508406790/posts/10156993448121791"
  },
  {
    "party": "ประชาธิปัตย์",
    "partymentioned": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2020-05-22",
    "postmessage": "จุรินทร์ “เดินหน้า” ประกันรายได้เกษตรกร พร้อมให้ผู้ว่าฯทุกจังหวัดตั้งศูนย์ One Stop Service รับเรื่องร้องทุกข์เกษตรกร แก้ปัญหาครบวงจรในจุดเดียว 23 พฤษภาคม 2563 เวลา 12.00 น. นายจุรินทร์ ลักษณวิศิษฏ์ รองนายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงพาณิชย์ นายวีรศักดิ์ หวังศุภกิจโกศล รัฐมนตรีช่วยว่าการกระทรวงพาณิชย์ประชาสัมพันธ์และติดตามการดำเนินโครงการประกันรายได้มันสำปะหลัง ที่หอประชุมเปรมติณสูลานนท์ ศาลากลางจังหวัดนครราชสีมา สำหรับช่วงแรก การติดตามความคืบหน้าของโครงการประกันรายได้เกษตรกรชาวไร่มันสำปะหลังเกษตรกรผู้ปลูกมันสำปะหลังทั้งประเทศมีด้วยกันประมาณ 5.2-5.7 แสนครัวเรือนและรัฐบาลได้จัดงบประมาณเพื่อจ่ายเงินส่วนต่างในกรณีที่ราคามันสำปะหลังในตลาดต่ำกว่ากิโลกรัมละ 2.50 บาทเป็นเงิน 9,400 ล้านบาท การประกันรายได้เกษตรกรนั้น ประกันที่กิโลกรัมละ 2.50 บาท ที่เชื้อแป้ง 25% ได้มีการจ่ายเงินส่วนต่างไปแล้ว 6 งวด โดยงวดล่าสุดคืองวดที่ 6 นั้นจ่ายไปเมื่อวันที่ 30 เมษายนที่ผ่านมา และงวดต่อไปเป็นงวดที่ 7 จะจ่ายในวันที่ 1 มิถุนายน 2563 โดยเกษตรกรผู้ปลูกมันสำปะหลังจะได้รับการประกันรายได้ครอบครัวละไม่เกิน 100 ตันของหัวมันสด โดยนายจุรินทร์ กล่าวว่าวันนี้ได้มารับทราบปัญหาบางประการจากเกษตรกรตัวจริงที่ปลูกมันสำปะหลังอยู่ก็พบว่ายังมีประเด็นในเรื่องของการรับเงินส่วนต่างหรือการโอนเงินส่วนต่างอยู่บ้าง เช่น เกษตรกรได้รับการโอนเงินส่วนต่างล่าช้าไปประมาณหนึ่งเดือน เป็นกรณีที่กรมส่งเสริมการเกษตร ที่เป็นผู้รับขึ้นทะเบียนเกษตรกรและเป็นผู้ให้ความเห็นชอบจำนวนเกษตรกรในแต่ละงวดที่จะได้รับเงินส่วนต่าง ไปตัดยอดเกษตรกรก่อนถึงวันสิ้นเดือนทำให้เกษตรกรจำนวนหนึ่งหลงเหลืออยู่ ณ วันตัดยอดไปจนถึงวันสิ้นเดือนทำให้ไม่สามารถได้รับเงินส่วนต่างในเดือนถัดไปได้จึงต้องรอไปอีกหนึ่งเดือนนั้น “เลยได้ประสานกับท่านอธิบดีกรมส่งเสริมการเกษตรว่าจากนี้ไปจะต้องตัดยอด ณ วันสิ้นเดือนทุกครั้ง เพื่อเกษตรกรจะได้รับการโอนเงินส่วนต่างทันทีในเดือนถัดไปซึ่งท่านอธิบดีรับแล้วคิดว่าการโอนเงินส่วนต่างล่าช้าจะหมดไปได้” รัฐมนตรีว่าการกระทรวงพาณิชย์ กล่าว ประเด็นที่สอง คือ กรณีของโรคใบด่าง ซึ่งหลายจังหวัดยังได้รับเงินงบประมาณค่อนข้างช้าในการได้รับเงินชดเชยกรณีของการทำลายต้นมันสำปะหลังที่ติดโรคทำให้เกษตรกรจำนวนหนึ่งไม่ยอมโค่นต้นมันเพราะไม่ได้รับเงินชดเชยหรือเกรงว่าจะไม่ได้รับเงินชดเชยช่วยเหลือ “ผมจะทำหนังสือถึงที่ประชุมคณะรัฐมนตรี เพื่อขอให้สำนักงบประมาณเร่งรัดในเรื่องของการโอนเงินชดเชยการโค่นต้นพันธุ์ที่ติดโรคใบด่างมายังแต่ละจังหวัดให้เร็วขึ้นหรือโดยเร็วที่สุดเพื่อป้องกันการแพร่ระบาด” นายจุรินทร์ กล่าว รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ กล่าวด้วยว่า เท่าที่รับฟังความเห็นของผู้เกี่ยวข้องทั้งหมดทั้งในส่วนของเกษตรกร ในส่วนของผู้ดำเนินการธุรกิจการรับซื้อหัวมันสด และลานมันรวมทั้งผู้ประกอบธุรกิจแปรรูปมันสำปะหลัง ต่างเห็นตรงกันว่านโยบายประกันรายได้เกษตรกรชาวไร่มันสำปะหลังนั้นเป็นนโยบายที่ดีและอยากให้ดำเนินการต่อไปเช่นเดียวกับการประกันพืชผลเกษตรตัวอื่น ทั้งข้าว ข้าวโพด ยางพาราและปาล์มน้ำมัน ประเด็นสุดท้าย สำหรับเกษตรกรที่ยังติดขัดปัญหาการขึ้นทะเบียน เพื่อเข้าสู่โครงการประกันรายได้หรือติดขัดด้วยประเด็นปัญหาใดก็ตาม ตนได้มอบเป็นนโยบายให้ผู้ว่าราชการจังหวัดทุกจังหวัดที่มีพืชเกษตรตามโครงการประกันรายได้ทั้งห้าตัวนี้ได้จัดตั้งศูนย์ One Stop Service ขึ้นมาเพื่อรับเรื่องร้องทุกข์จากเกษตรกรจะได้ช่วยแก้ปัญหาแบบครบวงจรในจุดเดียว เช่น ตั้งที่ศาลากลางจังหวัดและที่ว่าการอำเภอทุกอำเภอ เป็นต้น ซึ่งวันนี้ผู้ว่าราชการจังหวัดนครราชสีมาก็รับไปปฏิบัติแล้ว --- ติดตามข่าวสารเพิ่มเติมได้ที่ Instagram : Democratparty.th Twitter : @democratTH YouTube : พรรคประชาธิปัตย์ Democrat Party, Thailand #DemocratPartyTH #พรรคประชาธิปัตย์",
    "postengagement": 4126,
    "postreaction": 3835,
    "postcomment": 197,
    "postshare": 94,
    "posturl": "https://www.facebook.com/296508406790/posts/10156967764396791"
  },
  {
    "party": "ประชาธิปัตย์",
    "partymentioned": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2022-07-19",
    "postmessage": "สวนเจ็บ ! “จุรินทร์” ตอก “เพื่อไทย” กระอัก โกหกกลางสภาคดีถุงมือยาง ลั่น อคส.ฟันวินัยร้ายแรงใครผิดไม่เอาไว้ ทั้ง “จำนำข้าว จำนำมัน” สูญ 530,000 ล้านสมัยเพื่อไทย (20 ก.ค. 65) เวลา 09.20 น. นายจุรินทร์ ลักษณวิศิษฏ์ หัวหน้าพรรคประชาธิปัตย์ รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ กล่าวชี้แจงภายหลัง นายประเสริฐ จันทรรวงทอง ส.ส.นครราชสีมา พรรคเพื่อไทย กรณีอภิปรายไม่ไว้วางใจรัฐมนตรีเป็นรายบุคคล ที่ห้องประชุมสภาผู้แทนราษฏร ชั้น 2 อาคารรัฐสภา นายจุรินทร์ กล่าวว่า ตนชี้แจงไปชัดเจนแล้วเกือบทั้งสิ้น เพียงแต่ท่านมาเติมว่าตั้งแต่วันที่ท่านอภิปรายถึงวันนี้ไม่มีความคืบหน้า และตนไม่กล้าจัดการอะไรกับประธานบอร์ด ที่ท่านกล่าวหาไม่เป็นความจริง และท่านโกหกกลางสภา แอบอ้างผลงาน ว่าท่านนำเรื่องไปยื่น ป.ป.ช. และ ป.ป.ช. ไต่สวน 22 รายมีความก้าวหน้าในคดี ป.ป.ช. อันนี้ก็โกหก ไม่จริง ป.ป.ช.ไต่สวนไม่ใช่เอาสำนวนท่านไปไต่สวน ไต่สวนเพราะองค์การครั้งสินค้า(อคส.) ไปยื่นแจ้งให้สอบสวนคดีทุจริต และมีความคืบหน้าคาดว่าอาจจะมีมติชี้มูลเร็วนี้ ที่สำคัญไม่ได้เกี่ยวข้องกับตนในแง่ที่ตนจะเป็นผู้ร่วมกระบวนการทุจริต ไม่เคยมีการเรียกตนไปชี้แจง หากเกี่ยวข้องต้องเรียกตนไปชี้แจง ยังไม่เคยมีขอทำความเข้าใจ ที่ท่านกล่าวหาว่าตนเข้าไปเกี่ยวข้องกับการทุจริตไม่จริง ทั้งในที่ลับที่แจ้ง ทั้งเป็นทางการและไม่เป็นทางการ ไม่เคยเข้าไปยุ่งเกี่ยวหรือเกี่ยวข้องกับเรื่องนี้ทันทีที่ทราบเรื่องเข้าไปบริหารจัดการมีความคืบหน้าเป็นลำดับ ภารกิจของ อคส. ในการทวงเงินคืน จากการกระทำการทุจริตที่ อคส. ต้องเป็นเจ้าของเรื่อง ไม่ได้มีแต่เรื่องถุงมือยาง อย่างน้อยเงิน 3 ก้อนใหญ่ ที่ต้องดำเนินการมีความคืบหน้าทั้งสิ้น 1.ทุจริตถุงมือยาง 2,000 ล้านพร้อมดอกเบี้ย 2.เงิน 504,861 ล้านบาท ที่ อคส.ต้องเรียกค่าเสียหายคืนจากการทุจริตจำนำข้าวสมัยพวกท่านเป็นรัฐบาล ยังไม่จบ ทำไมไม่เห็นทวงว่าช้า เพราะทุกอย่างมีขั้นตอนกระบวนการ ถ้าใครไปทำอะไรนอกกฎหมายกระบวนการลงโทษผิดขั้นตอนและเป็นช่องว่างให้คนที่กระทำการทุจริตเอ่ยอ้างและลอยนวลได้ในที่สุด 3.เงินทุจริตจำนำมันสำปะหลัง คู่แฝดทุจริตจำนำข้าวที่พวกท่านเป็นรัฐบาล ต้องไปทวงเงินคืนมาทั้งหมด 33,000 ล้านบาท ซึ่งเงินก้อนที่หนึ่งทุจริตถุงมือยาง 2,000 ล้านบาทบวกดอกเบี้ย เกิดขึ้นเพราะอดีตรักษาการผู้อำนวยการ อคส. ทำสัญญาขายถุงมือยาง 125,000 ล้านบาทให้กับ 7 บริษัท จากนั้นทำสัญญาซื้อถุงมือยางกับบริษัทการ์เดียนโกลฟส์ฯ 110,000 ล้านบาท โดยประมาณ ก็เป็นเงื่อนไขหรือจังหวะเบิกเงิน อคส. 2,000 ล้านบาทอ้างว่าจ่ายมัดจำ ซึ่งกระผมและ อคส. ผู้อำนวยการคนใหม่ที่เข้ามาแทนรักษาการ ได้ดำเนินการ การเบิกเงินจากบัญชี 2 ก.ย.63 จากนั้น 10 ก.ย.63 ผู้อำนวยการคนใหม่เข้ารับหน้าที่ประมาณหนึ่งสัปดาห์ รายงานให้ทราบทันทีว่าพบเงินหายจากบัญชี 2,000 ล้านบาท และวันเดียวกัน ท่านนายกรัฐมนตรีมีคำสั่งย้ายอดีตรักษาการผู้อำนวยการไปอยู่สำนักนายกฯทันที ถ้าท่านนายกฯละเลยถ้านายจุรินทร์ละเลยคำสั่งนี้จะมาไหม จากนั้นผู้อำนวยการ อคส.ตั้งกรรมการสอบข้อเท็จจริง จากนั้น 18 ก.ย. ผู้อำนวยการไปแจ้งความอดีตรักษาการผู้อำนวยการกับพวกกับดีเอสไอ และแจ้งความกับสำนักงานคณะกรรมการป้องกันและปราบปรามการฟอกเงิน (ปปง.) ตรวจสอบเส้นทางการเงินและอายัดบัญชีในทันที จากนั้นผู้อำนวยการ อคส. แจ้งความกับ ป.ป.ช. ทันทีที่รับเรื่องเข้าสู่กระบวนการยุติธรรม และสอบหมดแล้วตั้งแต่เจ้าหน้าที่ตัวเล็กจนตัวใหญ่ถึงผู้อำนวยการ ประธานบอร์ด ไม่เว้นแม้แต่รัฐมนตรีหรือท่านนายกรัฐมนตรี คือกระบวนการที่ท่านทราบดี จากนั้นกรรมการ ป.ป.ช. มีมติอายัดบัญชี 2,000 ล้านบาท ตั้งแต่วันที่ 29 ต.ค.63 มีความคืบหน้าในการตั้งกรรมการสอบข้อเท็จจริง อคส. พบการกระทำผิด ชี้มูลความผิด 3. รายคืออดีตรักษาการผู้อำนวยการ และเจ้าหน้าที่อีก 2 ราย จากนั้นผู้อำนวยการก็ตั้งกรรมการสืบสวนต่อไปเพื่อลงโทษทางวินัยตามระเบียบ หลังจากที่ท่านอภิปรายทุกอย่างมีความคืบหน้า วันที่อภิปรายตนยืนยันกับสภาชัดเจนว่าตนไม่เคยมีส่วนเข้าไปเกี่ยวข้องยุ่งเกี่ยวกับโครงการนี้หรือการดำเนินการใด ไม่ว่าจะเป็นทางการหรือไม่เป็นทางการทั้งที่ลับที่แจ้ง และได้ชี้ให้เห็นว่าวันนั้นท่านโกหกหลายเรื่องทั้งเก่าหาว่าไม่เคยตั้งกรรมการสอบ และกล่าวหาว่าไม่เคยมีการอายัดเงินก็ไม่จริง ป.ป.ช.อายัดเงินแล้ว ซึ่งเป็นองค์กรอิสระที่กฎหมายรองรับ ที่บอกว่าไม่เคยดำเนินคดีก็ไม่จริงส่ง ปปง. ป.ป.ช.ซึ่งเป็นการเริ่มต้นกระบวนการยุติธรรม และอธิบายไว้ชัดเจนว่าไม่ว่าจะรู้จักใคร ผู้ใหญ่ขนาดไหน รู้จักนายกรัฐมนตรี รู้จักรัฐมนตรี ไม่ได้แปลว่าจะมีอำนาจล้นฟ้า เมื่อไหร่ที่ทำผิดกฏหมายก็ต้องเข้าคุก เรื่องนี้ตนไม่ยอมไม่ว่าใครทุจริตโครงการนี้ก็ตาม จะจัดการทั้งทางวินัยแพ่ง อาญา จนถึงที่สุด ตราบเท่าที่มีอำนาจหน้าที่ และกฎหมายให้อำนาจตน เป็นสิ่งที่ตนยืนยันผูกพันไว้กับสภาแห่งนี้ และได้ดำเนินการมาโดยต่อเนื่อง หลังอภิปราย มี 3 เรื่องที่ตนเร่งรัดดำเนินการ 1.คดีแพ่งกับอาญา สั่งการให้ผู้อำนวยการ อคส.คนใหม่ ให้ความร่วมมือกับ ป.ป.ช.ในทุกเรื่อง ปปง.ทุกประการ และติดตามรายงานความคืบหน้าเป็นระยะ และเร่งรัดการลงโทษทางวินัย ใครเกี่ยวข้องให้นำเงิน 2,000 ล้านบวกดอกเบี้ยมาชดใช้ค่าเสียหาย มีความคืบหน้าคณะกรรมการสืบสวนข้อเท็จจริงสรุปผลการสอบวินัยเสร็จ ได้ชี้มูลความผิด 3 ราย มีมติให้ไล่ออกทั้ง 3 ราย ผู้อำนวยการ อคส.ออกคำสั่งไล่ออกตั้งแต่วันที่ 19 ต.ค. 64 จำนวน 2 ราย ส่วนอดีตรักษาการผู้อำนวยการ บังเอิญว่าโดนคำสั่งย้ายไปสำนักนายกจึงถามไปยังกฤษฎีกาเป็นการดำเนินการ กฤษฎีกาตอบว่าอำนาจหน้าที่ในการดำเนินการทางวินัยเป็นหน้าที่ของปลัดสำนักนายกรัฐมนตรี เพื่อให้กระบวนการลงโทษถูกต้องตามกฎหมายไม่ถูกโต้แย้งวันหลังให้เป็นโมฆะ โดยให้สามารถนำผลการสอบสวนของ อคส. ไปดำเนินการทางวินัย ให้ถือว่าเป็นการสืบสวนข้อเท็จจริงเบื้องต้นได้ ปลัดสำนักนายกฯต้องตั้งกรรมการสอบสวนทางวินัยโดยทำตามพระราชกฤษฎีกา ตอนนี้ผู้ตรวจราชการสำนักนายกรัฐมนตรีจบเรื่องวินัยและต้องติดตามต่อไป ส่วนเรื่องละเมิด ติดตามทวงเงิน 2,000 ล้านบวกดอกเบี้ยคืนใครกระทำความผิดหรือเกี่ยวข้องต้องนำเงินมาชดใช้เพราะเงินหลวงตกน้ำไม่ไหลตกไฟไม่ไหม้ ต้องไล่เบี้ยจนมีผู้นำเงินมาชดใช้ ตามพระราชบัญญัติการรับผิดทางละเมิด ได้มีการแต่งตั้งโดยผู้อำนวยการ อคส. มีรองปลัดกระทรวงพาณิชย์ เป็นประธาน ผลการสอบออกมาแล้ว มีด้วยกัน 2 กลุ่ม 1.กลุ่มที่ตั้งสอบแล้วพบเจตนาทำให้รัฐเสียหาย 2.กลุ่มที่กรรมการชี้ว่าประมาทเลินเล่ออย่างร้ายแรง เจตนาทำให้รัฐเสียหาย มี 4 รายต้องชดใช้คนละ 400.8 ล้านบาท รวม 1,603 ล้านบาท 4 ราย 3 รายแรก จนท.ที่ถูกชี้มูลความผิดทางวินัย และเพิ่มอีกหนึ่งคือประธานบอร์ด วันนี้ชัดเจนว่าประธานบอร์ดก็ถูกชี้ว่าต้องรับผิดชอบชดใช้ความเสียหายด้วย ข้อหาเจตนาทำในข้อหาเจตนาทำให้รัฐเสียหาย 400 ล้านบาทโดยประมาณ กลุ่มที่ 2 ประมาทเลินเล่อมี 3 ราย ชดใช้คนละ 133.6 ล้านบาท รวม 400.8 ล้านบาท รวมสองกลุ่มเป็น 2,000 ล้านบาท บวกดอกเบี้ย ตามกระบวนการของพระราชบัญญัติการรับผิดทางละเมิดเจ้าหน้าที่ของรัฐต้องไปยุติที่กระทรวงคลังเป็นผู้ชี้ขาดตามกฎหมาย ได้ส่งเรื่องไปยังกระทรวงการคลังแล้ว ตั้งแต่วันที่ 3 ก.พ.65 แต่ยังติดประเด็นประธานบอร์ด ไม่ใช่ใครปกป้องแต่ติดข้อกฎหมายเพราะถ้าไม่เป็นกระบวนการกฎหมายจะถูกโต้แย้งทำให้กระบวนการไม่ชอบ สุดท้ายใครรับผิดชอบค่าเสียหายก็ลอยนวล กรณีประธานบอร์ดมีประเด็นข้อกฎหมายจากผลการสอบให้ชดใช้ค่าเสียหายเป็นไปตามคำสั่งผู้อำนวยการ อคส. แต่ประธานบอร์ดเป็นผู้บังคับบัญชา อคส. ดังนั้นต้องถามกฤษฎีกา ก็ตอบกลับมาว่า หากพบความผิดทางละเมิดของประธานบอร์ดให้รัฐมนตรีเป็นผู้แต่งตั้งคณะกรรมการสอบโดยใช้กรรมการสอบชุดเดิมได้ เพื่อผลสอบจะได้ไม่เกิดความลักลั่น ซึ่งวันที่ 31 พ.ค. 65 ตนลงนามแต่งตั้งกรรมการสอบความรับผิดทางละเมิดประธานบอร์ดเสร็จสิ้นแล้ว ความคืบหน้าคือกรรมการแจ้งข้อกล่าวหาแล้ว ส่วนการไต่สวนของ ป.ป.ช.ตนทราบจากข่าว สำนักข่าวอิศรา เปิดเผยว่าการไต่สวนคดีทุจริตถุงมือยางเสร็จแล้วกำลังเข้าสู่กระบวนการพิจารณาของกรรมการ ป.ป.ช.ต่อไป ที่ท่านกล่าวหาในญัตติว่าตนปล่อยประละเลยไม่ติดตามแก้ไขปัญหาการทุจริตเพื่อให้มีการชดใช้ความเสียหายที่เกิดขึ้นแก่รัฐหรือ อคส. จึงไม่เป็นความจริงแต่อย่างใด ในทางตรงกันข้ามกลับมีความคืบหน้าในทุกกรณีตามขั้นตอนกระบวนการกฎหมาย เงินก้อนที่สอง แม้ท่านไม่ได้ทวงถามความคืบหน้าว่าช้าแต่เรื่องนี้ 10 ปีแล้วตนทำต่อเนื่องทุจริตจำนำข้าวที่พวกท่านสร้างไว้ ก่อความเสียหายให้ อคส. 504,861 ล้านบาท จนต้องฟ้องเรียกค่าเสียหาย รวม 1,180 คดี ไม่ได้เอาชั่วใส่ใคร ถ้าชั่วจริงก็ต้องชั่วการดำเนินการทางกฎหมายต้องเกิด เหมือนทุจริตถุงมือยางถ้าทุจริตจริงก็ต้องจัดการและเส้นทางการเงินที่ท่านพูดนั้น ป.ป.ช. ดำเนินการ ปปง. ก็เป็นองค์กรตามกฎหมายที่ดำเนินการ ที่ต้องชี้แจงทุจริตจำนำข้าวเพราะท่านเขียนในญัตติ กล่าวหาตนว่า มีพฤติกรรมปล่อยปละละเลยไม่ติดตามแก้ไขปัญหาการทุจริตเพื่อให้ชดใช้ความเสียหายที่เกิดขึ้นแก่รัฐหรือ อคส. ตนกำลังอธิบายว่าติดตามความเสียหายอย่างไรและไม่ได้มีก้อนเดียวเฉพาะถุงมือยาง ยังมีทุจริตจำนำข้าวอีกก้อน เป็นภารกิจต้องติดตาม ซึ่ง 1,180 คดี ความเสียหาย 500,000 กว่าล้านบาท ต้องทุ่มเทกำลังเวลาในการปฏิบัติงานไปใช้กับการดำเนินคดีที่พวกท่านก่อไว้ 10 ปีที่แล้ว คดียังอยู่ในศาลคืบหน้าเป็นลำดับแต่ยังต้องใช้เวลาตามกระบวนการยุติธรรม อีกก้อน 30,000 กว่าล้านบาท ทุจริตจำนำมัน สมัยท่านเป็นรัฐบาลเหมือนกัน ตนถึงบอกว่าก๊อปปี้ทุจริตจำนำข้าวมาเลย ไม่ต้องเอ่ยว่ารัฐบาลไหนคือพวกท่านแล้วกัน ทำ อคส. ขาดทุน 33,000 ล้านบาท ต้องทุ่มเทกำลังฟ้อง ฟ้องแล้ว 164 คดี เรียกค่าเสียหาย 20,065 ล้านบาท ศาลจำคุกแล้ว 26 คดี แต่ยังไม่จบต้องเอาเจ้าหน้าที่ขึ้นศาลเพราะสิ่งที่พวกท่านก่อไว้ ตอนสั่งเร่งรัดทั้ง 3 ก้อน ไม่ได้เลือกที่รักมักที่ชังเพราะนี่คือเงินของรัฐตกน้ำไม่ไหลตกไฟไม่ไหม้ ต้องดำเนินการเอาคืน เพราะการเอาจริงเอาจังกับการทุจริตและความไม่โปร่งใสและความโปร่งใสของ อคส.ในยุคนี้ทำให้คะแนนคุณธรรมและความโปร่งใสของ อคส. กระเตื้องขึ้นเยอะ ยุคท่านได้ไม่ถึง 70 คะแนน ในปี 63-64 ป.ป.ช. ให้คะแนน อคส. มีคุณธรรมความโปร่งใสและเป็นองค์กรที่เชื่อถือได้ในเรื่องนี้ ปี 63 ได้ 83 คะแนนระดับเอ ปี 64 ได้ 93.59 คะแนน ตนไม่ได้ประเมินเองแต่ ป.ป.ช. ที่เป็นองค์กรอิสระในการจัดการกับการทุจริตและส่งเสริมความโปร่งใสและคุณธรรมธรรมาภิบาลในการบริหารบอกมา ที่ท่านบอกว่าไม่เห็นความคืบหน้า ท่านหูดับแล้ว เพราะทั้งหมดคือความคืบหน้าของการดำเนินการตามขั้นตอนกระบวนการกฎหมายชัดเจนทุกเรื่องทั้งแพ่ง อาญา วินัยและการหาตัวผู้กระทำผิดมาชดใช้ค่าเสียหาย 2000 ล้านบวกดอกเบี้ย ส่วนถ้าจะส่ง ป.ป.ช.ไม่มีปัญหา ดีจะได้ช่วยกันตรวจสอบการทุจริต ไม่ว่าที่ไหนก็ตามตนพร้อมให้ความร่วมมือท่านไม่ต้องห่วง คำต่อคำ การชี้แจงของ นายจุรินทร์ ลักษณวิศิษฏ์ ในการอภิปรายทั่วไปเพื่อลงมติไม่ไว้วางใจรัฐมนตรีเป็นรายบุคคล : https://www.democrat.or.th/newsDetail/2147 ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter : @democratTH Instagram : @Democratparty.th YouTube : พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH #ทีมจุรินทร์",
    "postengagement": 5415,
    "postreaction": 4504,
    "postcomment": 601,
    "postshare": 310,
    "posturl": "https://www.facebook.com/481862869964239/posts/597859731697885"
  },
  {
    "party": "ประชาธิปัตย์",
    "partymentioned": "อนาคตใหม่/ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2020-09-22",
    "postmessage": "ชุมพล แจงเหตุผลไม่แก้รัฐธรรมนูญ เพราะไม่ได้บกพร่อง ปัญหาวันนี้เกิดจากคน นักการเมือง พรรคการเมือง 23 ก.ย. 2563 นายชุมพล จุลใส สมาชิกสภาผู้แทนราษฎรจังหวัดชุมพร พรรคประชาธิปัตย์ อภิปรายในสภาผู้แทนราษฎรในการประชุมร่วมกันเพื่อพิจารณาแก้ไขร่างรัฐธรรมนูญแห่งราชอาณาจักรไทย โดยระบุว่า ส่วนตัวไม่เห็นด้วยกับญัตติที่เสนอแก้ไขรัฐธรรมนูญทุกร่างที่เสนอเข้าสู่การพิจารณาของที่ประชุมสภาผู้แทนราษฎรในวันนี้ ซึ่งแยกออกได้เป็น 2 กลุ่ม กลุ่มแรกที่มีความประสงค์ชัดเจนว่าจะยกเลิกรัฐธรรมนูญที่ใช้อยู่ในปัจจุบัน และให้สภาร่างรัฐธรรมนูญร่างรัฐธรรมนูญขึ้นใหม่ทั้งฉบับคือเสนอให้แก้รัฐธรรมนูญมาตรา 256 ให้มีการตั้งสภาร่างรัฐธรรมนูญขึ้นมาทำหน้าที่ร่างรัฐธรรมนูญ กลุ่มที่ 2 เสนอแก้ไขรัฐธรรมนูญเป็นรายมาตรา เช่นญัตติเสนอให้แก้ไขรัฐธรรมนูญมาตรา 272 ที่ไม่เห็นด้วยกับกลุ่มแรกที่จะยกเลิกรัฐธรรมนูญในปัจจุบัน แล้วร่างขึ้นใหม่ทั้งฉบับ ส่วนตัวมีความเห็นเหมือนกับประชาชนทั้ง 16.8 ล้านคน ที่ลงมติเห็นชอบรัฐธรรมนูญฉบับนี้ เพราะเห็นว่ารัฐธรรมนูญฉบับนี้ดีอยู่แล้วเหมาะสมกับสถานการณ์ของประเทศในขณะนี้ รัฐธรรมนูญฉบับนี้ได้กำหนดไว้ว่า นายกรัฐมนตรีซึ่งเป็นหัวหน้าคณะรัฐบาลบริหารประเทศจะต้องเป็นบุคคลพิเศษมีคุณลักษณะเหมาะสมที่พรรคการเมืองได้กลั่นกรองแล้วเสนอชื่อ ให้ประชาชนพิจารณาก่อนที่จะมีการลงคะแนนเสียงเลือกตั้งทั่วไป ทำให้ประชาชนได้รู้จักประวัติผลงานต่างๆก่อนการเลือกตั้งเป็นอย่างดีจะเห็นได้ว่าในการเลือกตั้งที่ผ่านมาคนไทยส่วนใหญ่ไปใช้สิทธิ์เลือกตั้งด้วยความตั้งใจที่จะให้พลเอกประยุทธ์ จันทร์โอชาได้เป็นนายกรัฐมนตรีเพื่อแก้ไขปัญหาของประเทศคนที่จะใช้สิทธิ์เลือกตั้งในวันนั้นตัดสินใจอยู่ 2 แนวทาง คือ เอาประยุทธ์กับไม่เอาประยุทธ์ถ้ารัฐธรรมนูญไม่บัญญัติบังคับไว้แม้เลือกตั้งผ่านไปประชาชนก็ไม่รู้ว่าสมาชิกสภาผู้แทนราษฎรจะเลือกใครต้องลุ้นกันจนถึงวันประชุมสภาผู้แทนราษฏร เพื่อลงคะแนนเลือกนายกรัฐมนตรีส่วนตัวมีประสบการณ์อยู่ในบรรยากาศของการลงคะแนนเสียงในสภาผู้แทนราษฎรเพื่อเลือกนายกรัฐมนตรีมาแล้วหลายครั้ง ยกตัวอย่างเช่น การเลือกตั้งทั่วไปเมื่อปี 2550 เลือกตั้งทั่วไปครั้งเดียว มีเหตุให้สภาชุดนั้นเลือกนายกรัฐมนตรี 3 ครั้งครั้งแรกสภาผู้แทนราษฎรลงคะแนนเสียงข้างมากเลือกนายสมัคร สุนทรเวชเป็นนายกรัฐมนตรี หลังจากนายสมัคร สุนทรเวช พ้นจากตำแหน่งก็เลือกนายกรัฐมนตรีขึ้นมาใหม่สมาชิกสภาผู้แทนราษฎรเสียงข้างมากเลือกนายสมชาย วงศ์สวัสดิ์ เป็นนายกรัฐมนตรี เมื่อนายสมชายพ้นตำแหน่งต้องเลือกนายกรัฐมนตรีกันใหม่ในสภาผู้แทนราษฎร ปรากฏเสียงข้างมากลงคะแนนเลือกนายอภิสิทธิ์ เวชชาชีวะเป็นนายกรัฐมนตรีแต่ในการเลือกตั้งครั้งที่ 3 ครั้งที่เกิดปัญหาฝ่ายแพ้ไม่ยอมแพ้ อ้างว่าการดำรงตำแหน่งนายกรัฐมนตรีของนายอภิสิทธิ์ไม่ชอบธรรมทั้งๆที่สภาชุดเดิมส.ส.ชุดเดิมในสภาเดิมเป็นผู้ลงคะแนนเลือกนายกรัฐมนตรีเหมือนกันทั้ง 3 ครั้งหลังจากนั้นได้เกิดเหตุจลาจลในบ้านเมืองปิดล้อมอาคารรัฐสภา ปิดล้อมทำเนียบรัฐบาลล้มการประชุมสุดยอดผู้นำอาเซียน นำกำลังติดอาวุธออกมาเข่นฆ่าประชาชนตายกันเป็นร้อยเผาบ้านเผาเมืองทำให้ประเทศเสียหายอย่างรุนแรงประสบการณ์ครั้งล่าสุดของตนได้ร่วมกับสมาชิกสภาผู้แทนราษฎรในสภานี้ลงคะแนนเสียงเลือกนายกรัฐมนตรีคนปัจจุบันวันนั้นถ้าจำกันได้เป็นการแข่งขันกันระหว่าง พลเอกประยุทธ์ จันทร์โอชา และนายธนาธร จึงรุ่งเรืองกิจปรากฏว่าสมาชิกสภาผู้แทนราษฎรเลือกพลเอกประยุทธ์เป็นนายกรัฐมนตรี 251 คนเลือกนายธนาธร 2 2 4 คน ผลจากการลงคะแนนพลเอกประยุทธ์ได้เป็นนายกรัฐมนตรีทำให้เกิดกระบวนการนอกสภาออกมาเคลื่อนไหวโจมตีว่าพลเอกประยุทธ์เป็นนายกเผด็จการนี่ก็เหมือนกันเป็นเรื่องของฝ่ายแพ้แล้วไม่ยอมแพ้ เหตุการณ์นี้เหมือนกับเหตุการณ์ในอดีตที่ฝ่ายสนับสนุนพลตำรวจเอกประชา พรหมนอกเมื่อลงคะแนนในสภาและแพ้นายอภิสิทธิ์ก็ไม่ยอมแพ้เช่นกันระดมกำลังกันก่อเหตุนอกสภาต่อต้านรัฐบาลนายอภิสิทธิ์ทั้งนายอภิสิทธิ์และพลเอกประยุทธ์ได้เป็นนายกรัฐมนตรีตามระบอบรัฐสภาโหวตเลือกนายกแข่งกันในสภาเมื่อฝ่ายตนแพ้ก็ โจมตีฝ่ายชนะว่าเป็นนายกเผด็จการที่ออกมาเคลื่อนไหวเรียกร้องให้แก้รัฐธรรมนูญในครั้งนี้ส่วนตัวเห็นว่าก็เพราะแพ้เลือกตั้ง แพ้การลงคะแนนเลือกนายกรัฐมนตรีในสภาผู้แทนราษฎรแต่ถ้าหากฝ่ายตนชนะในการเลือกตั้งก็จะไม่พูดว่าเลือกนายกโดยไม่ชอบธรรมหรือนายกเป็นเผด็จการ สิ่งที่เกิดขึ้นถ้าจำได้ในสมัยปี 2554 เป็นเรื่องเลวร้ายที่สุดที่ตนอยู่ในสภาแห่งนี้มารัฐบาลในขณะนั้นได้ใช้เสียงข้างมากในการออกพระราชบัญญัตินิรโทษกรรม ไม่ฟังเสียงใครออกมาเพื่อล้างผิดให้นายทักษิณ ชินวัตรและพวกพ้อง ให้พ้นผิดจากทางอาญานั่นคือรัฐบาลที่มาจากการเลือกตั้งไม่ฟังเสียงประชาชนเป็นรัฐธรรมนูญที่เป็นประชาธิปไตยฉบับหนึ่ง ในที่สุดประชาชนหลายคนออกมาประท้วงต่อต้านยาวนานถึง 7 เดือน ส่วนตัวก็เป็นคนหนึ่งที่ลาออกจากการเป็นสมาชิกสภาผู้แทนราษฎรออกไปเป็นแกนนำ ต่อสู้ร่วมกับประชาชนเพราะไม่มีทางเลือกอื่น รัฐธรรมนูญฉบับปัจจุบันได้ร่างขึ้นโดยกำหนดกฎเกณฑ์ในการปกครองบ้านเมืองเพื่อแก้ไขป้องกันไม่ให้เกิดเหตุการณ์ทางการเมืองแบบในอดีตอีกเพราะได้พบเห็นจากประสบการณ์จริงที่เกิดขึ้นคณะกรรมการร่างรัฐธรรมนูญจึงได้ร่างรัฐธรรมนูญฉบับนี้ขึ้นมาโดยมีบทบัญญัติต่างๆที่เป็นประโยชน์ต่อประเทศประชาชน 16.8 ล้านคนพร้อมใจกันลงมติให้ประกาศใช้เป็นกฎหมายรัฐธรรมนูญใช้เป็นกฎหมายสูงสุดในการปกครองประเทศ ใช้มา 3 ปีแล้วประชาชนเห็นว่ารัฐธรรมนูญฉบับนี้แก้ปัญหาที่เกิดขึ้นในอดีตแก้ปัญหาเผด็จการรัฐสภามาวันนี้ส่วนตัวมองไม่เห็นเลยว่ารัฐธรรมนูญฉบับนี้มีอะไรที่บกพร่องเสียหายจนต้องฉีกทิ้งยกเลิกแล้วร่างขึ้นมาใหม่ หากมีความบกพร่องไม่สมบูรณ์ใดๆในทางการเมืองหรือการปกครองในขณะนี้ก็เป็นเรื่องของคนเป็นเรื่องของนักการเมืองเป็นเรื่องของพรรคการเมืองทั้งสิ้นไม่ใช่ความบกพร่องของรัฐธรรมนูญฉบับนี้ ในแง่ตัวบทกฎหมายส่วนตัวเห็นว่าบทบัญญัติในรัฐธรรมนูญบทที่ 15 ว่าด้วยการแก้ไขเพิ่มเติมเจตนารมณ์ของรัฐธรรมนูญอนุญาตให้แก้ไขรัฐธรรมนูญมาตราใดมาตรา หนึ่งแต่ไม่ใช่เขียนขึ้นมาใหม่ทั้งฉบับ ส่วนตัวเห็นว่าญัตติที่ให้ตั้งสภาร่างรัฐธรรมนูญ เพื่อร่างรัฐธรรมนูญขึ้นมาใหม่ทั้งฉบับขัดต่อเจตนารมณ์ของรัฐธรรมนูญที่ใช้อยู่ในปัจจุบันย่อมทำไม่ได้แน่นอน ญัตติแก้ไขมาตรา 272 ส่วนตัวเข้าใจดีว่ามีความประสงค์ต้องการไม่ให้สมาชิกวุฒิสภาออกเสียงลงคะแนนเลือกนายกรัฐมนตรี โดยข้อเท็จจริงมาตรา 272 เป็นมาตราหนึ่ง ในบทเฉพาะกาลมีผลบังคับใช้เฉพาะ 5 ปีแรกเท่านั้นเมื่อพ้น 5 ปีแรกไปแล้วสมาชิกวุฒิสภาทั้งหลายหมดสิทธิ์ที่จะเลือกนายกรัฐมนตรีการเลือกรัฐมนตรีต้องปฏิบัติตามมาตรา 159 และสมาชิกสภาผู้แทนราษฎรเท่านั้นที่จะเป็นผู้ให้ความเห็นชอบแต่ว่ากันไปแล้วส่วนตัวก็ไม่ค่อยสนใจว่าสมาชิกวุฒิสภาจะโหวตเลือกนายกรัฐมนตรีได้หรือไม่เพราะในทางปฏิบัติใครจะดำรงตำแหน่งนายกรัฐมนตรีได้ ต้องมีสมาชิกสภาผู้แทนราษฎรสนับสนุนเกินครึ่งของสภาผู้แทนราษฎรต่อให้สมาชิกวุฒิสภา 250 คน ลงคะแนนให้ถ้าสมาชิกสภาผู้แทนราษฎรสนับสนุนไม่ถึงครึ่งก็เป็นนายกรัฐมนตรีได้ไม่กี่น้ำวันใดเสนอร่างพระราชบัญญัติงบประมาณรายจ่ายประจำปีงบประมาณสมาชิกสภาผู้แทนราษฎรเกินครึ่งไม่สนับสนุนนายกรัฐมนตรีคนนั้นและก็พร้อมใจกันยกมือไม่รับหลักการ ร่างพระราชบัญญัติงบประมาณวาระแรก แพ้มติกฎหมายสำคัญก็ต้องลาออกยุบสภาจบสนิทเป็นได้เดือนเดียว ส่วนตัวเห็นว่ามาตรา 272 จะมีหรือแก้ไขหรือยกเลิกไม่ใช่เรื่องที่เป็นสาระสำคัญสำหรับตนในขณะนี้วันนี้ผมภูมิใจที่ได้ทำหน้าที่แทนพี่น้องประชาชนชาวจังหวัดชุมพรและพี่น้องประชาชนชาวไทยทั้งประเทศแสดงความคิดเห็นในเรื่องการแก้ไขรัฐธรรมนูญหรือไม่แก้ไขรัฐธรรมนูญแทนประชาชน ภูมิใจที่ได้พูดแทนประชาชนด้วยความจริง ใจด้วยความสุจริตใจ ส่วนตัวทำหน้าที่ครบถ้วนสมบูรณ์ตามบทบัญญัติแห่งรัฐธรรมนูญมาตรา 114 ทำหน้าที่ผู้แทนของปวงชนชาวไทยที่ไม่ได้อยู่ภายใต้อาณัติมอบหมายของใครไม่ได้ถูกใครครอบงำไม่อยู่ภายใต้กระแสกดดันของม็อบการเมืองกลุ่มไหนส่วนตัวทำหน้าที่ผู้แทนปวงชนชาวไทยด้วยสำนึกรับผิดชอบด้วยความซื่อสัตย์สุจริตเห็นว่าสิ่งที่ตนพูดมาทั้งหมดนี้จะเป็นประโยชน์ต่อประเทศชาติและประชาชนอย่างแท้จริง ส่วนตัวไม่รับทุกร่างที่ เสนอเข้าที่ประชุมสภาผู้แทนราษฎรในวันนี้ ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter: @democratTH Instagram: @Democratparty.th YouTube: พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH",
    "postengagement": 1922,
    "postreaction": 1164,
    "postcomment": 250,
    "postshare": 508,
    "posturl": "https://www.facebook.com/296508406790/posts/10157276984126791"
  },
  {
    "party": "ประชาธิปัตย์",
    "partymentioned": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2020-12-14",
    "postmessage": "ราเมศ แจง ประธานรัฐสภา ทำหน้าที่เป็นกลาง ยึดหลักการความถูกต้อง นายราเมศ รัตนเชวง โฆษกพรรคประชาธิปัตย์ เลขานุการประธานรัฐสภา กล่าวต่อประเด็นที่พล.ต.อ.เสรีพิศุทธ์ เตมียเวส ส.ส.บัญชีรายชื่อ และหัวหน้าพรรคเสรีรวมไทย ระบุว่านายชวน หลีกภัย ประธานสภาผู้แทนราษฎร ฐานะประธานรัฐสภา ไม่มีความเป็นกลางต่อการตั้งกรรมการสมานฉันท์ ว่า ในหลักการการทำงานของกรรมการสมานฉันท์ คือ การเปิดพื้นที่พูดคุยและแสวงหาทางออกให้ประเทศ ไม่ใช่พื้นที่คาดหมัดตั้งมวยเป็นคู่แพ้คู่ชนะ ส่วนโครงสร้างของกรรมการสมานฉันท์ จำนวน 21 คนที่มาจากหลากหลายที่มา นั้นไม่ใช่คนของรัฐบาลทั้งหมด ดังนั้นอย่าพูดเพื่อชักใบให้เรือเสีย นายราเมศ กล่าวต่อว่ากรณีที่พล.ต.อ.เสรีพิศุทธ์ เตรียมฟ้องร้องนายชวน ต่อศาลฏีกาแผนกคดีอาญาของผู้ดำรงตำแหน่งทางการเมือง กรณีไม่เป็นกลาง หลังไม่ยอมให้อภิปรายไม่ไว้วางใจ พล.อ.ประยุทธ์ จันทร์โอชา นายกฯ และรมว.กลาโหม เรื่องการถวายสัตย์ปฏิญาณตน ว่า ตนในฐานะที่รับผิดชอบเรื่องกฎหมายเรื่องนี้มีข้อมูลข้อเท็จจริงครบถ้วนว่า นายชวน ทำหน้าที่ด้วยความเป็นกลางยึดหลักการตามรัฐธรรมนูญ และข้อบังคับ หากไม่มีความเป็นกลางการเปิดอภิปรายทั่วไปโดยไม่ลงมติซึ่งมีเรื่องถวายสัตย์อยู่ในญัตติด้วยคงไม่ถูกพิจารณา \"เรื่องอภิปรายไม่ไว้วางใจพล.ต.อ.เสรีพิศุทธ์ ควรจะรู้ว่าตามรัฐธรรมนูญและข้อบังคับมีกรอบในการอภิปรายมากน้อยแค่ไหน ไม่ไว้วางใจในการทำหน้าที่หรือไม่ไว้วางใจทั้งชีวิตของนายกรัฐมนตรีส่วนการจะไปฟ้องร้องนายชวน นั้นไม่ได้กังวลใจใดๆ ฟ้องมาก็พร้อมสู้มีสิ่งใดที่เป็นเท็จก็ฟ้องกลับก็เท่านั้นเอง\" นายราเมศ กล่าว ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter: @democratTH Instagram: @Democratparty.th YouTube: พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH",
    "postengagement": 305,
    "postreaction": 290,
    "postcomment": 9,
    "postshare": 6,
    "posturl": "https://www.facebook.com/296508406790/posts/10157453172071791"
  },
  {
    "party": "เพื่อไทย",
    "partymentioned": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2021-06-09",
    "postmessage": "ประยุทธ์คิดอะไรไม่ออก ตอบไม่ถูก #โทษคนอื่นเก่ง ต้องงัดไม้ตาย โยนความผิดไปให้ ‘จำนำข้าว’ จนชาวบ้านเอือมระอากันไปหมดแล้ว! . สุทิน คลังแสง ส.ส.มหาสารคาม และประธานวิปฝ่ายค้าน จัดหนัก จัดเต็ม อบรมผู้นำรัฐบาลประยุทธ์ ตั้งแต่หลักการสำคัญของนโยบายสาธารณะที่คำนึงถึงการแก้ไขปัญหาความทุกข์ยากของพี่น้องประชาชน กระบวนการทำงานและระบบของจำนำข้าวกับการหมุนเวียนของเม็ดเงินและเศรษฐกิจประเทศ แต่ต้องมาชะงักเพราะการรัฐประหารปี 2557 . รวมไปถึง ‘ความจริง’ ของเรื่อง หนี้สาธารณะจากจำนำข้าว กับหนี้จำนวนมหาศาลที่ พลเอกประยุทธ์ ได้สร้างเอาไว้ตลอด 7 ปีที่เข้ามาบริหารประเทศ . รับชมและรับฟัง ‘ความจริง’ กันอีกครั้ง จาก ‘สุทิน คลังแสง’ ในการ อภิปรายร่าง พ.ร.บ.งบประมาณปี 2565",
    "postengagement": 161311,
    "postreaction": 129495,
    "postcomment": 4258,
    "postshare": 27558,
    "posturl": "https://www.facebook.com/149079361791677/posts/4410314775668093"
  },
  {
    "party": "เพื่อไทย",
    "partymentioned": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2021-09-01",
    "postmessage": "ขยี้ ‘ประยุทธ์’ และ ‘อนุทิน’ กลางสภา จี้ให้เปิดข้อมูลหลักฐานการจัดหาวัคซีน เปิดเผย ‘ส่วนต่าง’ ที่ผิดปกติ ตามที่ ‘เลขาพรรคเพื่อไทย’ อภิปรายไม่ไว้วางใจไว้ในวันแรก . จิราพร สินธุไพร ส.ส.ร้อยเอ็ด พรรคเพื่อไทย เจ้าของฉายา 'รอยยิ้มประหาร' อภิปรายไม่ไว้วางใจ พลเอกประยุทธ์ จันทร์โอชานายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงกลาโหม และนายอนุทิน ชาญวีรกุล รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงสาธารณสุข ซึ่งแก้ไขวิกฤตโควิด-19 ผิดพลาด สร้างความเสียหายมหาศาล อีกทั้งยังเปิดหลักฐานชำแหละพวกมือถือสากปากถือศีล สวดมนต์ทุกวัน แต่กลับมีพฤติการณ์ที่ทำให้เห็นได้ว่าเป็นการค้าความตาย บนซากศพของพี่น้องประชาชน โดยเฉพาะความผิดปกติในจัดหาวัคซีน ที่เห็นร่องรอยส่วนต่างกว่า 1.6 พันล้านบาท . พรรคเพื่อไทย ชวนพี่น้องประชาชน “ลงมติประชาชน รวมพล #ไล่ประยุทธ์” ร่วมลงชื่อโหวตไม่ไว้วางใจรัฐบาล ผ่าน https://vote.ptp.or.th",
    "postengagement": 23080,
    "postreaction": 19829,
    "postcomment": 829,
    "postshare": 2422,
    "posturl": "https://www.facebook.com/watch/?v=219874660095877"
  },
  {
    "party": "เพื่อไทย",
    "partymentioned": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2021-12-08",
    "postmessage": "วันนี้เมื่อ 8 ปีที่แล้ว ยิ่งลักษณ์ ชินวัตร นายกรัฐมนตรี (ณ ขณะนั้น) ประกาศยุบสภา คืนอำนาจให้ประชาชน ตามกติกาประชาธิปไตยสากล หลังการชุมนุมของ ‘ กปปส.' (คณะกรรมการประชาชนเพื่อการเปลี่ยนแปลงปฏิรูปประเทศไทยให้เป็นประชาธิปไตยที่สมบูรณ์แบบอันมีพระมหากษัตริย์ทรงเป็นประมุข) ที่นำโดย สุเทพ เทือกสุบรรณ อดีตแกนนำพรรคประชาธิปัตย์ ทวีความรุนแรงมากขึ้น ซึ่งต่อมาได้กลายเป็นใบเบิกทางให้กับการรัฐประหาร ในนาม ‘คณะรักษาความสงบแห่งชาติ (คสช.)’ ภายใต้การนำของ พลเอก ประยุทธ์ จันทร์โอชา ในปี 2557 . ย้อนกลับไปก่อนที่ นายกฯ ยิ่งลักษณ์ จะประกาศยุบสภาคืนอำนาจให้ประชาชน สถานการณ์ความขัดแย้งทางการเมืองค่อนข้างร้อนระอุ นับตั้งแต่รัฐบาลยิ่งลักษณ์เริ่มบริหารงาน ประชาชนบางส่วนแสดงท่าทีไม่พอใจมาอย่างต่อเนื่อง ซึ่งต่อมา สุเทพ เทือกสุบรรณ แกนนำพรรคประชาธิปัตย์ ได้ชิงจังหวะประกาศชุมนุมใหญ่ครั้งแรก ในวันที่ 31 ตุลาคม 2556 บริเวณสถานีรถไฟสามเสน โดยอ้างต่อต้านกฎหมายนิรโทษกรรมและคัดค้านการแก้ไขรัฐธรรมนูญว่าด้วยที่มาวุฒิสภา พร้อมใช้ ‘การเป่านกหวีด’ เป็นสัญลักษณ์ในการประท้วงครั้งนี้ . ก่อนจะยกระดับเป็น ‘กปปส.’ ในวันที่ 29 พฤศจิกายน 2556 โดยมีเป้าหมายสูงสุดคือ จัดตั้งสภาประชาชนเพื่อควบคุมการปฏิรูปประเทศ และ นายกรัฐมนตรี ยิ่งลักษณ์ ชินวัตร ต้องลาออกจากการเป็นหัวหน้ารัฐบาล เพื่อนำไปสู่การเสนอชื่อ ‘นายกฯ’ คนใหม่ โดยอ้างประเพณีการปกครอง มาตรา 3 และ มาตรา 7 ของรัฐธรรมนูญ 2550 . ห้วงเวลานั้น ประชาชนจำนวนมากพากันเดินลงถนน เป่านกหวีดเพื่อเรียกร้องตามข้อเสนอของแกนนำ กปปส. แม้รัฐบาลในขณะนั้นจะถอนร่างกฎหมายนิรโทษกรรมปรองดองที่ค้างวาระอยู่ในสภาทั้งหมด รวมถึงมีความพยายามที่จะเจรจาหาทางออกร่วมกับ กปปส. แต่ก็ไม่เป็นผล เนื่องจากข้อเรียกร้องต่างๆ ของกปปส. นั้นไม่ตรงกับข้อกฎหมาย . เมื่อการเจรจาไม่ได้ช่วยทุเลาความขัดแย้งทางการเมือง ระหว่างทางยังคงมีการยกระดับการชุมนุมอย่างต่อเนื่อง ขณะที่บ้างส่วนได้เคลื่อนมวลชนปิดล้อมสถานที่ราชการหลายแห่ง โดยมีแกนนำสำคัญอย่าง สุเทพ เทือกสุบรรณ ประกาศจัดชุมนุมใหญ่ถึง 4 ครั้ง ได้แก่ วันที่ 11 พฤศจิกายน 2556, วันที่ 24 พฤศจิกายน 2556, วันที่ 1 ธันวาคม 2556 และวันที่ 9 ธันวาคม 2556 . 8 ธันวาคม 2556 พรรคประชาธิปัตย์เริ่มเคลื่อนไหว อภิสิทธิ์ เวชชาชีวะ นำลูกพรรคแถลงลาออกจากการเป็น ส.ส. ทั้งหมด เพื่อเข้าร่วมนำม็อบ กปปส. โดยตรง สร้างแรงกดดันอีกทางให้รัฐบาลลาออก และเปิดทางให้นายกฯ คนกลางเข้ามาทำหน้าที่แทน ขณะที่ฝากฝั่งหน้าเพจเฟซบุ๊คของนายกรัฐมนตรี ยิ่งลักษณ์ ชินวัตร ก็ได้แสดงจุดยืนพร้อมจะยุบสภา เตรียมจัดการเลือกตั้งใหม่ภายใน 60 วัน แต่หากมีผู้ไม่ยอมรับการเลือกตั้งก็จะเป็นการยืดเวลาขัดแย้งออกไป เหมือนปี 2549 ที่เกิดภาวะสูญญากาศและเกิดการรัฐประหารตามมา จึงได้เสนอให้หาข้อยุติด้วยการทำประชามติ . 9 ธันวาคม 2556 นายกฯ ยิ่งลักษณ์ ได้แถลงการณ์ยุบสภา ส่งผลให้รัฐมนตรีทั้งคณะพ้นจากตำแหน่งไปด้วยมาตรา 180 (2) แต่ต้องอยู่ในตำแหน่งเพื่อปฏิบัติหน้าที่ได้เท่าที่จำเป็น ภายใต้เงื่อนไขที่กำหนดในมาตราดังกล่าว และประกาศวันเลือกตั้งใหม่เป็นวันที่ 2 กุมภาพันธ์ 2557 . สิ้นสุดแถลงการณ์ยุบสภา #ณวันนั้น รัฐบาลยิ่งลักษณ์ หมดวาระการทำงาน นับเป็นการยุบสภาครั้งที่ 14 ในประวัติศาสตร์การเมืองไทย ถึงอย่างนั้น ท่าทีของ กปปส. ไม่ได้จบลงตาม แกนนำและผู้ชุมนุมยังคงยืนกรานให้มีการจัดตั้งสภาประชาชน ปฏิเสธการเลือกตั้ง และรณรงค์ไม่ให้ประชาชนออกไปเลือกตั้ง จนเป็นเหตุให้เกิดการขัดขวางการเลือกตั้ง มาตั้งแต่เปิดให้มีการสมัครรับเลือกตั้ง จนถึงวันที่กำหนดให้ประชาชนผู้มีสิทธิเลือกตั้งใช้สิทธิออกเสียงลงคะแนนในวันที่ 2 กุมภาพันธ์ 2557 ประชาชนบางส่วนที่ต้องการใช้สิทธิใช้เสียงของตัวเองไม่สามารถใช้ได้ ซึ่งต่อมาศาลรัฐธรรมนูญก็ได้วินิจฉัยให้การเลือกตั้งในวันนั้นเป็นโมฆะและไม่ชอบด้วยกฎหมาย โดยมีมติ 6 ต่อ 3 เมื่อวันที่ 21 มีนาคม 2557 . สามเดือนหลังจากนั้น กปปส. จึงยุติการชุมนุม หลังจากกลุ่มคณะรัฐประหารในนาม ‘คณะรักษาความสงบแห่งชาติ’ นำโดย พลเอกประยุทธ์ จันทร์โอชา เข้ายึดอำนาจสำเร็จ จนอาจกล่าวได้ว่าการชุมนุมประท้วงครั้งนั้น ถือเป็นใบเบิกทางชั้นดีให้กับการรัฐประหาร และนับเป็นหมุดหมายทางประวัติศาสตร์การเมืองไทยครั้งสำคัญอีกครั้ง . เพราะหลังจากนั้นประชาธิปไตยไทยได้ถูกทำลายและสูญหายไปตลอด 8 ปีที่ผ่านมา",
    "postengagement": 13267,
    "postreaction": 11697,
    "postcomment": 318,
    "postshare": 1252,
    "posturl": "https://www.facebook.com/149079361791677/posts/4983841204982111/"
  },
  {
    "party": "เพื่อไทย",
    "partymentioned": "อนาคตใหม่/ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2022-05-26",
    "postmessage": "พรรคเพื่อไทย นำโดย ประเสริฐ จันทรรวงทอง ส.ส.นครราชสีมาและเลขาธิการพรรคเพื่อไทย วิชาญ มีนชัยนันท์ ประธานภาค กทม. และอดีตรัฐมนตรีช่วยว่าการกระทรวงสาธารณสุข พวงเพ็ชร ชุนละเอียด ผู้อำนวยการการเลือกตั้ง ส.ก. และว่าที่ ส.ก. 20 คนของพรรคเพื่อไทย ร่วมกับแกนนำพรรคก้าวไกล นำโดย ชัยธวัช ตุลาธน เลขาธิการพรรคก้าวไกล และนายวิโรจน์ ลักษขณาอดิศร อดีตผู้สมัครผู้ว่าฯ กทม. และ ส.ก.พรรคก้าวไกล แถลงความร่วมมือระหว่างพรรคเพื่อไทยและพรรคก้าวไกลในการทำงานร่วมกันในสภา กทม. หลังจากได้มีการหารือและมีข้อสรุปร่วมกัน ดังนี้ . 1. ส.ก. จากพรรคเพื่อไทยและพรรคก้าวไกล จะร่วมกันทำงานเพื่อยกระดับประสิทธิภาพ และความโปร่งใส ของสภากรุงเทพฯ ทั้งนี้เพื่อให้เกิดประโยชน์สูงสุดต่อพี่น้องประชาชนชาวกรุงเทพฯ . 2.หลังจากที่คณะกรรมการการเลือกตั้งได้ให้การรับรองผลการเลือกตั้ง ในการร่วมกันทำงานตามข้อหนึ่ง ส.ก. ทั้งสองพรรค จะร่วมกันเห็นชอบในการลงมติเพื่อเลือกประธานสภา กทม. และรองประธานสภาฯ เพื่อให้การทำงานมีเอกภาพ โดยการแบ่งหน้าที่ต่างๆ ต้องเป็นไปอย่างความเหมาะสม โดยคำนึงถึง ส.ก.ทุกคน ในการทำงาน เพื่อควบคุม ตรวจสอบ และ ดูแลการบริหารราชการ กทม. ของฝ่ายบริหาร ที่มี ผู้ว่าฯ กทม. เป็นผู้บริหาร . 3.ส.ก.จากทั้งสองพรรค จะร่วมกันเห็นชอบให้มีการแก้ไขข้อบังคับการประชุมสภา เพื่อให้มีการตั้ง คณะกรรมการป้องกันและปราบปรามการทุจริตประพฤติมิชอบ และส่งเสริมการมีส่วนร่วมของประชาชน เพื่อทำให้การบริหารของ กทม.เป็นไปด้วยความสุจริต โปร่งใส ตอบสนองประโยชน์ของชาว กทม. อย่างแท้จริง . 4. ส.ก. ทั้งสองพรรค จะร่วมกันเห็นชอบให้มีการถ่ายทอดสดการประชุมสภา กทม. ทั้งนี้เพื่อสร้างการมีส่วนร่วมของประชาชน เพื่อความโปร่งใสในการทำงาน ทั้งนี้เพื่อให้ภาคประชาชน สามารถตรวจสอบการทำงานของสมาชิกสภาได้ . ทั้งนี้ ส.ก. จากทั้งสองพรรค มุ่งหวังที่จะทุ่มเทการทำงานให้กับประชาชนชาว กทม. อย่างเต็มที่ และเพื่อยกระดับการทำงานของสภา กมท. ให้เป็นที่พึ่งของประชาชนชาว กทม. ทุกคนต่อไป",
    "postengagement": 11360,
    "postreaction": 10553,
    "postcomment": 440,
    "postshare": 367,
    "posturl": "https://www.facebook.com/508952780600376/posts/584178619744458"
  },
  {
    "party": "เพื่อไทย",
    "partymentioned": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2019-11-25",
    "postmessage": "7 พรรคร่วมฝ่ายค้าน นำโดย นายสมพงษ์ อมรวิวัฒน์ หัวหน้าพรรคเพื่อไทย นายภูมิธรรม เวชยชัย ที่ปรึกษาหัวหน้าพรรคเพื่อไทย นายชูศักดิ์ ศิรินิล รองหัวหน้าพรรคเพื่อไทย นายธนาธร จึงรุ่งเรืองกิจ หัวหน้าพรรคอนาคตใหม่ นายปิยบุตร แสงกนกกุล เลขาธิการพรรคอนาคตใหม่ นายวันมูหะมัดนอร์ มะทา หัวหน้าพรรคประชาชาติ พ.ต.อ.ทวี สอดส่อง เลขาธิการพรรคประชาชาติ พล.ต.อ.เสรีพิศุทธ์ เตมียเวส หัวหน้าพรรคเสรีรวมไทย นายสงคราม กิจเลิศไพโรจน์ หัวหน้าพรรคเพื่อชาติ นายนิคม บุญวิเศษ หัวหน้าพรรคพลังปวงชนไทย และนายมนูญ สิวาภิรมย์รัตน์ หัวหน้าพรรคเศรษฐกิจใหม่ ประชุมร่วมกันเพื่อสรุปผลการดำเนินงานที่ผ่านมาและทิศทางการทำงานร่วมกันในอนาคต รวมถึงร่วมหารือกันในประเด็นท่าทีของฝ่ายค้านต่อการอภิปรายไม่ไว้วางใจ ยุทธศาสตร์และท่าทีการขับเคลื่อนใน กมธ. ศึกษาแก้ไขรัฐธรรมนูญ และยุทธศาสตร์การขับเคลื่อนรณรงค์แก้ไขรัฐธรรมนูญของ 7 พรรคฝ่ายค้านนอกสภาฯ ณ โรงแรมแลงคาสเตอร์ กรุงเทพฯ",
    "postengagement": 7168,
    "postreaction": 6790,
    "postcomment": 237,
    "postshare": 141,
    "posturl": "https://www.facebook.com/149079361791677/posts/2867908406575412"
  },
  {
    "party": "อนาคตใหม่/ก้าวไกล",
    "partymentioned": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-02-22",
    "postmessage": "***อัพเดต UPDATE 28 กรกฎาคม 2563*** ศาลตัดสินว่า \"นาจิบ ราซัก\" อดีตนายกรัฐมนตรีมาเลเซีย มีความผิดฐานละเมิดต่อหน้าที่ ใช้อำนาจในทางมิชอบ และยักยอกฟอกเงิน รวม 7 กระทง จากคดีอื้อฉาวระดับอินเตอร์เนชันแนล #1MDB โดยแต่ฐานความผิดนั้นมีโทษจำคุกสูงถึง 15-20 ปี และคดีนี้เป็นเพียงคดีแรก จากทั้งหมด 5 คดี รวมทั้งสิ้น 42 กระทง โดยคาดกันว่ามีการใช้งบประมาณผิดวัตถุประสงค์จากกองทุนความมั่งคั่งแห่งชาติไปกว่า 4.5 พันล้านเหรียญสหรัฐฯ หรือประมาณ 1.4 แสนล้านบาท! \"พันธมิตรมืด\" ว่าไงบ้าง? ------ รู้หรือไม่? รัฐบาลประยุทธ์ เป็นได้มากกว่าที่คุณคิด #1MDB ฉาวระดับอินเตอร์เนชันแนล ที่ทางการไทยมีส่วนช่วยจับคนบริสุทธิ์ยัดเข้าคุก แต่ให้ที่กบดานอาชญากรข้ามชาติ ยอมบิดผันกระบวนการยุติธรรม ทำลายความสัมพันธ์กับหลายประเทศ เพียงเพื่อ \"พันธมิตรมืด\" ลองฟังรายละเอียดกันดู (English version provided in the comment section)",
    "postengagement": 300103,
    "postreaction": 166473,
    "postcomment": 10579,
    "postshare": 123051,
    "posturl": "https://www.facebook.com/watch/?v=3025054727506800"
  },
  {
    "party": "อนาคตใหม่/ก้าวไกล",
    "partymentioned": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2021-07-15",
    "postmessage": "[ จับโกหกรัฐบาล ‘ซุปเปอร์ดีลวัคซีนม้าเต็ง’ อ้างได้ ‘แอสตร้าฯ’ ก่อน ใครก็มาตัดยอดไม่ได้ จนรัฐบาลใช้ภาษีประชาชน 600 ล้านหนุน ‘สยามไบโอไซเอนซ์’ สุดท้ายพังไม่เป็นท่า ถูกเลื่อนส่งไปถึงกลางปี 65 แต่ย้อนมาดู กลับไม่พบเงื่อนไขจำกัดการส่งออกในกรอบการทำสัญญา อย่างนี้โกหกกันตั้งแต่แรกนี่นา??? ] . เข้าสู่ไตรมาส 3 แล้ว แต่วัคซีนยังไม่เต็มแขนประชาชน และไม่ได้มีมากล้นโรงพยาบาลจนไม่มีที่จะเก็บดังที่อนุทินได้เคยกล่าวคำลวงกลางสภาเมื่อต้นปีที่ผ่านมา สิ่งที่ชวนเจ็บปวดหดหู่ไปกว่านั้นคือความไม่รู้สึกรู้สา แต่ละวันมีแต่คำแก้ตัวของรัฐบาลที่เปลี่ยนไปเปลี่ยนมา ในขณะที่ทุกวันนี้สิ่งเต็มแขนของประชาชนกลับเป็นด้ายดิบสายสิญจน์ที่เปื้อนไปด้วยคราบน้ำตาร่วงหล่นบนตราสังมัดรั้งผู้เสียชีวิตจากโควิด-19 ศพแล้วศพเล่า ส่วนในโรงพยาบาลเตียงก็กำลังล้นและเต็มไปด้วยผู้ป่วยหนัก . ประเทศที่ระบบสาธารณสุขมีความเข้มแข็งเป็นลำดับต้นของโลกอันน่าภาคภูมิใจ เดินทางมาสู่สถานการณ์ที่วิกฤตที่สุดขนาดนี้ได้อย่างไร ปฏิเสธไม่ได้ว่าแผนวัคซีนแบบ ‘แทงม้าเต็ง’ หรืออีกมุมก็คือการ ‘แทงม้าตัวเดียว’ เป็นหนึ่งในตัวแปรสำคัญที่พาพวกเราเดินมาถึงจุดนี้ และในวันนี้ ‘วิโรจน์ ลักขณาอดิศร’ จะมา ‘จับโกหก’ ในสารพัดความสับปลับของรัฐบาลชุดนี้และรัฐมนตรีสาธารณสุข ผ่านเหตุการณ์ต่างๆที่ปรากฏและสิ่งที่ซ่อนไว้ใน ‘สัญญาวัคซีน’ ที่ถูกโฆษณาเกินจริงมาตลอดเกือบหนึ่งปีที่ผ่านมา . *** ‘วัคซีนสูตรผสม’ เพิ่มประสิทธิภาพหรือแค่แก้ปัญหา AstraZeneca มาไม่ทัน???*** . 12 กรกฎาคม 2564 - ที่ประชุมคณะกรรมการโรคติดต่อแห่งชาติ มีมติเห็นชอบให้ฉีดวัคซีนโควิดสลับ 2 ชนิด เข็ม 1 เป็นวัคซีน Sinovac และเข็ม 2 เป็น AstraZeneca เพื่อเพิ่มประสิทธิภาพในการป้องกันเชื้อกลายพันธุ์สายพันธุ์เดลตา . 13 กรกฎาคม 2564 - ปรากฏเป็นข่าวว่า พล.อ.ประยุทธ์ จันทร์โอชา ในฐานะนายกรัฐมนตรี และผู้อำนวยการ ศบค. สั่งให้ทบทวนการฉีดวัคซีนสูตรผสม ดังกล่าว . 14 กรกฎาคม 2564 - มีการชี้แจงเพิ่มเติมว่า พล.อ.ประยุทธ์ ไม่ได้สั่งระงับ แต่ให้ทุกฝ่ายรับฟังความเห็นของคณะกรรมการโรคติดต่อแห่งชาติในกรณีการใช้วัคซีนสูตรผสม ซึ่งปัจจุบันยืนยันแล้วว่า รัฐบาลจะใช้วัคซีนสูตรผสมนี้ต่อไป . “แต่คำถามที่เกิดขึ้นในใจของประชาชนโดยทันที คือทำไมรัฐบาลไทยจึงตัดสินใจใช้วัคซีนสูตรผสมระหว่างวัคซีน Sinovac และ AstraZeneca? สำนักข่าวรอยเตอร์ ให้ข่าวว่าเป็นการตัดสินใจใช้เป็นครั้งแรกในโลก โดยที่ยังไม่มีการศึกษาวิจัยที่ทำอย่างเป็นระบบ และตีพิมพ์ในวารสารทางวิชาการในระดับนานาชาติที่มากเพียงพอ เมื่อเทียบเคียงกับประเทศอังกฤษ ที่ใช้วัคซีน AstraZeneca เป็นวัคซีนหลัก และมีโรงงานผลิตวัคซีน AstraZeneca เช่นเดียวกับประเทศไทย ก็ปรากฎว่าที่ประเทศอังกฤษ โดยคณะกรรมการร่วมด้านการให้วัคซีนและการเสริมสร้างภูมิคุ้มกันโรค (Joint Committee on Vaccination and Immunisation หรือ JCVI) ได้เสนอแนะต่อสำนักงานสาธารณสุขอังกฤษ (Public Health England หรือ PHE) ให้ใช้การฉีดวัคซีน AstraZeneca 2 เข็ม โดยร่นระยะเวลาเข็มที่ 2 ให้เร็วขึ้นจาก 12 สัปดาห์เป็น 8 สัปดาห์ ในการรับมือกับเชื้อสายพันธุ์เดลต้า ซึ่งแตกต่างจากประเทศไทย ทั้งๆ ที่มีโรงงานผลิตวัคซีน AstraZeneca ตั้งอยู่ภายในประเทศเหมือนกัน” . พล.อ.ประยุทธ์ เคยแจ้งกับประชาชนไว้เมื่อวันที่ 17 มกราคมว่า “จะไม่ยอมให้รีบร้อนฉีดวัคซีนที่ยังทดสอบไม่ครบถ้วน และไม่ยอมเป็นประเทศทดลอง ดังนั้น เพื่อความรอบคอบ ผมจึงมีนโยบายสำคัญ คือ ต้องมั่นใจก่อนว่า วัคซีนนั้นปลอดภัย จึงจะนำมาใช้กับคนไทยได้” . กรณีนี้นายอนุทิน ชาญวีรกูล รัฐมนตรีว่าการกระทรวงสาธารณสุข ก็เคยให้สัมภาษณ์ไว้ในทำนองเดียวกันเมื่อวันที่ 2 กุมภาพันธ์ว่า “การเอาคนไทยมาเป็นผู้ถูกทดลองวัคซีน ไม่เคยอยู่ในหัวของ รมว.สาธารณสุขคนนี้” . แม้ว่าจะมีเหตุผลชี้แจงว่า การใช้วัคซีนสูตรผสม Sinovac และ AstraZeneca เข็ม 2 จะใช้เวลาห่างกันเพียง 3-4 สัปดาห์เท่านั้น ซึ่งเร็วกว่าการใช้ AstraZeneca ทั้ง 2 เข็ม ที่ต้องฉีดห่างกัน 8 สัปดาห์ แต่ก็มีข้อโต้แย้งว่า มีงานวิจัยที่มากเพียงพอหรือไม่ที่จะยืนยันว่าการฉีดวัคซีน Sinovac และ AstraZeneca ห่างกัน 3-4 สัปดาห์ จะมีประสิทธิผลต่อการรับมือเชื้อสายพันธุ์เดลต้าได้อย่างมีประสิทธิผล เป็นเรื่องที่น่ายินดีอย่างยิ่งที่ประเทศไทยได้รับการบริจาควัคซีน AstraZeneca จากประเทศญี่ปุ่นจำนวน 1,050,000 โดส ซึ่งได้มีการรับมอบไปเมื่อวันที่ 12 กรกฎาคมที่ผ่านมา แต่ประชาชนจำนวนไม่น้อยก็สงสัยว่า เหตุใดทั้งๆ ที่ประเทศไทยมีโรงงานผลิตวัคซีน AstraZeneca ตั้งอยู่ภายในประเทศ หากรับบริจาควัคซีนยี่ห้ออื่น ก็พอเข้าใจเหตุผลได้ แต่การรับบริจาควัคซีนที่เรามีโรงงานของเราเอง ยิ่งทำให้ประชาชนสงสัยเป็นอย่างมากว่า . “เป็นไปได้หรือไม่ว่า วัคซีน AstraZeneca ที่ผลิตในประเทศไทย จะไม่สามารถส่งมอบให้กับคนไทยได้ตามแผนการจัดหาที่รัฐบาลประกาศให้ประชาชนทราบ???” . *** จับสัญญาณ AstraZeneca ไม่มาตามนัด*** . 13 มิถุนายน 2564 อธิบดีกรมควบคุมโรค ออกมาให้ข่าวในทำนองว่า ตัวเลข 61 ล้านโดส ไม่ใช่ตัวเลขที่ AstraZeneca จะจัดส่งมอบวัคซีนให้กับรัฐบาลไทย แต่เป็นเพียงศักยภาพในการฉีดเท่านั้น ทำให้ประชาชนกังวลเป็นอย่างมาก เพราะที่ผ่านมาแผนการจัดหาวัคซีน AstraZeneca จำนวน 61 ล้านโดส รัฐบาลได้สื่อสารให้กับประชาชนทราบในหลายช่องทาง ไม่ว่าจะเป็นการสรุปข่าวการประชุมคณะรัฐมนตรี 20 เมษายน 2564 ที่เว็บไซต์ของรัฐบาลไทย เพจศูนย์ข้อมูล COVID-19 เพจไทยคู่ฟ้า หรือ เว็บไซต์ของสำนักงานบริหารนโยบายของนายกรัฐมนตรี ซึ่งระบุข้อมูลตรงกันว่าในเดือนมิถุนายน 2564 จะได้รับวัคซีน AstraZeneca 6.3 ล้านโดส (6,333,000 โดส) กรกฎาคม-พฤศจิกายน เดือนละ 10 ล้านโดส และธันวาคมอีก 5 ล้านโดส รวมเป็น 61 ล้านโดส ภายในสิ้นปี 2564 . “ปัญหาการส่งมอบเกิดขึ้นจริงๆ เดือนมิถุนายน จากข้อมูลระบบติดตามตรวจสอบย้อนกลับโซ่ความเย็น ที่จัดทำขึ้นโดยกระทรวงอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม(อว.) พบว่ามีการส่งมอบวัคซีน AstraZeneca เพียง 5,371,100 โดส ขาดส่งจากแผนการจัดหาวัคซีน 6,333,000 โดส อยู่ถึง 961,900 โดส ซึ่งหมายถึงชีวิตของประชาชนคนไทยเกือบ 1 ล้านคน ที่สูญเสียโอกาสในการปกป้องชีวิตของตนเองจากโรคระบาด” . ต่อมา วันที่ 2 กรกฎาคม 2564 ได้รับคำยืนยันจากผู้อำนวยการสถาบันวัคซีนแห่งชาติว่า ในเดือนกรกฎาคมนี้ AstraZeneca น่าจะส่งมอบวัคซีนได้เพียง 5-6 ล้านโดสต่อเดือน ไม่ถึง 10 ล้านโดส ตามแผนการจัดหาวัคซีน ทั้งๆ ที่ เมื่อวันที่ 17 กุมภาพันธ์ที่ผ่านมา อนุทิน รัฐมนตรีว่าการกระทรวงสาธารณสุข ได้ชี้แจงต่อสภาผู้แทนราษฎรด้วยตนเองว่า ในไตรมาสที่ 3 วัคซีน AstraZeneca จะมีเต็มโรงพยาบาล เต็มแขนพี่น้องประชาชนคนไทย มีจนไม่พอเก็บ นอกจากนี้ ในวันที่ 14 มีนาคม อนุทินก็ยังได้ให้สัมภาษณ์ยืนยันอีกด้วยว่า วัคซีนหลักของประเทศไทยคือวัคซีน AstraZeneca . แต่ที่ผ่านมาจนถึงปัจจุบัน รัฐบาลไทยกลับมีการสั่งหาวัคซีน Sinovac อย่างต่อเนื่องหลายระลอกทั้งที่มีและไม่มีมติ ครม. รวมๆ แล้ว 19.5 ล้านโดส ทำให้ประชาชนสับสนว่า ตกลงวัคซีนยี่ห้อไหนเป็นวัคซีนหลักกันแน่ หากวัคซีน AstraZeneca เป็นวัคซีนหลัก เหตุใดจำนวนการส่งมอบถึงได้มีน้อยกว่าวัคซีน Sinovac??? . ***จนมาวันนี้ ประกาศเลื่อนส่งครบ 61 ล้านโดสไป 6 เดือน กว่าจะมาครบจากสิ้นปี 2564 ปาไป พฤษภาคม 2565*** . “คำถามที่ก้องอยู่ในใจของประชาชน ก็คือในเมื่อประชาชนมีความชอบธรรมที่จะได้รับวัคซีนได้ตามแผนการจัดหาวัคซีน 10 ล้านโดสต่อเดือน และรัฐมนตรีก็ได้ให้คำมั่นเอาไว้กลางสภา เหตุใดรัฐบาลจึงไม่พยายามที่จะหารือกับ AstraZeneca ในการปรับลดการส่งออกวัคซีน เพื่อให้คนไทยได้รับวัคซีนตามสิทธิที่พึงได้รับ ทำไมรัฐบาลถึงไม่รักษาผลประโยชน์ ไม่ปกป้องชีวิตของประชาชน อีกทั้งเมื่อเช้าวันนี้ วันที่ 15 กรกฎาคม ก็เพิ่งได้ทราบความจริงจากสาธิต ปิตุเตชะ รัฐมนตรีช่วยว่าการกระทรวงสาธารณสุข ผ่านรายการเจาะลึกทั่วไทยฯ ว่า... . ...วัคซีน AstraZeneca จำนวน 61 ล้านโดส ตามแผนที่ต้องส่งมอบให้ประชาชนคนไทยภายในธันวาคม 2564 ได้ถูกขยายออกไปเป็นเดือน พฤษภาคม 2565 และแจ้งด้วยว่า AstraZeneca จะส่งมอบวัคซีนให้กับรัฐบาลไทย 40% ของกำลังการผลิต ซึ่งก็คือ ราวๆ 6 ล้านโดสต่อเดือน... . ซึ่งก็ไม่เป็นไปตามแผนการจัดหาวัคซีนเดือนละ 10 ล้านโดส ตามที่รัฐบาลได้ให้คำมั่นเอาไว้กับประชาชนคนไทย และยังได้บอกเพิ่มเติมอีกด้วยว่า ในสัญญาไม่ได้กำหนดระยะเวลาการส่งมอบ แต่อย่างไรก็ตาม โดยหลักการแล้วแม้ว่าจะไม่มีการกำหนดระยะเวลาการส่งมอบเอาไว้ในสัญญา แต่ก็ต้องระบุถึงแผนประมาณการการส่งมอบ ซึ่งไม่มีไม่ได้ จึงขอเรียกร้องให้รัฐบาลนำเอาแผนประมาณการการส่งมอบนั้น มาชี้แจงให้กับประชาชนคนไทยทราบ . “พรรคก้าวไกลเชื่อว่า ข้อความนี้น่าจะอยู่ในสัญญาบริเวณที่ถมดำที่ปิดบังไว้ไม่ให้ประชาชนทราบ ดังนั้นพรรคก้าวไกลขอเรียกร้องให้เปิดเผยข้อมูลเเละเอกสารดังกล่าวโดยเร็วที่สุด คำถามที่ยังกึกก้องอยู่ในหัวใจของประชาชนคนไทยทุกคน ในตอนนี้ ก็คือ ทำไม พล.อ.ประยุทธ์ จันทร์โอชา และนายอนุทิน ชาญวีรกูล เเละนายสาธิต ปิตุเตชะ ยอมให้มีเลื่อนการจัดส่งวัคซีนได้อย่างไร และเหตุใดจึงไม่พยายามที่จะจำกัดการส่งออกวัคซีน เพื่อให้ประชาชนคนไทยได้รับ ทั้งๆ ที่ คุณอนุทิน เคยบอกเอาไว้ชัดว่า “จะไม่มีวันที่คนไทยจะถูกตัดคิว ไม่มีวันที่จะมีคนมาแย่ง ไม่มีวันที่จะไม่ถึงมือคนไทย” . *** ข้อสังเกตใหม่ ไม่เคยมี “ไทยต้องได้ก่อน” ในสัญญา*** . เมื่อมาตรวจสอบเอกสารทั้งหมดเกี่ยวกับสัญญาวัคซีน AstraZeneca ที่ได้รับมาจากสถาบันวัคซีนแห่งชาติ พบเรื่องที่น่ากังวลเป็นอย่างยิ่ง ในเอกสาร Letter of Intent หนังสือแสดงเจตจำนงก่อนการทำสัญญา รัฐบาลของ พล.อ.ประยุทธ์ จันทร์โอชา โดยคุณอนุทิน ได้ไปลงนามเมื่อวันที่ 12 ตุลาคม 2563 ย้ำว่า วันที่ 12 ตุลาคม 2563 โดยในหัวข้อที่ 1. ข้อย่อย C. ระบุเอาไว้ชัดเจนว่า . “Agreeing to the export of the vaccine without limitations, based on the constructive discussion between MOPH and AstraZeneca แปลได้ว่า ได้ตกลงในเงื่อนไขการส่งออกวัคซีนโดยปราศจากข้อจำกัด ซึ่งอยู่บนพื้นฐานของการหารือกันอย่างสร้างสรรค์ระหว่างกระทรวงสาธารณสุข และ AstraZeneca” . “แม้ว่าหนังสือฉบับนี้จะไม่มีผลผูกพันกับกฎหมายเเต่เป็นเรื่องที่ประชาชนต้องถามต่อพล.อ.ประยุทธ์ และนายอนุทิน ซึ่ง พล.อ.ประยุทธ์ และคุณอนุทิน ต้องตอบประชาชนว่า ทำไมถึงไปแสดงเจตจำนงในการทำสัญญาอย่างนั้น ไปตกลงให้มีการส่งออกโดยปราศจากข้อจำกัดได้อย่างไร แล้วเงื่อนไขการอุดหนุนงบประมาณจาก พ.ร.ก.เงินกู้ฯ จำนวน 600 ล้านบาทให้กับบริษัท สยามไบโอไซเอนซ์ จำกัด โดยระบุเงื่อนไขว่า “จะได้รับการส่งมอบวัคซีนเป็นอันดับแรกตามความต้องการ ที่เหลือจึงนำไปส่งออก” เมื่อวันที่ 24 สิงหาคม 2563 นั้นไม่มีความหมายเลยหรืออย่างไร?!? . ***ย้อนฟัง ‘อนุทิน’ เคยยืนยันหนุน ‘สยามไบโบไซเอนซ์’ ผลิต AstraZeneca วัคซีนไทยจะไม่มีวันถูกใครแย่ง?!?*** . อนุทินเองก็เคยยืนยันเอาไว้อย่างหนักแน่น ในการชี้แจงต่อการอภิปรายไม่ไว้วางใจ เมื่อวันที่ 17 กุมภาพันธ์ที่ผ่านมาว่า . “วัคซีน AstraZeneca จะไม่มีวันถูกตัดคิว ไม่มีวันถูกคนมาแย่ง ไม่มีวันที่จะไม่ถึงมือของเรา เพราะผลิตอยู่ในบ้านของเรา” . พอมาวันนี้ รัฐมนตรีช่วย สาธิต ปิตุเตชะ กลับบอกว่าทั้งหมดนี้ไม่มีในสัญญาแต่อย่างใด เป็นเพียงตัวเลขที่พูดคุยต่อรองกันเท่านั้น อ้าวววววว!!!???!!!! . /// คำถามสำคัญจึงกลับมาที่รัฐบาล ว่าทั้งหมดที่เคยป่าวประกาศกับประชาชนถึงตัวเลขจำนวนโดสและเงื่อนเวลาที่จะได้รับนั้น เป็นตัวเลขที่ฝ่ายเรามโนเองล้วนๆ ไม่มีในสัญญาหรอกหรือ??? และที่เคยพูดปกป้องดีลนี้พร้อมการสนับสนุนสยามไบโอไซเอนซ์อีก 600 ล้านบาท พร้อมกันที่ระบุในเอกสารเงินกู้ว่าไทยมีสิทธิในวัคซีนก่อนนั้น...ก็คือโกหกคำโตมาตลอด อย่างนั้นหรือ???/// . ทั้งหมดนี้ ไม่เข้าใจว่าทำไปเพื่ออะไร? เพราะรัฐบาลก็เสียเครดิต ประชาชนก็ติดเชื้อตายกันวันละเป็นร้อย . คิดได้แค่อย่างเดียว ก็คือการชงให้บริษัทเอกชนเพียงรายเดียว ได้รับการอัปเกรดเครื่องไม้เครื่องมือโรงงานตนเอง และได้สิทธิ์รับจ้างผลิตวัคซีน ได้หน้าและได้เงินกันไปเท่านั้นหรือ? . นี่คือการ ‘แทงม้าตัวเดียว’ หวังว่าทุกอย่างจะดีตามที่คิด ไม่มีแผนเผื่อ ไม่กระจายความเสี่ยง เมื่อพลาดขึ้นมา กว่าจะรู้ตัว ก็บรรลัยกันแล้วทั้งชาติ . #ก้าวไกล #เปิดสัญญาวัคซีน #โควิด19 #วัคซีน",
    "postengagement": 29716,
    "postreaction": 21170,
    "postcomment": 576,
    "postshare": 7970,
    "posturl": "https://www.facebook.com/100106918288004/posts/356222359343124"
  },
  {
    "party": "อนาคตใหม่/ก้าวไกล",
    "partymentioned": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2021-12-06",
    "postmessage": "[ เบื้องหลัง ‘นิคมฯ จะนะ’ ฉบับขายฝัน ของ ‘นักการเมืองใหญ่’ และ ‘นายทุนขาประจำ’ ที่มีทหารคอยดูแล ] . ย้อนอ่านสรุปคำอภิปรายไม่ไว้วางใจ ‘นิพนธ์ บุญญามณี’ รัฐมนตรีช่วยว่าการกระทรวงมหาดไทย แห่งพรรคประชาธิปัตย์ ผู้มีบทบาทสำคัญในการผลักดัน ‘นิคมอุตสาหกรรมจะนะ’ จังหวัดสงขลา อย่างสุดลิ่มทิ่มประตู แม้เบื้องหน้าอาจบอกว่า นี่คือการพัฒนาครั้งใหญ่ของปักษ์ใต้บ้านเรา แต่เบื้องหลังกลับเป็นการจับมือกันของนักการเมืองตัวร้ายกับนายทุนตัวแสบที่มีทหารเป็นผู้อำนวยความสะดวก เพื่อหาประโยชน์ ฟันกำไรมหาศาลจากส่วนต่างราคาที่ดินและการใช้อำนาจหน้าที่เปลี่ยน ‘สีผังเมือง’ ใหม่อย่างไร้ยางอาย . ประเสริฐพงษ์ ศรนุวัตร์ - Prasertpong Sornnuvatara ขุนพลภาคใต้ในฐานะ ส.ส.บัญชีรายชื่อ พรรคก้าวไกล รับหน้าที่อภิปรายไม่ไว้วางใจ จับพิรุธโครงการใหญ่ ฉบับ สอดไส้-ขายฝัน โครงการนี้ใครเป็นใคร และมีพฤติกรรมอย่างไร มาร่วมกันติดตามโครงการไปกับเรากันเลย . . ?? โครงการนิคมฯจะนะ ‘เมืองอุตสาหกรรมก้าวหน้าแห่งอนาคต’ ไม่ได้อยู่ในแผน ‘เขตพัฒนาพิเศษเฉพาะกิจ’ ของรัฐบาล คสช. มาตั้งแต่แรก ในปี 2559 แต่เพิ่งถูกสอดไส้เข้ามาทีหลัง . นิพนธ์ บุญญามณี ในฐานะนายก อบจ. ผลักดันแนวทางพัฒนาเศรษฐกิจของ 4 อำเภอของ จ.สงขลา ด้วยการยกระดับให้เป็นอุตสาหกรรมพลังงานครบวงจร (Energy Complex) ต่อมา วันที่ 7 พฤษภาคม 2562 คณะรัฐมนตรี คสช. จึงออก มติ ครม. ทิ้งทวนช่วงสุญญากาศ ระหว่างรอรัฐบาลใหม่หลังการเลือกตั้ง 24 มีนาคม 2562 เห็นชอบขยายผลโครงการเมืองต้นแบบสามเหลี่ยมมั่นคงมั่งคั่งยั่งยืนไปสู่พื้นที่ อ.จะ . ?? TPIPP และ IRPC ได้รับการอนุมัติงบลงทุน 18,680 ล้านบาท มีการใช้ประโยชน์ตามแผนการของโครงการในพื้นที่ 16,753 ไร่ โดยโครงการนี้ไม่เคยมีการพูดคุยหรือผ่านกระบวนการความมีส่วนร่วมจากคนในพื้นที่มาก่อน . ?? อีกปัญหาสำคัญคือ สีผังเมืองเดิม เป็น ‘สีเขียว’ หรือถูกกำหนดให้เป็นพื้นที่เกษตรกรรมเท่านั้น เพื่อเคลียร์ปัญหา ศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้ (ศอ.บต.) จึงกระโดดเข้ามาเป็นผู้ดำเนินการทั้งที่ไม่มีบทบาทหน้าที่ใดเกี่ยวข้องกับเรื่องนี้ โดยได้จัดให้มีกระบวนการรับฟังความคิดเห็น (เทียม) และชงเรื่องการเปลี่ยนสีผังเมืองให้เป็น ‘สีม่วง’ เพื่อให้สามารถลงทุนใช้ประโยชน์ในอุตสาหกรรมได้ . ?? คนในพื้นที่กังวลว่า หากเกิดนิคมฯ จะนะ อาชีพและธุรกิจที่สอดคล้องกับวิถีชีวิตจะหายไป และจะเกิดการทำลายล้างทรัพยากรทางทะเลครั้งมโหฬาร จากเดิมที่จะนะเป็นพื้นที่ทรัพยากรสมบูรณ์เหมาะแก่การทำเกษตรและการประมง มีการผลักดันการท่องเที่ยวเชิงนิเวศ เช่น การล่องเรือดูปลาโลมาสีชมพู ธุรกิจเลี้ยงนกเขาแข่งขัน และธุรกิจเกี่ยวเนื่องที่สร้างมูลค่าทางเศรษฐกิจไม่ต่ำกว่าปีละ 100 - 500 ล้านบาท . ?? แนวโน้มความสำเร็จโครงการ อาจไม่เป็นไปตามที่ ศอ.บต. ขายฝันว่า เม็ดเงินลงทุน 18,680 ล้านบาท จะทำให้เกิดการจ้างงานในพื้นที่ถึง 100,000 ตำแหน่ง เพราะเขตเศรษฐกิจพิเศษชายแดนทั้ง 10 เขต ที่เกิดจากนโยบายของประยุทธ์ ล้วนแล้วแต่ล้มเหลวทั้งหมด . ?? ความต้องการให้เกิด Energy Complex ไม่ได้มาจากรัฐ แต่มาจากความต้องการของกลุ่มทุน TPIPP จากเอกสารเตรียม EIA ของบริษัท วันที่ 4 พฤศจิกายน 2563 ยืนยันชัดเจนว่า TPIPP เป็นผู้ไปเสนอแผนการผลักดันพัฒนาโครงการในพื้นที่จะนะ ข้อสงสัยคือ ทำไมไม่ให้การไฟฟ้าฝ่ายผลิตที่เป็นรัฐวิสาหกิจทำ อย่างไรก็ตาม เครือ TPIPP เป็นหนึ่งในกลุ่มทุนที่มีชื่อเป็นผู้บริจาคเงินผ่านโต๊ะจีนประชารัฐ . ?? ร่องรอยความไม่ปกติเกี่ยวกับการ ‘กว้านซื้อที่ดิน’ ในพื้นที่จะนะ พบว่า เกี่ยวพันกับกลุ่มบุคคลที่มีความเชื่อมโยงกันเป็นเครือข่ายหรือเครือญาติกับ นิพนธ์ บุญญามณี ทั้งสิ้น ไม่ว่า ลูกชาย ทนายความคนสนิท ลูกพี่ลูกน้องของภรรยา คู่เขย เป็นต้น มีการซื้อขายทั้งหมด 23 ธุรกรรม พื้นที่ 464 ไร่ มูลค่า 110 ล้านบาท ราคาเฉลี่ย 236,166 บาทต่อไร่ . ?? บริษัท ทีพีไอ โพลีน เพาเวอร์ จำกัด (มหาชน) หรือ TPIPP กว้านซื้อที่ดิน 25 ธุรกรรม พื้นที่ 450 ไร่ มูลค่า 271 ล้านบาท ราคาเฉลี่ย 602,608 บาทต่อไร่ . ?? หากใช้ วันที่ 21 มกราคม 2563 ที่ ครม. มีมติเห็นชอบโครงการจะนะ และให้ ‘เปลี่ยนสีผังเมือง’ เป็นตัวแบ่ง พบว่า ผู้ที่ทำการกว้านซื้อที่ดินก่อนวันที่ 21 มกราคม 2563 จำนวนมากคือกลุ่มของ นิธิกร, สิรภพ และเครือข่ายครอบครัวนิพนธ์ ส่วนกลุ่มที่ทำการกว้านซื้อที่ดินมากหลังวันที่ 21 มหราคม 2563 คือบริษัท TPIPP จึงเป็นข้อสงสัยว่า เครือข่ายครอบครัว นิพนธ์รู้ล่วงหน้าว่าจะมีมติ ครม. ออกมาในวันไหนที่จะมีผลกับราคาที่ดินหรือไม่ จึงได้เร่งซื้อเร่งโอนที่ดินก่อนที่จะมี มติ ครม. ออกมา จึงมีคำถามว่าเป็นลักษณะพฤติกรรมการใช้ข้อมูลภายในจากฐานะรัฐมนตรี เอื้อประโยชน์ให้เครือญาติเพื่อกว้านซื้อที่ดินใช่หรือไม่ . ?? เครือข่ายและครอบครัวของ นิพนธ์ สามารถเอาที่ดินไปขายต่อได้ราคาเพิ่มขึ้น 2-3 เท่าจากที่ซื้อมาจากชาวบ้าน ส่วน TPIPP หากสามารถผลักดันให้เกิดนิคมอุตสาหกรรมได้จริง จะสามารถขายที่ดินในนิคมได้ไร่ละ 3,000,000 บาท หรือเพิ่มขึ้น 10 เท่าตัว . ?? ยังมีข้อสงสัยอีกว่า เครือข่าย นิพนธ์ พยายามรวบรวมที่ดิน นส. 3ก. ให้บริษัท TPIPP ไปออกโฉนดหรือไม่ เพราะหลังจาก ครม. มีมติ เดินหน้านิคมฯจะนะ คณะกรรมการยุทธศาสตร์ด้านการพัฒนาจังหวัดชายแดนภาคใต้ (กพต.) ที่มี พล.อ. ประวิตร เป็นประธาน ในการประชุมวันที่ 21 ตุลาคม 2562 และ นิพนธ์อยู่ในที่ประชุมด้วย ได้มีมติให้สำนักงานที่ดินในพื้นที่ดังกล่าว สนับสนุนการออกเอกสารสิทธิ์ที่ดินทำกินให้กับประชาชนเป็นการเร่งด่วน ซึ่ง นิพนธ์ รับลูกอย่างรวดเร็ว โดยตั้ง ‘ศูนย์อำนวยการเดินสำรวจออกโฉนดที่ดิน จ.สงขลา-นครศรีธรรมราช’ แต่ในทางปฏิบัติกลับเน้นอนุมัติเฉพาะ 4 ตำบล ซึ่งที่อยู่ในเขตสีม่วงทั้งหมด . ?? ขณะที่โครงการนิคมฯ จะนะ เป็นโครงการที่เต็มไปด้วยข้อสงสัยว่า มีการใช้ตำแหน่งรัฐมนตรีและอำนาจรัฐผลักดันโครงการเพื่อเอื้อประโยชน์ให้กลุ่มทุนและเครือญาติตลอดกระบวนการ ตั้งแต่การเปลี่ยนสีผังเมือง เจรจาซื้อขายที่ดิน ไปจนถึงการออกโฉนดที่ดิน แต่การรับฟังเสียงจากประชาชนกลับถูกกีดกันอย่างเต็มที่ เช่น เวทีรับฟังความคิดเห็นวันที่ 11 กรกฎาคม 2563 มีการใช้กำลังตำรวจกว่า 1,000 นาย และรั้วลวดหนามปิดกั้นกลุ่มคัดค้านไม่ให้เข้าร่วมเวที โดยกันให้อยู่ห่างออกไปกว่า 3 กิโลเมตร ระหว่างนั้นมีการส่งทหาร ตำรวจไปคุกคาม ขมขู่ กดดัน ให้ร้ายประชาชนไม่ให้ออกมาเคลื่อนไหว นักปราชญ์และครูสอนศาสนาถูกใส่ร้ายป้ายสีจาก กอ.รมน. ว่าเป็นผู้ก่อการร้าย แบ่งแยกดินแดน เหล่านี้ล้วนเป็นการสุมไฟแห่งความขัดแย้งในพื้นที่ โครงการบนพื้นที่ 17,000 ไร่ของจะนะนี้ จึงเป็นโครงการที่ ‘นายทุนคิด ทหารดัน นักการเมืองหาประโยชน์’ อย่างแท้จริง . อ่านรายละเอียดเพิ่มเติมได้ที่ https://www.moveforwardparty.org/article/9728/ . #ก้าวไกล #saveจะนะ #savechana",
    "postengagement": 26461,
    "postreaction": 15246,
    "postcomment": 441,
    "postshare": 10774,
    "posturl": "https://www.facebook.com/100106918288004/posts/450799233218769/"
  },
  {
    "party": "อนาคตใหม่/ก้าวไกล",
    "partymentioned": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2022-05-26",
    "postmessage": "[ เปิดศักราชใหม่กรุงเทพ! #เพื่อไทย - #ก้าวไกล จับมือยกระดับสภา กทม. สร้างความโปร่งใส พร้อมผลักดันนโยบายตามที่ให้คำมั่นกับประชาชน ] . วันที่ 27 พฤษภาคม 2565 ที่โรงแรมแลงคาสเตอร์ กรุงเทพฯ พรรคเพื่อไทยร่วมกับพรรคก้าวไกล แถลงข่าวความร่วมมือกันระหว่างทั้ง 2 พรรค ในการทำงานร่วมกันของสมาชิกสภากรุงเทพมหานครฯ (ส.ก.) ในสภากรุงเทพมหานคร . พรรคเพื่อไทย นำโดย ประเสริฐ จันทรรวงทอง เลขาธิการพรรค พวงเพ็ชร ชุนละเอียด ผู้อำนวยการการเลือกตั้ง ส.ก. วิชาญ มีนชัยนันท์ ประธานภาค กทม. วราวุธ ยันต์เจริญ รองผู้อำนวยการการเลือกตั้ง ส.ก. พร้อมด้วย ทีม ส.ก. พรรคเพื่อไทย ทั้ง 20 คน . ด้านพรรคก้าวไกล นำโดย ชัยธวัช ตุลาธน เลขาธิการพรรคก้าวไกล วิโรจน์ ลักษขณาอดิศร และทีม ส.ก.พรรคก้าวไกล ทั้ง 14 คน . จากการหารือของ ส.ก. ทั้งสองพรรค มีข้อตกลงในการทำงานร่วมกัน คือ . ?? 1. ส.ก. จากพรรคเพื่อไทยและพรรคก้าวไกล จะร่วมกันทำงานเพื่อยกระดับประสิทธิภาพ และความโปร่งใส ของสภากรุงเทพฯ ทั้งนี้เพื่อให้เกิดประโยชน์สูงสุดต่อพี่น้องประชาชนชาวกรุงเทพฯ . ?? 2. หลังจากที่คณะกรรมการการเลือกตั้งได้ให้การรับรองผลการเลือกตั้ง ในการร่วมกันทำงานตามข้อหนึ่ง ส.ก. ทั้งสองพรรค จะร่วมกันเห็นชอบในการลงมติเพื่อเลือกประธานสภาฯ และรองประธานสภาฯ เพื่อให้การทำงานมีเอกภาพ โดยการแบ่งหน้าที่ต่างๆ ต้องเป็นไปอย่างความเหมาะสม โดยคำนึงถึง ส.ก. ทุกคนในการทำงานเพื่อควบคุม ตรวจสอบ และ ดูแลการบริหารราชการ กทม. ของฝ่ายบริหาร ที่มีผู้ว่าราชการกรุงเทพมหานครเป็นผู้บริหาร . ?? 3. ส.ก. จากทั้งสองพรรค จะร่วมกันเห็นชอบให้มีการแก้ไขข้อบังคับการประชุมสภาฯ เพื่อให้มีการตั้ง คณะกรรมการป้องกันและปราบปรามการทุจริตประพฤติมิชอบ และส่งเสริมการมีส่วนร่วมของประชาชน เพื่อทำให้การบริหารของ กทม.เป็นไปด้วยความสุจริต โปร่งใส ตอบสนองประโยชน์ของชาว กทม.อย่างแท้จริง . ?? 4. ส.ก. จากทั้งสองพรรค จะร่วมกันเห็นชอบให้มีการถ่ายทอดสดการประชุมสภา กทม. ทั้งนี้เพื่อสร้างการมีส่วนร่วมของประชาชน เพื่อความโปร่งใสในการทำงาน ทั้งนี้เพื่อให้ภาคประชาชน สามารถตรวจสอบการทำงานของสมาชิกสภาฯได้ . ด้านวิโรจน์ ลักขณาอดิศร ระบุว่าในส่วนของนโยบายที่หาเสียงกับประชาชนไว้โดยทั้งสองพรรค จะมีการผลักดันร่วมกันผ่านสภา กทม. โดยในส่วนของนโยบายที่พรรคก้าวไกลหาเสียงไว้ ไม่ว่าจะเป็นการแก้ข้อบัญญัติ และการทบทวนงบประมาณที่สำคัญต่างๆ ให้สามารถเป็นประโยชน์ต่อประชาชนได้มากที่สุด อย่างเช่น การแก้ข้อบัญญัติให้มีคณะกรรมการ ป.ป.ช. ในสภา กทม. การถ่ายทอดสดการประชุมสภา กทม. . ซึ่งล้วนเป็นสิ่งที่พรรคก้าวไกลเสนอไว้ในการหาเสียงเลือกตั้ง ซึ่งทั้ง ส.ก. พรรคเพื่อไทย และผู้ว่าฯ ชัชชาติได้ตอบรับเห็นด้วยแล้ว จนนำมาสู่การเป็นข้อตกลงทำงานร่วมกันในวันนี้ ส่วนนโยบายที่จะผลักดันในด้านอื่นๆ จะมีการหารือเพื่อผลักดันร่วมกันต่อไปในอนาคต . “ไม่ว่าจะเป็นการแก้ข้อบัญญัติที่เอื้อประโยชน์ให้นายทุนหลบเลี่ยงภาษีที่ดิน, การกระจายงบประมาณให้ประชาชนมีส่วนร่วม, การทบทวนตัดหรือลดงบผูกพัน 2.7 หมื่นล้านบาท เพื่อนำมาทำประโยชน์ให้กับประชาชนมากขึ้น, งบการระบายน้ำที่ถูกตัดทิ้งในปีก่อนหน้านี้, การจัดเก็บค่าขยะที่ไม่เป็นธรรม ฯลฯ ทั้งหมดนี้ พรรคก้าวไกลพร้อมผลักดันทุกนโยบายของเราผ่านการหารือกันกับทั้ง ส.ก. จากพรรคเพื่อไทยและพรรคอื่นๆ รวมทั้งผู้ว่าฯ ชัชชาติ ต่อไปในอนาคต” วิโรจน์กล่าว . #เลือกตั้งผู้ว่า #เลือกตั้ง",
    "postengagement": 23393,
    "postreaction": 21860,
    "postcomment": 663,
    "postshare": 870,
    "posturl": "https://www.facebook.com/489566279399396/posts/566741698348520"
  },
  {
    "party": "อนาคตใหม่/ก้าวไกล",
    "partymentioned": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2019-07-16",
    "postmessage": "ขอเรียนเชิญทุกท่านร่วมติดตาม! . [ ทางออกในการแก้ไขปัญหาวิกฤติของชาติ โดย 7 พรรคฝ่ายค้านเพื่อประชาชน ] . พบกับ... ธนาธร จึงรุ่งเรืองกิจ : หัวหน้าพรรคอนาคตใหม่ สมพงษ์ อมรวิวัฒน์ : หัวหน้าพรรคเพื่อไทย เสรีพิศุทธ์ เตมียเวส : หัวหน้าพรรคเสรีรวมไทย วันมูหะมัดนอร์ มะทา : หัวหน้าพรรคประชาชาติ สุภดิช อากาศฤกษ์ : หัวหน้าพรรคเศรษฐกิจใหม่ สงคราม กิจเลิศไพโรจน์ : หัวหน้าพรรคเพื่อชาติ และ นิคม บุญวิเศษ : หัวหน้าพรรคพลังปวงชนไทย . พบกันวันอาทิตย์ที่ 21 กรกฎาคม 2562 เวลา 10.00-12.30 น. ที่โรงแรมแลงคาสเตอร์ ถนนเพชรบุรีตัดใหม่ กรุงเทพฯ ตรงข้ามสำนักงานใหญ่พรรคอนาคตใหม่ . (แผนที่ https://goo.gl/maps/2EuytMD1E6Bes1eTA )",
    "postengagement": 7042,
    "postreaction": 6471,
    "postcomment": 182,
    "postshare": 389,
    "posturl": "https://www.facebook.com/1620426454699609/posts/2338438002898447"
  },
  {
    "party": "เสรีรวมไทย",
    "partymentioned": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2019-06-04",
    "postmessage": "[คลิปเต็ม] \"เสรีพิศุทธ์ \"อภิปรายเดือด!!! กลางที่ประชุมเลือกนายก 62 . พล.ต.อ.เสรีพิศุทธ์ เตมียเวส ส.ส.บัญชีรายชื่อ หัวหน้าพรรคเสรีรวมไทย กล่าวอภิปรายอย่างดุเดือดหลายประเด็น ในการประชุมสภา เพื่อเลือกนายกรัฐมนตรี โดยเนื้อหาชี้แจงให้เห็นว่า พล.อ.ประยุทธ์ ไม่มีคุณสมบัติในการเป็นนายกรัฐมนตรี . #เสรีพิศุทธ์ #พรรคเสรีรวมไทย #ตั้งรัฐบาล #เลือกนายก #ประชุมสภา #ประชาธิปไตย",
    "postengagement": 45746,
    "postreaction": 33014,
    "postcomment": 1633,
    "postshare": 11099,
    "posturl": "https://www.facebook.com/watch/?v=612811032530527"
  },
  {
    "party": "เสรีรวมไทย",
    "partymentioned": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2022-04-06",
    "postmessage": "เสรีพิศุทธ์ พร้อมตรวจสอบ \"รัฐมนตรี คมนาคม-มหาดไทย\" กรณีละเว้นปฏิบัติหน้าที่โดยมิชอบและโดยทุจริต . 7 เมษายน 2565 ณ รัฐสภา พล.ต.อ.เสรีพิศุทธ์ เตมียเวส หัวหน้าพรรคเสรีรวมไทย ในฐานะ ประธานคณะกรรมาธิการการป้องกันและปราบปรามการทุจริตประพฤติมิชอบ สภาผู้แทนราษฎร (กมธ.ป.ป.ช.) รับหนังสือร้องเรียนจาก จากนายสกลชัย ลิมป์สีสวรรค์ ขอให้สอบข้อเท็จจริงและดำเนินคดีกับ นายศักดิ์สยาม ชิดชอบ รัฐมนตรีว่าการกระทรวงคมนาคม และพลเอกอนุพงษ์ เผ่าจินดา รัฐมนตรีว่าการกระทรวงมหาดไทย ในข้อหาปฏิบัติหรือละเว้นปฏิบัติหน้าที่โดยมิชอบและโดยทุจริต ในประเด็นใหม่ที่ยังไม่มีการยื่นกับหน่วยงานใดมาก่อน เกี่ยวกับตัวรัฐมนตรีและเครือญาติ/ประกอบกับมีความผิดฐานฝ่าฝืนจริยธรรมนักการเมืองอย่างร้ายแรง . #เสรีพิศุทธ์ #เสรีรวมไทย #พรรคเสรีรวมไทย #กมธปปช #รัฐมนตรี #คมนาคม #มหาดไทย #ศักดิ์สยาม",
    "postengagement": 146,
    "postreaction": 131,
    "postcomment": 8,
    "postshare": 7,
    "posturl": "https://www.facebook.com/watch/?v=1009621999932921"
  },
  {
    "party": "เสรีรวมไทย",
    "partymentioned": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2020-01-28",
    "postmessage": "นายแพทย์ เรวัต วิศรุตเวช ส.ส.บัญชีรายชื่อ พรรคเสรีรวมไทยขึ้น อภิปรายในช่วงกระทู้ถามสด โดยตั้งคำถามไปยัง นายสาธิต ปิตุเตชะ รัฐมนตรีช่วยว่าการกระทรวงสาธารณสุข ในเรื่องของการแพร่กระจายของ ไวรัสโคโรน่า ที่เกิดขึ้นในเมืองอู่ฮั่น ประเทศจีน จึงขอสอบถามรัฐบาลมีมาตรการอย่างไรในการแก้ไขและป้องกันสถานการไวรัสโคโรน่า ที่กำลังเกิดขึ้นในประเทศไทย ในการการประชุมสภาผู้แทนราษฎร ครั้งที่ 22 วันที่ 29 มกราคม 2563 ณ รัฐสภา #ไวรัสโคโรน่า #เสรีรวมไทย",
    "postengagement": 718,
    "postreaction": 690,
    "postcomment": 10,
    "postshare": 18,
    "posturl": "https://www.facebook.com/watch/?v=534143520781926"
  },
  {
    "party": "เสรีรวมไทย",
    "partymentioned": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2019-11-19",
    "postmessage": "20 พ.ย.2562 อาคารรัฐสภา พล.ต.อ เสรีพิศุทธ์ เตมียเวส หัวหน้า พรรคเสรีรวมไทย ในฐานะประธานคณะกรรมาธิการ ป้องกันและปราบปรามการทุจริตและประพฤติมิชอบ ชี้มีอำนาจแต่งตั้ง ที่ปรึกษาคนเดียวย้ำแต่งตั้งข้าราชการล่วงหน้า เป็นเรื่องปกติ ย้ำปลดประธานไม่ได้ เป็นโควตาฝ่ายค้าน ใครคิดปลดเป็นโจร ผู้สื่อข่าวสอบถามว่า ต่อกรณีที่มีข่าวการแต่งตั้งที่ปรึกษาประธานกรรมาธิการที่มีมาก่อน เมื่อวันที่ 18 พ.ย.ที่ผ่านมา พล.ต.อ.เสรีพิศุทธ์ ให้ความเห็นว่า “คนส่วนใหญ่ทำงานมาน้อย บริหารงานมาน้อย จึงไม่เข้าใจความจริงการตั้งที่ปรึกษาประธานกรรมาธิการเป็นอำนาจของผมคนเดียว ผมไม่จำเป็นต้องขอมติที่ประชุม แต่ผมให้เกียรติที่ประชุมคณะกรรมาธิการทุก คณะมี15 ตัดผมเหลือ14 ให้กรรมาธิการแต่ละท่านเสนอที่ปรึกษาให้เลขาเสนอขึ้นมา อย่างเช่นในกรณีของ พ.ลต.ท.วิโรจน์ เปาอินทร์คุณวัฒนา เมืองสุข สองท่านมาจากพรรคเพื่อไทย รายชื่อที่ท่านเห็นเป็นของผม 2 คน คือ คุณบุญเชิด คิดเห็น อดีอธิบดีกรมที่ดิน คุณพิศิษฐ์ ลีลาวชิโรภาส อดีตผู้ว่าสำนักงานตรวจงานแผ่นดิน ผมตั้งผู้ทรงคุณวุฒิเข้ามาทำงาน ขณะนี้ มีงานเรื่องทุจริตที่ดิน จึงเอาอดีตอธิบดี กรมที่ดินมาเป็นที่ปรึกษาเรื่องการจัดซื้อจัดจ้างก็มีวาระที่ต้องเชิญ อธิบดีกรมประชาสัมพันธ์ มาชี้แจง เรื่องทุจริต เรื่องการก่อสร้าง จึงเชิญ คุณพิศิษฐ์มาปรึกษา” “การทำงานของคนเราแตกต่างกัน เพราะนั้น ที่ปรึกษาที่ผมเชิญวันนี้ ผมต้องการให้ทำงานวันนี้ทันที ไม่ใช่ให้ต้องการให้ไปทำงานอาทิตย์หน้า คำสั่งแต่งตั้งข้าราชการก็ต้องทำล่วงหน้า แม้แต่การเดินทางไปทำเรื่อง ธรรมนัส ผมเห็นว่า เป็นเรื่องของสภา ผมจึงเสนอขอออกค่าใช้จ่ายเอง ต่อกรณีที่ นายสิระ เจนจาคะ ส.ส.พรรคพลังประชารัฐ จะฟ้องหมิ่นประมาท และจะปลดจากตำแหน่ง ประธานประธาน กมธ.ป.ป.ช. ตอบ กลับว่า เรื่องของสิระพรรคพลัง พรรคประชารัฐ ส่งเข้ามาเป็นกรรรมาธิการยังไม่ทันเข้าจะปลดผมแล้ว ก่อนที่จะเข้ามาจะปลดผม อะไรมากมาย เรื่องมันมีที่มาที่ไป เรื่องหมิ่นประมาท ผมเรียนตรง ผมกระทำโดยสุจริต และไม่ผิดกฎหมายเขาอยากจะว่า อะไรก็ว่าไป ไม่ต้องกังวลแทนผม ผมก็ทำการติชม โดยสุจริต “ผมเรียนว่า กรรมาธิการ มี 35 คณะแต่งตั้งโดยสภาพรรคเพื่อไทย มีส.ส.มากที่สุด จึงได้ประธานกรรมาธิการ 10 พรรคพลังประชารัฐ ได้ประธานไป 8 คณะ อนาคตใหม่ได้ประธาน 6 คณะ ภูมิใจไทย ประชาธิปัตย์ ได้ไป 4 คณะ เสรีรวมไทยกับชาติไทยพัฒนาได้ไปพรรคละ1 คณะ ส่วนพรรคเสรีรวมไทยเป็นโควตาของผม จะให้ใครไม่ได้ ใครจะเสนอปลดผม ปลดไม่ได้ เพราะเป็น โควตาของผม ใครจะมาเอา คือการปล้น",
    "postengagement": 7399,
    "postreaction": 6475,
    "postcomment": 373,
    "postshare": 551,
    "posturl": "https://www.facebook.com/watch/?v=562935181190571"
  },
  {
    "party": "เสรีรวมไทย",
    "partymentioned": "อนาคตใหม่/ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2019-12-17",
    "postmessage": "นายแพทย์เรวัต วิศรุตเวช ส.ส.บัญชีรายชื่อพรรคเสรีรวมไทย เห็นด้วยให้มีการตั้งคณะกรรมาธิการวิสามัญพิจารณาศึกษาหลักเกณฑ์ และวิธีการแก้ไขเพิ่มเติมรัฐธรรมนูญแห่งราชอาณาจักรไทย พ.ศ.2560 ที่เสนอโดย นาย สุทิน คลังแสง และ นายปิยบุตร แสงกนกกุล ในการประชุมสภาผู้แทนราษฎร โดยให้เหตุผลที่มาของสมาชิกวุฒิสภา และที่มาของการเลือกนายกรัฐมนตรี ล้วนเป็นมรดกจากมรดกของเผด็จการ ที่เขียนรัฐธรรมนูญเอื้อประโยชน์ซึ่งกันและกัน ในการประชุมสภาผู้แทนราษฎรวันที่ 18 ธันวาคม 2562 ณ รัฐสภา",
    "postengagement": 959,
    "postreaction": 905,
    "postcomment": 16,
    "postshare": 38,
    "posturl": "https://www.facebook.com/watch/?v=2491388497636900"
  }
]

import React, { useState, useEffect, useRef } from 'react'
import moment from 'moment'
import 'moment/locale/th'
import ScrollableArrow from '../../../utils/scrollable-arrow'


type Props = {}

const CompetitorPostCollection = ({ party }: {
  party: string
}) => {
  const [postItem, setPostItem] = useState<typeof COMPETITOR_COMMUNICATION_POST>([])
  useEffect(() => {
    setPostItem(COMPETITOR_COMMUNICATION_POST.filter((data) => data.party === party))
  }, [party])

  const getLogo = (party: string) => {
    switch (party) {
      case "พลังประชารัฐ": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/พลังประชารัฐ.png")] bg-contain bg-center' />
      case "ภูมิใจไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ภูมิใจไทย.png")] bg-contain bg-center' />
      case "ประชาธิปัตย์": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ประชาธิปัตย์.png")] bg-contain bg-center' />
      case "เพื่อไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/เพื่อไทย.png")] bg-contain bg-center' />
      case "อนาคตใหม่/ก้าวไกล": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ก้าวไกล.png")] bg-contain bg-center' />
      case "เสรีรวมไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/เสรีรวมไทย.png")] bg-contain bg-center' />
      default:
        break;
    }
  }

  const getPostChanelLogo = (postchannel: string) => {
    switch (postchannel) {
      case "facebook": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path fillRule="evenodd" clipRule="evenodd" d="M7.46972 15C11.5954 15 14.9394 11.6424 14.9394 7.5C14.9394 3.35756 11.5954 0 7.46972 0C3.344 0 0 3.35756 0 7.5C0 11.6424 3.344 15 7.46972 15ZM6.3006 9.23724C6.30084 9.41264 6.30109 9.58805 6.30109 9.76345V11.8485C6.30109 11.9754 6.32478 12.0269 6.46691 12.023C6.97621 12.015 7.48946 12.015 7.99875 12.023C8.14089 12.0269 8.17642 11.9913 8.17642 11.8446C8.1705 10.8131 8.17124 9.78377 8.17198 8.75336C8.17222 8.40973 8.17247 8.06597 8.17247 7.72196C8.17247 7.61428 8.16765 7.56751 8.18847 7.54776C8.2098 7.52753 8.25803 7.53565 8.36592 7.53565C8.66203 7.53169 8.96208 7.53169 9.25818 7.53565C9.34504 7.53565 9.39242 7.51583 9.40032 7.41673C9.4398 6.97275 9.47928 6.53274 9.52665 6.09273C9.5385 5.97778 9.50296 5.95399 9.39242 5.95399C9.11099 5.95994 8.82735 5.95919 8.54481 5.95845C8.4508 5.9582 8.35692 5.95795 8.26328 5.95795C8.25902 5.95795 8.25477 5.958 8.25054 5.95804C8.19587 5.95856 8.14512 5.95905 8.14878 5.87075C8.15207 5.76007 8.15193 5.64939 8.1518 5.539C8.15161 5.38449 8.15141 5.23054 8.16063 5.07793C8.18037 4.74892 8.37777 4.57846 8.7094 4.57846C8.95418 4.5745 9.20291 4.5745 9.45164 4.57846C9.5306 4.57846 9.55429 4.55468 9.55429 4.4754C9.55034 4.03539 9.55034 3.59141 9.55429 3.14744C9.55429 3.07608 9.5306 3.0523 9.45954 3.0523C9.30038 3.05352 9.14122 3.05324 8.98218 3.05296C8.6244 3.05232 8.2672 3.05169 7.9119 3.06816C7.4105 3.09194 6.97621 3.28221 6.67221 3.7024C6.43138 4.03142 6.32083 4.41197 6.31293 4.82027C6.30504 5.15325 6.30504 5.48623 6.31293 5.81921C6.31293 5.93813 6.28925 5.9857 6.15896 5.97778C6.02626 5.97064 5.89214 5.97207 5.7583 5.9735C5.66915 5.97445 5.58013 5.9754 5.49174 5.97381C5.40488 5.97381 5.38119 6.00156 5.38119 6.0848C5.38514 6.52085 5.38514 6.96086 5.38119 7.39691C5.37725 7.48808 5.41278 7.51583 5.49964 7.51187C5.59448 7.51017 5.68861 7.51065 5.78231 7.51114C5.90704 7.51179 6.03102 7.51243 6.15501 7.5079C6.27345 7.50394 6.30504 7.53961 6.30504 7.65854C6.29912 8.18477 6.29986 8.711 6.3006 9.23724Z" fill="#2094FF" />
      </svg>
      case "twitter": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path d="M12.7976 2.20238C11.4286 0.833336 9.58333 0 7.5 0C5.41666 0 3.57143 0.833336 2.20238 2.20238C0.833332 3.57143 0 5.41667 0 7.5C0 11.369 2.97619 14.5833 6.78571 14.9405C7.02381 14.9405 7.2619 15 7.5 15C8.03571 15 8.5119 14.9405 8.98809 14.8214C10.4762 14.5238 11.7857 13.8095 12.7976 12.7976C14.1667 11.4286 15 9.58333 15 7.5C15 5.41667 14.1667 3.57143 12.7976 2.20238ZM12.7976 4.46428C12.6786 4.64285 12.5 4.82143 12.381 5C12.2024 5.17857 12.0238 5.29762 11.8452 5.47619L11.7857 5.53571C11.7857 5.71428 11.7857 5.83333 11.7857 6.0119C11.7857 6.13095 11.7857 6.25 11.7857 6.36905C11.7857 6.54762 11.7262 6.66666 11.7262 6.84523C11.6667 7.14285 11.6071 7.44048 11.4881 7.67857C11.4286 7.85714 11.369 8.03571 11.25 8.21428C11.1309 8.39286 11.0714 8.63095 10.9524 8.80952C10.8333 9.04762 10.6548 9.22619 10.5357 9.46429C10.4167 9.64286 10.2976 9.76191 10.119 9.94048C9.94048 10.1191 9.7619 10.2976 9.58333 10.4167C9.46428 10.4762 9.40476 10.5952 9.28571 10.6548C9.04761 10.8333 8.80952 10.9524 8.57143 11.0714C8.39285 11.131 8.21429 11.25 8.03572 11.3095C7.79762 11.4286 7.5 11.4881 7.20238 11.5476C7.0238 11.6071 6.84524 11.6071 6.66667 11.6071C6.54762 11.6071 6.42857 11.6071 6.25 11.6071C6.13095 11.6071 6.0119 11.6071 5.89285 11.6071C5.83333 11.6071 5.83333 11.6071 5.77381 11.6071C5.65476 11.6071 5.53571 11.6071 5.41666 11.5476C5.23809 11.5476 5 11.4881 4.82142 11.4286C4.58333 11.3691 4.40476 11.3095 4.16667 11.25C3.92857 11.1905 3.75 11.0714 3.57143 11.0119C3.39286 10.8929 3.21428 10.8333 3.03571 10.7143C3.03571 10.7143 3.03571 10.7143 3.09524 10.7143C3.15476 10.7143 3.15476 10.7143 3.21428 10.7143C3.27381 10.7143 3.39286 10.7143 3.45238 10.7143C3.51191 10.7143 3.57142 10.7143 3.63095 10.7143C3.69047 10.7143 3.75 10.7143 3.80952 10.7143C3.92857 10.7143 4.04762 10.7143 4.10714 10.6548C4.46428 10.5952 4.76191 10.5357 5.05952 10.3571C5.29762 10.2381 5.53571 10.1191 5.77381 9.94048C5.83333 9.88096 5.89286 9.88095 5.95238 9.82142C5.71429 9.82142 5.53571 9.7619 5.35714 9.70238C5.17857 9.64286 5 9.52381 4.82142 9.40476C4.64285 9.28571 4.52381 9.10714 4.40476 8.9881C4.28571 8.80952 4.10714 8.51191 4.10714 8.45238C4.28571 8.45238 4.40476 8.5119 4.58333 8.5119C4.7619 8.5119 5 8.45238 5.05952 8.45238C4.88095 8.39286 4.7619 8.33333 4.58333 8.27381C4.40476 8.15476 4.22619 8.03571 4.04762 7.91666C3.86905 7.73809 3.75 7.55953 3.69047 7.38095C3.63095 7.20238 3.57143 7.08333 3.5119 6.90476C3.45238 6.78571 3.45238 6.60714 3.45238 6.4881C3.45238 6.4881 3.45238 6.48809 3.45238 6.42857C3.63095 6.54762 3.86904 6.60715 4.10714 6.66667C4.16666 6.66667 4.28572 6.66667 4.34524 6.66667C4.28572 6.60715 4.22619 6.54762 4.10714 6.4881C3.92857 6.30953 3.74999 6.13095 3.63095 5.89286C3.5119 5.65476 3.45238 5.35714 3.39286 5.05952C3.39286 5 3.39286 4.88095 3.39286 4.82143C3.39286 4.64286 3.45238 4.52381 3.5119 4.34524C3.57143 4.22619 3.63095 4.10715 3.69047 3.9881C3.80952 4.10715 3.86905 4.22619 3.98809 4.28572C4.10714 4.40477 4.22619 4.52381 4.34524 4.64285C4.52381 4.82143 4.70238 4.94047 4.88095 5.05952C5.11905 5.23809 5.41666 5.41666 5.71428 5.53571C5.89285 5.59524 6.07143 5.71429 6.25 5.77381C6.54762 5.89286 6.84524 5.95238 7.14286 6.0119C7.32143 6.0119 7.44048 6.07143 7.61905 6.07143C7.67857 6.07143 7.73809 6.07143 7.85714 6.07143C7.91667 6.07143 7.91667 6.07143 7.91667 6.0119C7.91667 5.89286 7.85714 5.77381 7.85714 5.65476C7.85714 5.53571 7.85714 5.41666 7.85714 5.35714C7.91667 5.11904 7.97619 4.88095 8.09523 4.64285C8.21428 4.46428 8.33334 4.28572 8.51191 4.10714C8.63095 3.9881 8.80952 3.86905 8.98809 3.80953C9.22619 3.69048 9.52381 3.63095 9.82143 3.63095C9.88095 3.63095 9.88095 3.63095 9.94048 3.63095C10.0595 3.63095 10.119 3.63095 10.2381 3.63095C10.5357 3.69048 10.7738 3.80952 11.0119 3.92857C11.131 3.98809 11.25 4.10714 11.3095 4.16666H11.369C11.4286 4.16666 11.4881 4.10714 11.6071 4.10714C11.7857 4.04762 11.9048 3.98809 12.0833 3.92857C12.2619 3.86905 12.4405 3.75 12.619 3.63095C12.5595 3.75 12.5 3.92857 12.4405 4.04762C12.3809 4.16666 12.2619 4.28572 12.2024 4.40476C12.1429 4.46429 12.0238 4.58333 11.9643 4.64285C11.9048 4.70238 11.8452 4.70238 11.7857 4.7619C11.8452 4.7619 11.8452 4.7619 11.9048 4.7619C12.1429 4.70238 12.3214 4.70238 12.5595 4.58334C12.5595 4.52381 12.6786 4.52381 12.7976 4.46428Z" fill="#00D1FF" />
      </svg>
      case "youtube": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path fillRule="evenodd" clipRule="evenodd" d="M15 7.5C15 11.6421 11.6421 15 7.5 15C3.35786 15 0 11.6421 0 7.5C0 3.35786 3.35786 0 7.5 0C11.6421 0 15 3.35786 15 7.5ZM10.9323 4.62466C11.4036 4.67734 11.7951 5.03046 11.9053 5.5091C12.0608 6.18517 12.0608 6.92266 12.0608 7.6194V7.63658C12.0608 8.33828 12.0602 9.08225 11.9033 9.76388C11.7931 10.2425 11.4015 10.5956 10.9305 10.6483C9.81467 10.773 8.68525 10.7736 7.56047 10.773C6.43587 10.7736 5.30617 10.773 4.19022 10.6483C3.71892 10.5955 3.32761 10.2424 3.21761 9.76388C3.06079 9.08234 3.06079 8.33837 3.06079 7.63658C3.06079 6.93479 3.06256 6.19073 3.21938 5.5091C3.32956 5.03046 3.72078 4.67734 4.19179 4.62466C5.30784 4.50008 6.43764 4.49943 7.56223 4.50008C8.68664 4.49943 9.81625 4.50008 10.9323 4.62466ZM6.39936 6.05713V9.03347C6.80142 8.82499 7.202 8.6173 7.60239 8.40972C8.15437 8.12354 8.70598 7.83755 9.2606 7.5499L6.39936 6.05713Z" fill="#FF4747" />
      </svg>
      default:
        break;
    }
  }
  const [showArrow, setShowArrow] = useState(true)
  return (
    <div className='relative overflow-hidden desktop:ml-[50px]'>
      <div className='flex flex-row flex-nowrap gap-x-[10px] overflow-x-scroll items-baseline pr-[10px] scrollbar-hide
       desktop:pr-[50px]'
        onScroll={(e: React.UIEvent<HTMLDivElement>) => {
          const target: EventTarget = e.target;
          const targetDiv: HTMLDivElement = target as HTMLDivElement
          setShowArrow(targetDiv.offsetWidth + targetDiv.scrollLeft < targetDiv.scrollWidth)
        }}>
        {postItem.map(({ party,
          partymentioned,
          postchannel,
          postdate,
          postmessage,
          postengagement,
          postreaction,
          postcomment,
          postshare,
          posturl }) => (
          <div key={`${party}-${partymentioned}`}
            className='w-[260px] flex-none'>
            <div className='wv-font-anuphan wv-b6 text-white !mb-[5px] text-left'>
              {`พูดถึง${partymentioned}`}
            </div>
            <a className='w-full bg-white rounded-[5px] h-fit block  p-[15px] '
              href={posturl} target="_blank" rel='noreferrer'>
              <div className='flex flex-row justify-between'>
                <div className='flex flex-row items-center'>
                  <div>{getLogo(party)}</div>
                  <div className='-ml-[5px]'>{getPostChanelLogo(postchannel)}</div>
                </div>
                <div className='wv-font-anuphan 
             wv-b7 text-black opacity-60'>
                  {moment(postdate, "YYYY-MM-DD").locale('th').format('ll')}
                </div>
              </div>
              <div className='wv-font-anuphan text-left break-words 
             wv-b5 text-black opacity-60 overflow-scroll max-h-[210px]
             border-b-[1px] border-gray mt-[5px] pb-[10px]'>
                {postmessage}
              </div>
              <div className=' mt-[5px]'>
                <div className='flex items-start text-black gap-x-[5px]'>
                  <div className='wv-font-anuphan wv-font-bold wv-b6'>{postengagement}</div>
                  <div className='wv-font-anuphan wv-b6'>Engagement</div>
                </div>
                <div className='wv-font-anuphan wv-b7 text-black opacity-70 text-left'>
                  {`${postreaction} reactions + ${postcomment} comments + ${postshare} shares`}
                </div>
              </div>
            </a>
          </div >
        ))}
      </div >
      <ScrollableArrow show={showArrow} />
    </div>
  )
}

export default CompetitorPostCollection