

const TOPIC_COMMUNICATION_POST = [
  {
    "topic": "โควิด",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-04-08",
    "postmessage": "ขอเถอะนะ ! อย่าโพสต์สร้างความแตกแยก ซ้ำเติมสถานการณ์โควิด-19 ให้เลวร้ายลงไปอีกเลย เพราะรัฐบาลอยากให้เงินก้อนนี้ตกไปถึงมือคนที่เขาเดือดร้อนจริง ๆ การกระทำในลักษณะนี้หากจะว่าไป ก็มีความผิดตามกฎหมาย อยู่ 2 กรณี คือ … 1.ใครก็ตามที่ไม่ได้รับเงินชดเชย 5,000 บาทจริง แต่แกล้งโพสต์ว่าได้รับ เพื่อจุดประสงค์สร้างความแตกแยก กระทรวงการคลัง จะส่งข้อมูลให้ศูนย์เฟกนิวส์ฟ้องดำเนินคดี ฐานนำเข้าข้อมูลเท็จ โทษมีทั้งจำคุก และปรับเงิน 2.ส่วนคนได้รับเงินจริง แต่โพสต์อวดในทำนองได้มาแบบฟลุ๊ค ๆ ลงไปงั้นๆ ชีวิตไม่เดือดร้อน ก็จะต้องถูกตรวจสอบย้อนหลังตามความยินยอมที่ระบุไว้ระหว่างการลงทะเบียน และหากพบว่ากรอกข้อมูลเท็จ ก็จะมีความผิดตามพ.ร.บ.คอมพิวเตอร์ ฐานนำเข้าข้อมูลอันเป็นเท็จ มีโทษทั้งจำคุกและปรับเช่นกัน และต้องส่งเงินคืนให้คลังภายใน 90 วัน ทั้งนี้ทั้งนั้น รัฐบาลก็ไม่ต้องการที่จะเอาผิดกับใครในสภาวะแบบนี้ เพราะเข้าใจถึงปัญหาความเดือดร้อนของประชาชนเป็นอย่างดี ดังนั้น เพียงแต่ขอร้องว่าอย่าทำแบบนี้ ... อย่าซ้ำเติมกันเอง อย่าซ้ำเติมสถานการณ์ให้เลวร้ายลงไป เพราะขณะนี้เป็นเวลาที่เราทุกคนต้องร่วมมือร่วมใจกัน ฟันฝ่าปัญหาระดับโลกนี้ไปให้ได้ !! #เราไม่ทิ้งกัน #เงินชดเชยโควิด-19 #ประเทศไทยต้องชนะ",
    "postengagement": 12453,
    "postreaction": 5789,
    "postcomment": 3527,
    "postshare": 3137,
    "posturl": "https://www.facebook.com/493026767870664/posts/854957445010926"
  },
  {
    "topic": "โควิด",
    "party": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2020-12-22",
    "postmessage": "ฉันติดหรือยัง? สำรวจความเสี่ยงโควิด-19 ด้วยตนเอง #สาธารณสุข #โควิด19 #การ์ดอย่าตก #คนภูมิใจไทย",
    "postengagement": 25400,
    "postreaction": 23141,
    "postcomment": 303,
    "postshare": 1956,
    "posturl": "https://www.facebook.com/182657125936067/posts/774777623390678"
  },
  {
    "topic": "โควิด",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2020-05-15",
    "postmessage": "ผลโพล ปชช. ถูกใจเงินเยียวยาจาก ก.เกษตรฯ . ผลสำรวจภาคสนาม เรื่อง ความสุขเกษตรกร กรณีการแจกเงินเยียวยาของกระทรวงเกษตรช่วงเกิดการแพร่ระบาดของไวรัสโควิด-19 กรณีศึกษาเกษตรกรทั่วประเทศ จำนวน 1,124 ตัวอย่าง ดำเนินโครงการระหว่างวันที่ 11-15 พ.ค.ที่ผ่านมา . พบเกษตรกรส่วนใหญ่ร้อยละ 95.5 ถูกใจมาตรการแจกเงินเยียวยาของกระทรวงเกษตรและสหกรณ์ช่วงโควิด-19 . นอกจากนี้เกษตรกรส่วนใหญ่ร้อยละ 94.1 ยังระบุว่า กระทรวงเกษตรและสหกรณ์ ยังคงเป็นที่พึ่งของเกษตรกร เมื่อสอบถามถึงการรับรู้ต่อพรรคประชาธิปัตย์ ที่ช่วยผลักดันให้เกิดการแจกเงินเยียวยาเกษตรกรช่วงโควิด-19 พบเกษตรกรส่วนใหญ่ร้อยละ 91.1 รับรู้ อ่านเพิ่มเติมที่ https://www.democrat.or.th/newsDetail/1764 #DemocratPartyTH #พรรคประชาธิปัตย์",
    "postengagement": 10418,
    "postreaction": 10000,
    "postcomment": 305,
    "postshare": 113,
    "posturl": "https://www.facebook.com/296508406790/posts/10156947361396791"
  },
  {
    "topic": "โควิด",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2021-07-06",
    "postmessage": "วิกฤตโควิด-19 ประเทศไทยกำลังดิ่งเหว ต้องหาทางออก ก่อนถึงทางตัน . ‘นพ.ชลน่าน ศรีแก้ว’ ส.ส.น่าน พรรคเพื่อไทย ชี้สัญญาณประเทศไทยกำลังจะตกเหว จากการที่ ศบค. ไม่สามารถควบคุมการระบาดของโควิด-19 ได้ โดยเฉพาะสัญญาณในทางการแพทย์ ที่จำนวนผู้ติดเชื้อและผู้เสียชีวิตเพิ่มขึ้นสูงมาก จนน่ากังวลว่าระบบสาธารณสุขของไทยอาจล่มสลาย จำนวนผู้ป่วยที่เพิ่มมากขึ้นจนเกินศักยภาพของระบบบริการทางการแพทย์ โดยเฉพาะในพื้นที่ระบาดคุมเข้มสูงสุด เหล่านี้คือสัญญาณอันตราย ! ขณะที่ รัฐบาล และ ศบค. ยังไม่สามารถจัดหาวัคซีนที่มีประสิทธิภาพในการป้องกันการติดเชื้อมาฉีดให้ประชาชนได้ ฟังกันชัดๆ จาก ‘นพ.ชลน่าน ศรีแก้ว’ อีกครั้ง ว่าเพราะเหตุใด จึงถึงเวลาแล้วที่ประชาชนคนไทยจะต้องพิจารณาใช้มาตรการทางกฎหมาย เอาผิดรัฐบาลที่ไร้ประสิทธิภาพ บริหารประเทศล้มเหลว ผิดพลาด จนพี่น้องประชาชนต้องยากลำบาก ต้องเผชิญกับทั้งวิกฤตสุขภาพและวิกฤตเศรษฐกิจ",
    "postengagement": 274650,
    "postreaction": 211586,
    "postcomment": 5454,
    "postshare": 57610,
    "posturl": "https://www.facebook.com/149079361791677/posts/4487475597952010"
  },
  {
    "topic": "โควิด",
    "party": "ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2021-07-06",
    "postmessage": "ส.ส. เท่าพิภพ ลิ้มจิตรกร - Taopiphop Limjittrakorn ลั่นกลางสภา! อยากให้ประยุทธ์เอามือถือผมไปใช้สักวันหนึ่ง จะได้รู้ว่าประชาชนเดือดร้อนถึงขั้นล้มตายกันไปมากเพียงใดในวิกฤตครั้งนี้!! . #ก้าวไกล #ประชุมสภา #โควิด",
    "postengagement": 171948,
    "postreaction": 147443,
    "postcomment": 1776,
    "postshare": 22729,
    "posturl": "https://www.facebook.com/watch/?v=801663493880409"
  },
  {
    "topic": "โควิด",
    "party": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2021-07-10",
    "postmessage": "แคมเปญ \"มอบ 157 ให้นายกฯ\" “จ่ายซื้อวัคซีน ตรวจโควิด ซื้อหน้ากาก“นำใบเสร็จเข้าแจ้งความดำเนินคดีนายกฯ ตาม ม.157 ด้วยตนเอง ที่สถานีตำรวจใกล้บ้าน เหตุทำให้ประขาชนถูกละเมิดสิทธิ ในการได้รับการป้องกันและขจัดโรคติดต่ออันตรายจากรัฐ โดยไม่เสียค่าใช้จ่าย \"ประชาชนต้องชนะ\" #ต่างกรรมต่างวาระ #ให้นายกไทยมีคดีมากที่สุดในโลก",
    "postengagement": 21943,
    "postreaction": 20876,
    "postcomment": 342,
    "postshare": 725,
    "posturl": "https://www.facebook.com/161052211196800/posts/856910234944324"
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2019-12-23",
    "postmessage": "บัตรสวัสดิการแห่งรัฐรอบใหม่ อาจมีทั้งคนเสียสิทธิ์และได้สิทธิ์เพิ่ม คาดลงทะเบียนมกราคม ปีหน้า แอดมีข่าวดีมาบอก สำหรับผู้ที่รอขึ้นทะเบียนบัตรสวัสดิการแห่งรัฐรอบใหม่ ขณะนี้รัฐมนตรีคลังโดยท่านอุตตม สาวนายน ได้สั่งให้ปลัดกระทรวงการคลังจัดตั้งกองประชารัฐสวัสดิการเข้ามาดูในเรื่องของสวัสดิการให้กับกลุ่มผู้ถือบัตรสวัสดิการแห่งรัฐเดิมจำนวน 14.6 ล้านราย อย่างต่อเนื่อง ทั้งนี้ ในเดือนมกราคม 2563 กระทรวงการคลังจะเสนอคณะรัฐมนตรี (ครม.) เปิดลงทะเบียนผู้มีรายได้น้อยรอบใหม่ ซึ่งข้อเสนอเบื้องต้นจะนำรายได้ครอบครัวมาใช้เป็นเกณฑ์ประเมินร่วมกับรายได้ส่วนบุคคลที่กำหนดไม่เกิน 100,000 บาทต่อปี ส่วนข้อมูลบัตรเครดิตและรถยนต์ ยังไม่นำมาพิจารณา อย่างไรก็ตามหากนำรายได้ครอบครัวมาประเมิน อาจทำให้ผู้ได้รับบัตรสวัสดิการหายไปส่วนหนึ่ง ขณะเดียวกันพร้อมเปิดให้คนใหม่เข้ามาลงทะเบียนเพิ่มเติมด้วย “จุดประสงค์คือ คนที่ได้บัตรต้องจนจริง ๆ และอยู่ในครอบครัวไม่มีฐานะร่ำรวย หากมีรายได้ ของครอบครัวปีละ 1 ล้านบาท ก็ไม่ควรได้รับบัตรทั้งครอบครัว” ทั้งนี้ หากมีความคืบหน้าเพิ่มเติม !! แอดจะนำข้อมูลมาแจ้งให้ทราบเป็นระยะ ๆ ครับ",
    "postengagement": 16543,
    "postreaction": 14705,
    "postcomment": 761,
    "postshare": 1077,
    "posturl": "https://www.facebook.com/493026767870664/posts/771168786723126"
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2021-06-21",
    "postmessage": "2021-06-21",
    "postengagement": 6272,
    "postreaction": 4893,
    "postcomment": 1232,
    "postshare": 147,
    "posturl": "https://www.facebook.com/182657125936067/posts/880141746187598"
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2022-08-30",
    "postmessage": "เกษตรกรเฮ ! “จุรินทร์” พบบริษัทปุ๋ยยักษ์ใหญ่ของซาอุชื่อ “ซาบิค” เจรจานำเข้าได้อีก 1 แสนตัน ในเดือนสิงหาคม (31 ส.ค. 65) เวลา 08.30 น. นายจุรินทร์ ลักษณวิศิษฏ์ หัวหน้าพรรคประชาธิปัตย์ รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ พร้อมด้วยผู้แทนภาครัฐและเอกชน พร้อมด้วยคณะผู้บริหารระดับสูงกระทรวงพาณิชย์และผู้แทนภาคเอกชน ให้สัมภาษณ์ภายหลังการ พบหารือกับผู้บริหารบริษัท SABIC (Saudi Basic Industries Corporation) Mr.Yousef Abdullah Al-Benyan ตำแหน่ง CEO บริษัท SABIC และคณะ ที่บริษัท SABIC ประเทศซาอุดิอาระเบีย วานนี้(30 ส.ค.65) นายจุรินทร์ กล่าวว่า SABIC ถือเป็นบริษัทผลิตปุ๋ยรายใหญ่รายหนึ่งของโลกและเป็นรายใหญ่ของซาอุดีอาระเบีย หารือกับ CEO ของ SABIC ซึ่งบริษัทนี้ทำธุรกิจหลายด้านโดยเฉพาะปิโตรเคมี ปุ๋ย เคมีภัณฑ์และอื่นๆทั้งอุปกรณ์การแพทย์ เป็นต้น ซึ่งดำเนินกิจการมาแล้ว 50 ปี ถือเป็นอันดับหนึ่งในตะวันออกกลาง ค้าขายกับ 50 ประเทศทั่วโลก โดยไทยถือว่าเป็นหนึ่งในนั้น และหลังจากฟื้นความสัมพันธ์ บริษัท SABIC ให้ความสำคัญกับประเทศไทยเป็นพิเศษ ซึ่งเป็นนโยบายของรัฐบาลทั้งสองฝ่าย ในเรื่องของปุ๋ยรัฐบาลซาอุดีอาระเบียต้องการอำนวยความสะดวกการเจรจา เพื่อให้ประเทศไทยสามารถนำเข้าปุ๋ยจากซาอุดีอาระเบียได้มากขึ้น อย่างน้อยนโยบายของตนตราบเท่าที่การแก้ปัญหาเรื่องราคาไม่ได้เพราะต้นทุนการผลิตสูงขึ้นมากและปุ๋ยทำจากแก๊สธรรมชาติ เมื่อราคาแก๊สในตลาดโลกยังสูง ส่งผลให้ราคาปุ๋ยในตลาดโลกสูงขึ้นด้วย ซึ่งเราต้องนำเข้าปุ๋ยเกือบ 100% ต้นทุนการนำเข้าปุ๋ยในประเทศไทยจึงสูงขึ้นตามราคาปุ๋ยในตลาดโลกและราคาแก๊สในตลาดโลก รวมทั้งการขนส่งปุ๋ยเข้ามาต้องใช้น้ำมัน ทำให้ราคาปุ๋ยในประเทศมีราคาสูง แต่ในประเทศเราต้องแก้ปัญหา 2 ข้อ 1. เรื่องราคา 2. เรื่องปริมาณต้องไม่ให้ขาดแคลนสำหรับความต้องการใช้ของเกษตรกร เรื่องราคาเราแก้ไขด้วยการจัดทำโครงสร้างราคาใหม่ โดยกรมการค้าภายในเป็นผู้ดำเนินการ ซึ่งทำเสร็จแล้วสอดคล้องกับต้นทุนที่เป็นจริงในการนำเข้า โดยดูจากใบอินวอยด์จริง ซื้อขายจริง ให้ยุติธรรมกับเกษตรกรที่เป็นผู้ใช้ปลายทางและผู้นำเข้า เรื่องปริมาณตอนนี้ถือว่าแก้ปัญหาลุล่วง เราเร่งเจรจากับซาอุดีอาระเบียนำเข้าปุ๋ย ซึ่งขณะนี้ทำสัญญาซื้อขาย นำเข้าปุ๋ยได้แล้วถึงเดือนกรกฎาคม จำนวน 323,000 ตัน และเดือนสิงหาคมนี้ มีการเจรจานำเข้าเพิ่มเติมอีก 102,000 ตัน รวมนำเข้าปุ๋ยจากซาอุฯ 425,000 ตัน และจะดำเนินการให้เสร็จสิ้นในเดือนสิงหาคม อย่างน้อยปัญหาขาดแคลนปุ๋ยไม่น่าจะเกิดขึ้น แต่เรื่องราคายังต้องเป็นไปตามกลไกของราคาปุ๋ยในตลาดโลก ซึ่งรัฐบาลจะต้องจัดโครงการปุ๋ยราคาพิเศษช่วยเหลือเกษตรกรเป็นการเฉพาะ ตนได้สั่งการว่าจะทำอย่างไรให้กระทรวงเกษตรฯกับกระทรวงพาณิชย์ร่วมมือกันแสวงหาแหล่งปุ๋ยราคาพิเศษ ซึ่งไม่ใช่เรื่องง่าย แต่จะพยายามเต็มที่ และจัดปุ๋ยราคาพิเศษให้กลุ่มเกษตรกร แต่ละรายเป็นราคาตลาด ซึ่งตนได้สั่งการไปแล้ว สำหรับซาอุดีอาระเบียเรานำเข้าปุ๋ยได้เยอะขึ้น เร่งรัดมากกว่าช่วงที่ผ่านมา เพราะรัฐบาลไฟเขียวให้โอกาสเรานำเข้ามากขึ้นเดิม นำเข้าจาก SABIC เป็นหลัก ตอนหลังให้นำเข้าจากบริษัทมาเดน (MA'ADEN) ได้เพิ่มขึ้นด้วย ซึ่งมาเดน ผลิตฟอสฟอรัสเป็นหลัก ส่วน SABIC ผลิตยูเรียเป็นหลัก จะนำเข้าฟอสฟอรัสกับยูเรียได้มากขึ้น ส่วนโพแทสเซียมหาจากแหล่งอื่นเพิ่มเติม “ซึ่งโครงการปุ๋ยราคาพิเศษได้ทำมาแล้วรอบหนึ่ง โดยใช้ความร่วมมือระหว่างสมาคมปุ๋ยแห่งประเทศไทยกับกระทรวงเกษตรฯและกระทรวงพาณิชย์ ปรับราคาปุ๋ยลง จากราคาตลาดกระสอบละ 20-50 บาท จำนวน 4,500,000 กระสอบ และมีอีกทางคือการช่วยสนับสนุนชดเชยราคาปุ๋ยให้กับเกษตรกรซึ่งรอการพิจารณาของฝ่ายต่างๆที่ดูแลด้านการเงินการคลังของประเทศอยู่” รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์กล่าว ข้อมูลจากกรมส่งเสริมการค้าระหว่างประเทศ แจ้งว่า ซาอุดีอาระเบียเป็นหนึ่งในผู้ส่งออกปุ๋ยเคมีอันดับที่ 6 ของโลก ซึ่งปุ๋ยเคมีที่ซาอุดีอาระเบียส่งออกมากที่สุด ได้แก่ 1.ปุ๋ยผสม NPK 2.ปุ๋ยไนโตรเจน 3.ปุ๋ยโพแทสเซียม และประเทศที่ซาอุดีอาระเบียส่งออกปุ๋ยเคมีมากที่สุด ได้แก่ อินเดีย บังกลาเทศ บราซิล สหรัฐอเมริกา ออสเตรเลีย และไทย ผู้ส่งออกปุ๋ยเคมีรายใหญ่ของซาอุดีอาระเบียคือ SABIC, Saudi Arabian Fertilizer Company (SAFCO) และ Saudi United Fertilizer Co. (Al-Asmida) ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter : @democratTH Instagram : @Democratparty.th YouTube : พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH #ทีมจุรินทร์",
    "postengagement": 1761,
    "postreaction": 1583,
    "postcomment": 154,
    "postshare": 24,
    "posturl": "https://www.facebook.com/481862869964239/posts/626384385512086",
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2021-06-09",
    "postmessage": "ประยุทธ์คิดอะไรไม่ออก ตอบไม่ถูก #โทษคนอื่นเก่ง ต้องงัดไม้ตาย โยนความผิดไปให้ ‘จำนำข้าว’ จนชาวบ้านเอือมระอากันไปหมดแล้ว! . สุทิน คลังแสง ส.ส.มหาสารคาม และประธานวิปฝ่ายค้าน จัดหนัก จัดเต็ม อบรมผู้นำรัฐบาลประยุทธ์ ตั้งแต่หลักการสำคัญของนโยบายสาธารณะที่คำนึงถึงการแก้ไขปัญหาความทุกข์ยากของพี่น้องประชาชน กระบวนการทำงานและระบบของจำนำข้าวกับการหมุนเวียนของเม็ดเงินและเศรษฐกิจประเทศ แต่ต้องมาชะงักเพราะการรัฐประหารปี 2557 . รวมไปถึง ‘ความจริง’ ของเรื่อง หนี้สาธารณะจากจำนำข้าว กับหนี้จำนวนมหาศาลที่ พลเอกประยุทธ์ ได้สร้างเอาไว้ตลอด 7 ปีที่เข้ามาบริหารประเทศ . รับชมและรับฟัง ‘ความจริง’ กันอีกครั้ง จาก ‘สุทิน คลังแสง’ ในการ อภิปรายร่าง พ.ร.บ.งบประมาณปี 2565",
    "postengagement": 161311,
    "postreaction": 129495,
    "postcomment": 4258,
    "postshare": 27558,
    "posturl": "https://www.facebook.com/149079361791677/posts/4410314775668093"
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2020-07-19",
    "postmessage": "[ พรรคก้าวไกลขอเรียกร้องให้รัฐบาลและกองทัพบกจงมีสำนึกรับผิดชอบต่อประชาชน ตระหนักถึงความรู้สึกผิดชอบชั่วดี มีสามัญสำนึกที่มีกาลเทศะ คำนึงถึงความทุกข์ยากของประชาชนที่เป็นเจ้าของเงินแผ่นดิน และยุติการจัดซื้อเครื่องบิน VIP มูลค่า 1,348.5 ล้านบาท โดยทันที! ] . จากที่ปรากฏเป็นข่าวว่า กรมการขนส่งทหารบกได้เผยแพร่ ประกาศแผนการจัดซื้อเครื่องบินใช้งานทั่วไปขนาดกลาง พร้อมติดตั้งอุปกรณ์มาตรฐาน 1 ลำ (รหัสแผนการจัดซื้อ P63070008172) ลงวันที่ 10 กรกฎาคม 2563 . ซึ่งโครงการดังกล่าวนี้มีมูลค่าสูงถึง 1,348.5 ล้านบาท โดยคาดว่าจะประกาศจัดซื้อจัดจ้างในเดือนสิงหาคม 2563 ที่กำลังจะถึงนี้ และเมื่อพิจารณาจากประกาศราคากลาง พบว่ากองทัพบกได้สอบราคาจากบริษัท Gulfstream Aerospace และได้กำหนดราคากลางอยู่ที่ 43.5 ล้านเหรียญสหรัฐ ซึ่งเมื่อคิดเป็นสกุลเงินบาทแล้ว พบว่ามีราคาอยู่ที่ 1,348.5 ล้านบาท ตรงกับวงเงินงบประมาณ และเชื่อว่าเครื่องบินที่กำลังจะจัดซื้อ นั้นมีแนวโน้มที่จะเป็นเครื่องบิน VIP Gulfstream G500 ซึ่งเครื่องบินรุ่นนี้ จะใช้เพื่อวัตถุประสงค์ในการโดยสารของนายทหารระดับผู้บังคับบัญชา และบุคคลสำคัฐระดับ VIP . แม้ว่าทางกองทัพบกจะให้เหตุผลว่า กองทัพบกได้ตัดโอนงบประมาณไปแล้วถึง 8,894.95 ล้านบาท และการจัดซื้อในครั้งนี้ ก็เป็นการจัดซื้อโดยใช้งบประมาณของปี 2563 ที่ตั้งเอาไว้แล้ว แต่การอ้างว่าเป็นงบเดิม และที่ผ่านมาโอนงบไปเยอะแล้ว ไม่ใช่เหตุผลที่สังคมจะยอมรับการใช้จ่ายภาษีของประชาชนอย่างสุรุ่ยสุร่าย ในสภาวะที่เศรษฐกิจกำลังตกต่ำ ปากท้องของประชาชนกำลังลำบาก ของกองทัพได้ . สภาวะเศรษฐกิจที่ตกต่ำ ที่ประชาชนในกลุ่มผู้ใช้แรงงาน พนักงานบริษัท อาชีพอิสระรับจ้างทั่วไป พ่อค้าแม่ขาย และเจ้าของกิจการขนาดย่อม กำลังตกทุกข์ได้ยาก ชีวิตเหมือนแขวนอยู่บนเส้นด้ายแบบนี้ ที่มีการประเมินกันว่า . * อาจจะมีคนตกงานสูงถึง 8.4 ล้านคน * นักศึกษาที่จบการศึกษาในปี 2563 นี้ จำนวน 5.2 แสนคน มีแนวโน้มว่าจะหางานทำได้ยากมากๆ * มีนักเรียนมากถึง 6.7 แสนคน ที่จำใจต้องหลุดออกจากระบบการศึกษา เนื่องจากความยากจน และรายได้ครอบครัวที่หดหายไป * ธุรกิจการท่องเที่ยวที่มีแนวโน้มปิดตัวถาวรถึง 30% กับสถานการณ์ที่พบว่า ในช่วง 5 เดือนแรก (มกราคม-พฤษภาคม 2563) มีนักท่องเที่ยวต่างชาติเดินทางเข้าไทยลดลง 59.97% หรือลดลง 10.02 ล้านคนเมื่อเทียบกับช่วงเดียวกันของปีที่แล้ว ขณะที่รายได้รวมจากนักท่องเที่ยวต่างชาติลดลง 59.57% หรือลดลง 4.89 แสนล้านบาทเมื่อเทียบกับช่วงเดียวกันของปีที่แล้ว และยังไม่มีแนวโน้มว่าจะฟื้นตัวขึ้น * ธุรกิจร้านอาหาร 4 แสนราย ที่กำลังดิ้นรนอย่างหนัก โดยมีร้านอาหารมากถึง 5 หมื่นรายได้ปิดกิจการไปแล้ว และมีแนวโน้มว่าจะปิดตัวเพิ่มขึ้นอีก . ที่สำคัญที่สุดก็คือ เครื่องบิน VIP ที่กำลังจะมีการจัดซื้อในครั้งนี้ ไม่ใช่ยุทโธปกรณ์ที่จะถูกนำไปใช้งานในพื้นที่ยุทธบริเวณ เพื่อสนับสนุนภารกิจ หรือเพื่อลดความเสี่ยงในการปฏิบัติหน้าที่ของทหารในพื้นที่ ที่มีการสู้รบแต่อย่างใด แต่เป็นการจัดซื้อเพื่ออำนวยความสะดวกให้แก่นายทหารระดับสูง ซึ่งไม่มีความจำเป็นที่จะต้องซื้อเลย ทั้งๆ ที่ประชาชนกำลังลำบาก พ่อค้าแม่ขายกำลังตกทุกข์ได้ยาก . ในขณะที่เมื่อวันที่ 15 กรกฎาคมที่ผ่านมา กับกรณีที่รัฐบาลมีการละเว้นการปฏิบัติหน้าที่ ปล่อยปละละเลย จนมีกรณีทหารอียิปต์ที่ตรวจพบเชื้อโควิด-19 ออกมาปะปนกับประชาชนชาวระยอง จนทำให้ธุรกิจท่องเที่ยวในจังหวัดระยองได้รับผลกระทบอย่างหนัก มีการยกเลิกการจองห้องพักสูงถึง 90% จนส่งผลกระทบทางเศรษฐกิจเป็นวงกว้างในจังหวัดระยอง แต่นอกจากการขอโทษแบบขอไปทีจากนายกรัฐมนตรีแล้ว ยังไม่มีการแสดงความรับผิดชอบอย่างเป็นรูปธรรมแต่อย่างใด ไม่มีความสำนึกผิด ไม่คิดที่จะชดเชยเยียวยาใดๆ ให้กับประชาชนผู้ได้รับผลกระทบเลย . แต่กับกรณีการจัดซื้อ เครื่องบิน VIP ซึ่งยังไม่มีความจำเป็นเลย รัฐบาลนี้กลับอนุมัติงบประมาณให้มีการจัดซื้อในวงเงินสูงถึง 1,348.5 ล้านบาท เพียงเพื่ออำนวยความสะดวกสบายให้กับคนเพียงแค่หยิบมือเดียว โดยไม่คิดที่จะทบทวน หรือทักท้วงแต่อย่างใด . สะท้อนให้เห็นว่า การจัดซื้อในครั้งนี้ เป็นการจัดซื้อที่กองทัพบก และรัฐบาลขาดสามัญสำนึก ไม่นึกถึงปัญหาปากท้อง และชีวิตที่ต้องต่อสู้ดิ้นรนของประชาชน คิดแต่จะสูบเอาภาษีที่เป็นหยาดเหงื่อน้ำพักน้ำแรงของประชาชน และเงินกู้ที่จะเป็นภาระของประชาชนทั้งที่ยังมีชีวิตอยู่ในวันนี้ และที่กำลังจะเกิดมาในอนาคต เพื่อให้ตนเอง และพวกพ้องเครือข่ายอุปถัมภ์ของตนได้เสวยสุข บนความทุกข์ยากของประชาชน . พรรคก้าวไกลจึงขอเรียกร้องให้รัฐบาล และกองทัพบก จงมีสำนึกรับผิดชอบต่อประชาชน ตระหนักถึงความรู้สึกผิดชอบชั่วดี มีสามัญสำนึกที่มีกาลเทศะ คำนึงถึงความทุกข์ยากของประชาชนที่เป็นเจ้าของเงินแผ่นดิน และยุติการจัดซื้อเครื่องบิน VIP มูลค่า 1,348.5 ล้านบาท โดยทันที . #ก้าวไกล #เครื่องบินVIP #Covid19 #โควิด19 . ----- . - ร่วมเดินทางกับพวกเรา ด้วยการสมัครเป็นสมาชิกพรรคก้าวไก คลิก https://www.moveforwardparty.org/join/ . - ร่วมสนับสนุนการทำงานของพวกเราผ่านการบริจาคได้ที่ คลิก https://donation.moveforwardparty.org/donation/ . - บริจาคให้พรรคก้าวไกล ผ่านการยื่นภาษีประจำปี เลือก 164 (โดยไม่เสียภาษีเพิ่ม) . ----- . (ผู้จัดทำ พรรคก้าวไกล เลขที่ 22 ซอยเพชรเกษม 47/2 กรุงเทพมหานคร 10160 จำนวน 1 ชุด วันที่ผลิต 20 กรกฎาคม 2563)",
    "postengagement": 47749,
    "postreaction": 25252,
    "postcomment": 2510,
    "postshare": 19987,
    "posturl": "https://www.facebook.com/100106918288004/posts/163418195290209"
  },
  {
    "topic": "เศรษฐกิจ",
    "party": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2021-11-17",
    "postmessage": "เสรีพิศุทธ์” ให้ความเห็นกรณี “นายก” สั่งใช้รถทหาร-พลขับ ขนส่งสินค้า แทนรถบรรทุกประท้วงน้ำมันแพง 18 พ.ย. 2564 พล.ต.อ.เสรีพิศุทธ์ เตมียเวส หัวหน้าพรรคเสรีรวมไทย ให้สัมภาษณ์ผู้สื่อข่าวกรณี นายกรัฐมนตรี พล.อ. ประยุทธ์ จันทร์โอชา\" สั่งใช้รถทหารขนส่งสินค้า แทนรถบรรทุกหยุดวิ่ง ประท้วงราคาน้ำมันดีเซลพุ่ง",
    "postengagement": 5699,
    "postreaction": 5178,
    "postcomment": 169,
    "postshare": 352,
    "posturl": "https://www.facebook.com/161052211196800/posts/938223676812979/"
  },
  {
    "topic": "กัญชา",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-06-17",
    "postmessage": "รวมพลังประชารัฐ ดร.พรรณสิริ กุลนาถศิริ ส.ส.สุโขทัย เขต 1 พรรคพลังประชารัฐ . ดร.พรรณสิริ กุลนาถศิริ ส.ส.สุโขทัย เขต 1 พรรคพลังประชารัฐ ประธานอนุกรรมาธิการวิสามัญพิจารณาศึกษาแก้ปัญหาการใช้พืชกัญชงอย่างเป็นระบบ แจ้งผลการศึกษาจากการประชุมและเชิญหน่วยงานมาให้ข้อมูล 12 ครั้ง พบว่า “กัญชง”เป็นพืชเศรษฐกิจมูลค่าสูงกำลังเป็นที่ต้องการในตลาดโลก ขณะนี้จัดว่าเป็นยาเสพติดให้โทษประเภทที่ 5 ประชาชนยังไม่สามารถขออนุญาตปลูกได้ มีเพียงการอนุญาตให้สำนักวิจัยและพัฒนาพื้นที่สูง (สวพส.) ปลูกได้ในพื้นที่ 8 จังหวัด เช่น ตาก เชียงใหม่ และพิษณุโลก ฯลฯ จำนวน 533 ไร่ และหน่วยงานภาครัฐ ให้ปลูกเพื่อการศึกษาวิจัยเท่านั้น . คณะกรรมาธิการมีความเห็นว่า ”กัญชง” ควรได้รับการสนับสนุน ส่งเสริมให้เป็นพืชเศรษฐกิจสำคัญของไทย ทั้งด้านเกษตรกรรม อุตสาหกรรม และพาณิชยกรรม รวมทั้งการปลูกทดแทนพืชรายได้ต่ำให้กับเกษตรกร โดยมีข้อเสนอแนะต่อหน่วยงานที่เกี่ยวข้องว่า ต้องให้ประชาชนเข้าถึงการปลูก ผลิต จำหน่าย และมีไว้ในครอบครองได้โดยง่าย ที่สำคัญยิ่งการเสนอปรับแก้(ร่าง)กฎกระทรวงที่กำลังจะประกาศใช้เร็ว ๆ นี้ ให้อนุญาตให้ประชาชนปลูกเพื่อใช้ประโยชน์ในครัวเรือนได้เฉพาะส่วนของเส้นใย เป็นการใช้ประโยชน์จากทุกส่วนของพืช ทั้งลำต้น ดอก เมล็ด ฯลฯ และเพิ่มพื้นที่การปลูกเป็น 20 ไร่ จากที่กำหนดเดิมไว้เพียง 1 ไร่ เท่านั้น #กรรมาธิการ #กัญชง #สสพรรณสิริ #สุโขทัย #สสพปชร #พลังประชารัฐ",
    "postengagement": 1147,
    "postreaction": 1082,
    "postcomment": 50,
    "postshare": 15,
    "posturl": "https://www.facebook.com/493026767870664/posts/909319772908026"
  },
  {
    "topic": "กัญชา",
    "party": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2021-03-07",
    "postmessage": "สธ.ปลดล็อกกัญชา ขอปลูกได้บ้านละ 6 ต้น สร้างรายได้ให้ชุมชน . นายอนุทิน ชาญวีรกูล รองนายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงสาธารณสุข (สธ.) กล่าวระหว่างเป็นประธานในพิธีเปิดงาน “มหกรรมกัญชากัญชง 360 องศา เพื่อประชาชน” ที่สนามช้าง อินเตอร์เนชั่นแนล เซอร์กิต จ.บุรีรัมย์ เมื่อวันที่ 5 มีนาคม . ว่าตนรู้สึกปลาบปลื้มใจอย่างมาก ที่เห็นทุกคนร่วมผลักดันให้ประเทศไทยและคนไทยได้รับประโยชน์มหาศาลจากพืชเศรษฐกิจตัวใหม่ คือ “กัญชา” และ “กัญชง” วันนี้เป็นการตอกย้ำเจตนารมณ์และนโยบายกัญชาที่ สธ. โดยคณะผู้บริหารชุดนี้ประกาศไว้ ขณะที่ผมได้ประกาศไว้ช่วงการเลือกตั้งว่า นโยบายกัญชา 6 ต้น จะต้องเป็นรูปธรรม โดยขณะนี้นโยบายดังกล่าวมีผลอย่างเป็นรูปธรรมแล้ว . “เราได้หาช่องทางให้ประชาชนมีกัญชา 6 ต้น ในบริเวณบ้านของตนเองได้แล้ว ในรูปแบบวิสาหกิจชุมชน ร่วมมือกับโรงพยาบาลส่งเสริมสุขภาพตำบล (รพ.สต.) ที่เป็นคู่สัญญากัน ประชาชนสามารถปลูกและส่งมอบช่อดอกกัญชาพร้อมเมล็ดให้กับ รพ.สต ไปผลิตเป็นยาตามกฎหมาย ส่วนใบ ราก กิ่ง ก้าน ลำต้น เป็นของประชาชน และได้รับการปลดออกจากยาเสพติดให้โทษประเภทที่ 5 ดังนั้น ประชาชนในวิสาหกิจชุมชน สามารถนำมาใช้ประโยชน์แปรรูป ปรุงอาหารเพื่อจำหน่าย สร้างรายได้เสริม เพิ่มรายได้พิเศษให้กับตนเองและครอบครัว” นายอนุทินกล่าว . โดยโครงการปลูกกัญชา 6 ต้น เป็นการผลิตวัตถุดิบทางการแพทย์ให้แก่ รพ.สต. ถือเป็นสิ่งที่ชอบธรรม และเป็นสิ่งที่ทำได้ภายใต้กฎหมายที่กำหนดไว้ นอกจากนั้น ยังสร้างรายได้ให้ตนเอง เพื่อนวิสาหกิจชุมชนไปพร้อมๆ กัน ซึ่งสอดคล้องกับนโยบายของรัฐบาลชุดนี้ หมายเหตุ : เงื่อนไขการขออนุญาตเป็นไปตามที่กระทรวงสาธารณสุขกำหนด #อนุทิน #สาธารณสุข #กัญชาทางการแพทย์ #คนภูมิใจไทย",
    "postengagement": 8425,
    "postreaction": 7375,
    "postcomment": 572,
    "postshare": 478,
    "posturl": "https://www.facebook.com/182657125936067/posts/818313792370394"
  },
  {
    "topic": "กัญชา",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2022-06-10",
    "postmessage": "“พิมพ์รพี” ห่วง กัญชาเสรีเข้าถึงเด็กไทยง่าย มีฤทธิ์ต่อจิตประสาทถึงตายได้ (11 มิ.ย. 65) ดร.พิมพ์รพี พันธุ์วิชาติกุล ส.ส.บัญชีรายชื่อ พรรคประชาธิปัตย์ แสดงความเป็นห่วงต่อกระแสกัญชาฟีเวอร์ การแจกจ่ายต้นกล้ากัญชาอย่างกว้างขวาง หลังปลดล็อกกัญชาจากยาเสพติด ว่าจะส่งผลกระทบต่อสังคมเป็นวงกว้าง เพราะการให้ปลูกกัญชาได้โดยเสรี ทำให้หลักคิดเริ่มต้นที่ต้องการใช้ในทางการแพทย์เริ่มจางหายไป กลายเป็นเรื่องสันทนาการมานำการแพทย์ไปแล้ว ที่น่ากังวลคือกลุ่มเยาวชน ที่จะเข้าถึงกัญชาง่ายไม่แตกต่างจากบุหรี่ ดังนั้นจึงจำเป็นต้องรณรงค์อย่างเร่งด่วนถึงพิษภัยของกัญชาที่ส่งผลต่อจิตประสาท มีผลต่อสมอง พัฒนาไม่เต็มที่ รัฐสภาของเราจึงต้องเร่งออกกฎหมายรองรับ กำหนดมาตรการควบคุม ผลิต การขายอาหารผสมกัญชา ต้องมีเครื่องหมายระบุชัด “ห้ามเด็กและเยาวชนอายุต่ำกว่า 20 ปี บริโภค\" “ดิฉันคิดว่าเป็นความรับผิดชอบร่วมกันของรัฐสภาและครม. หลังมีการปลดล็อกกัญชาจากยาเสพติด โดยยังไม่มีมาตรการรองรับ ทำให้เกิดสูญญากาศในการควบคุมไปอีกหลายเดือน ต้องเร่งขจัดสูญญากาศนี้เสีย ไม่เช่นนั้นนโยบายที่ออกไปจะกลายเป็นเรื่องของคะแนนนิยม ที่ขาดความรับผิดชอบต่อสังคม ซึ่งไม่ควรปล่อยให้เป็นเช่นนั้น กัญชามีคุณแต่ก็มีโทษเช่นเดียวกัน สารที่มีฤทธิ์เสพติด ส่งผลต่อสุขภาพกายและจิตในระยะเฉียบพลัน และอาจรุนแรงถึงกับชีวิตได้ รวมถึงมีผลกระทบในระยะยาวต่อสมอง ทำให้มีการเปลี่ยนแปลงโครงสร้างและการทำงานของสมองที่กำลังพัฒนาของเด็กและวัยรุ่น จึงต้องเร่งสร้างภูมิคุ้มกันให้กับอนาคตของชาติด้วยการให้ความรู้ที่ถูกต้องโดยเร่งด่วน” ดร.พิมพ์รพี กล่าว ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter: @democratTH Instagram: @Democratparty.th YouTube: พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH",
    "postengagement": 3143,
    "postreaction": 2279,
    "postcomment": 515,
    "postshare": 349,
    "posturl": "https://www.facebook.com/481862869964239/posts/570637414420117"
  },
  {
    "topic": "กัญชา",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2022-08-08",
    "postmessage": "‘กัญชาเสรี’ ผิดทิศ หลงทาง ระวังได้ไม่คุ้มเสีย สร้างตราบาปสังคม อนาคตเยาวชนถูกเดิมพันใช้แลกคะแนนเสียง หลอกให้ปลูกแต่ส่งออกไม่ได้ สุดท้ายถูกปล่อยทิ้งเป็นภาระการแพทย์-ปัญหาสังคม - - - - - พรรคเพื่อไทย จัดเสวนาในหัวข้อ “กัญชาเสรี ผิดทิศ หลงทาง ?\" โดย สุทิน คลังแสง ส.ส.มหาสารคามและรองหัวหน้าพรรค พร้อมด้วย นายแพทย์สุรวิทย์ คนสมบูรณ์ ส.ส.ชัยภูมิและอดีตรัฐมนตรีช่วยว่าการกระทรวงสาธารณสุข จิรายุ ห่วงทรัพย์ ส.ส.กทม. และ กิตติ์ธัญญา วาจาดี ส.ส.อุบลราชธานี ร่วมให้ความเห็นเกี่ยวกับปัญหาและพิษภัยของกัญชาเสรีแบบไร้ทิศทางของรัฐบาลชุดนี้ . สุทิน คลังแสง กล่าวว่า ตลอดเวลาที่ผ่านมาปัญหากัญชาเสรีไร้กรอบนั้นภาครัฐพยายามพูดอยู่แค่ 2 ประเด็นคือ กัญชาเสรีเป็นประโยชน์ทางการแพทย์ และ กัญชาเสรีดีต่อเศรษฐกิจ แต่ประเด็นการใช้เพื่อประโยชน์ทางการแพทย์นั้นแพทย์ใช้ในการรักษากันมาก่อนหน้านี้แล้วและหากคิดว่าอยากส่งเสริมประโยชน์การแพทย์จริง ก็ควรส่งเสริมโครงการ 30 บาทรักษาทุกโรค เอางบประมาณมาอุดหนุนบัญชียาแห่งชาติ เพิ่มงบโรงพยาบาลและบุคลากรทางการแพทย์น่าจะเป็นประโยชน์และชัดเจนกว่า ส่วนด้านเศรษฐกิจนั้นวันนี้ยังไม่เห็นตัวเลขส่งออกที่ชัดเจนเลยว่าประโยชน์จากเรื่องนี้คำนวณออกมาได้เท่าไรและส่งออกได้จริงหรือไม่ เพราะทั่วโลกยังบอกว่ากัญชาคือยาเสพติด ถ้าส่งออกไม่ได้ ก็จะกลายเป็นกัญชาวนเวียนกันอยู่ในประเทศ งบประมาณที่ต้องรักษาผู้เสพ รวมไปถึงภาพลักษณ์ประเทศ ถ้าหักลบกลบหนี้กันกับความเสื่อมโทรมของสังคมแล้ว จึงไม่แน่ใจว่า ได้คุ้มเสียหรือไม่ . “วันนี้ถึงขนาดเอาต้นกัญชามาเดินแจกกันในหมู่บ้าน บอกว่า 6 เดือนตัดขายได้ เดี๋ยวพอถึงเวลาขายไม่ได้จริง โดนเขาต้ม กัญชาที่ปลูกไว้ ก็จะวนกลับมาเสพกันเองในครอบครัว คราวนี้กัญชาจะได้วนอยู่ในบ้านในชุมชน เป็นนโยบายที่จะสร้างบาปมโหฬาร และสุดท้ายสังคมก็จะเรียกร้องให้กัญชากลับไปเป็นยาเสพติดเหมือนเดิม” รองหัวหน้าพรรคเพื่อไทยกล่าว . นายแพทย์สุรวิทย์ คนสมบูรณ์ กล่าวว่า ตั้งแต่เริ่มปลดล็อกกัญชา ในช่วงเดือนมิถุนายนที่ผ่านมา แต่กลับไม่มีกฎหมายรองรับ ทำให้สถิติผู้ป่วยจากการเสพกัญชา เข้ารักษาตัวในโรงพยาบาลจำนวนมากขึ้น มีตั้งแต่หลอน เมากัญชา จนถึงขั้นรุนแรง ต้องรับไว้รักษาตัวในโรงพยาบาล ต้องใช้แพทย์บุคลากรสาธารณสุขและงบประมาณจำนวนมากในการรักษา ขอเรียกร้องให้ภาครัฐเปิดเวทีรับฟังความเห็นของบุคลากรด้านการแพทย์โดยตรง เพื่อจะได้รู้ถึงปัญหาแท้จริงมากกว่าการฟังหมอการเมือง โดยไม่ฟังเสียงจากหมอมืออาชีพ . กิตติ์ธัญญา วาจาดี กล่าวว่า ปัญหาจริงที่พบในพื้นที่คือ ครอบครัวและชุมชนได้รับผลกระทบรุนแรงตั้งแต่เปิดกัญชาเสรี เช่นหมู่บ้านหนึ่ง ในจังหวัดอุบลราชธานี มีเด็กและวัยรุ่นรวมตัวเสพกัญชาโดยที่พ่อแม่ออกไปทำงานไม่ทราบเรื่อง เมื่ออาสาสมัครสาธารณสุข หรือ อสม. ตรวจพบ ก็ห้ามไม่ได้ กำนันผู้ใหญ่บ้านก็บอกว่าไม่รู้จะห้ามอย่างไร พอแจ้งเตือนไปยังพ่อแม่ ก็กลายเป็นทะเลาะเบาะแว้งกันในครอบครัว ลามออกมาถึงหมู่บ้านชุมชน เป็นตัวอย่างจริงที่เห็นชัด ดังนั้นจึงไม่ควรเอาอนาคตของเยาวชนไทยไปแลกกับผลประโยชน์และคะแนนเสียงทางการเมืองของพรรคการเมืองเช่นนี้ . จิรายุ ห่วงทรัพย์ กล่าวว่า นโยบายกัญชาเสรีขณะนี้ คือนโยบายตายเอาดาบหน้า เพราะไม่มีมาตรการรองรับ ภาพลักษณ์ความเชื่อมั่นขอคนไทยไปต่างประเทศเสียหาย วันนี้ คนไทยถือพาสปอร์ตไทยไปต่างประเทศ ถูกจับตรวจกระเป๋าเดินทาง โดนจับตรวจสารเสพติดในร่างกาย ประเด็นอ่อนไหวสะท้อนถึงการยอมรับนโยบายกัญชาเสรีของไทยมากน้อยเพียงไร รัฐบาลเคยคิดหรือไม่ จึงมีคำถามว่าควรยกเลิกหรือไม่ ถ้ายังไม่ยกเลิก ควรจะแขวนนโยบายกัญชาเสรีไว้ชั่วคราว รอให้มาตรการพร้อม ทุกคนเข้าใจ วันไหนพร้อมค่อยประกาศเสรีอีกครั้ง",
    "postengagement": 4234,
    "postreaction": 3862,
    "postcomment": 229,
    "postshare": 143,
    "posturl": "https://www.facebook.com/508952780600376/posts/634327588062894"
  },
  {
    "topic": "กัญชา",
    "party": "ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2019-07-31",
    "postmessage": "[ พิธา@สกลนคร : ปัญหา โอกาส และความท้าทายของเกษตรอินทรีย์-น้ำ-กัญชา ] . เมื่อสัปดาห์ที่แล้ว Pita Limjaroenrat - พิธา ลิ้มเจริญรัตน์ ได้ไปศึกษาประเด็นปัญหาและโอกาสของการเกษตรในภาคอีสาน ที่ จ.สกลนครหลายประเด็น . ตั้งแต่เรื่องเกษตรอินทรีย์-ปัญหาน้ำแล้ง-น้ำท่วมที่เกี่ยวข้องกันอย่างแยกไม่ออกเพราะเป็นเรื่องอำนาจในการจัดสรรทรัพยากร ไปจนถึงประเด็นร้อนแรงในสังคมอย่างเรื่องของ “กัญชาทางการแพทย์” . ที่ทำให้เห็นโอกาส อุปสรรค และความท้าทายจำนวนมากที่ยังรออยู่เบื้องหน้า ในการแก้ปัญหาภาคเกษตรของประเทศไทย . #อนาคตใหม่ #ทิมพิธา",
    "postengagement": 35533,
    "postreaction": 28592,
    "postcomment": 874,
    "postshare": 6067,
    "posturl": "https://www.facebook.com/1620426454699609/posts/2366364333439147"
  },
  {
    "topic": "กัญชา",
    "party": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2019-12-24",
    "postmessage": "วันที่ 25 ธันวาคม 2562 นายแพทย์ประสงค์ บูรณ์พงศ์ ส.ส.บัญชีรายชื่อ พรรคเสรีรวมไทยขอให้สภาผู้แทนราษฎรตั้งคณะกรรมาธิการวิสามัญพิจารณาศึกษาความเป็นไปได้และตรวจสอบผลกระทบของการใช้กัญชาในรูปแบบต่าง ๆ ในประเทศไทยในการประชุมสภาผู้แทนราษฎร ครั้งที่ 15 สมัยสามัญประจำปีครั้งที่สอง)",
    "postengagement": 533,
    "postreaction": 499,
    "postcomment": 2,
    "postshare": 32,
    "posturl": "https://www.facebook.com/161052211196800/posts/498189680816383"
  },
  {
    "topic": "ความเท่าเทียมทางเพศ",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2019-06-19",
    "postmessage": "พปชร.ในฐานะพรรครัฐบาล เตรียมผลักดันข้อเรีียกร้อง กลุ่ม LGBT ให้สำเร็จ ผ่าน กลไกกระทรวง และสภา ทั้ง ร่าง พ.ร.บ.คู่ชีวิต ร่าง พ.ร.บ.เพศสภาพ และแก้หลักสูตรแกนกลาง ชี้สังคมต้องเท่าเทียมทุกเพศสภาพ น.ส.ธณิกานต์ พรพงษาโรจน์ ส.ส.กรุงเทพมหานครเขตบางซื่อ-ดุสิิต ในฐานะประธานกรรมการด้านนโยบายสตรี นำนายกิตตินันท์ ธรมธัช นายกสมาคมฟ้าสีรุ้งแห่งประเทศไทย เข้าพบหารือกับนายอุตตม สาวนายน หัวหน้าพรรคพลังประชารัฐและกลุ่มคนรุ่นใหม่ของพรรค ประกอบด้วย นายรัฐชยุตม์ รุ่งจารุพันธ์ และนริส พลานุรักษา เพื่อให้ช่วยผลักดันนโยบายสร้างความเท่าเทียมให้แก่กลุ่มหลากหลายทางเพศอย่างเป็นรูปธรรม ในฐานะที่พรรคพลังประชารัฐเป็นแกนนำจัดตั้งรัฐบาล เพราะปัจจุบัน บุคคลที่มีความหลากหลายทางเพศ ยังคงประสบปัญหาปัญหาทางสังคมอย่างมากมาย เพราะไม่มีกฎหมายและนโยบายที่คุ้มครองให้ประชาชนกลุ่มนี้ เช่น การไม่สามารถจดทะเบียนสมรส ตามประมวลกฎหมายแพ่งและพาณิชย์ การไม่สามารถเปลี่ยนคำนำหน้าชื่อและแก้ไขเอกสารทะเบียนราษฎร์ได้ และการถูกเลือกปฏิบัติในการจ้างงานและประกอบอาชีพ ดังนั้นจึงอยากให้พรรคพลังประชารัฐ ช่วยผลักดัน ร่าง พ.ร.บ.การจดทะเบียนคู่ชีวิต ซึ่งอยู่ในชั้นกฤษฎีกา ให้ออกมาเป็นกฎหมายบังคับใช้โดยเร็ว เพราะหากสำเร็จจะเป็นกฎหมายที่ดีที่สุดและเป็นประเทศแรกในเอเชีย นอกจากนี้อยากให้มีการแก้ไขหลักสูตรแกนกลางของการเรียนการสอนเกี่ยวกับสุขศึกษาและพละศึกษา ที่มีเนื้อหาเกี่ยวข้องกับเพศศึกษาให้เกิดความเข้าใจ ยอมรับ และเคารพความแตกต่างทางเพศทุกมิติ รวมถึงการเดินหน้า ร่าง พ.ร.บ.เพศภาพ ที่กำลังรอคำสั่งจากรัฐมนตรีว่าการกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ ให้กรมกิจการสตรีดำเนินการต่อให้สำเร็จโดยเร็ว รวมถึงใหมีการตั้งคณะกรรมาธิการสิทธิด้านความหลากหลายทางเพศ เพราะกฎหมายเหล่านี้ เกี่ยวข้องกับกระทรวงยุติธรรม กระทรวงศึกษาธิการ กระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ และสภา จึงจำเป็นอย่างยิ่งที่จะต้องได้รับการผลักดันจากรัฐบาลชุดใหม่ ด้านนายอุตตม กล่าวว่า พรรคพลังประชารัฐ ยินดีที่จะร่วมผลักดันข้อเสนอของสมาคมฟ้าสีรุ้งให้ประสบความสำเร็จ โดยเฉพาะร่่างกฏหมายต่างๆ เพื่อความเท่าเทียมของบุคคลทุกเพศภาพในสังคม ให้เกิดเป็นรูปธรรม และเป็นไปตามหลักสากล เพราะพรรคให้ความสำคัญในเรื่องเหล่านี้ ซึ่งทันทีที่รัฐบาลชุดใหม่ภายใต้การนำของพรรคพลังประชารัฐเข้าไปทำงานก็จะเริ่มผลักดันข้อเรียกร้องเหล่านี้ทันที #​LGBT​ #LGBTQ #​พรรคพลังประชารัฐ​ #​PPRP",
    "postengagement": 881,
    "postreaction": 768,
    "postcomment": 87,
    "postshare": 26,
    "posturl": "https://www.facebook.com/493026767870664/posts/626581244515215"
  },
  {
    "topic": "ความเท่าเทียมทางเพศ",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2019-11-25",
    "postmessage": "จุรินทร์ ดัน ‘ประชาธิปัตย์’ ขับเคลื่อน 3 ข้อ ส่งเสริมความเสมอภาคระหว่างเพศ LGBT นายจุรินทร์ ลักษณวิศิษฏ์ หัวหน้าพรรคประชาธิปัตย์ รองนายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงพาณิชย์ เป็นประธานเปิดการรณรงค์ยุติความรุนแรงต่อสตรีและเพศวิถี โดยกล่าวว่า การเสวนาวันนี้ขอฝากการบ้านให้ทุกฝ่ายและทุกคนคิดทำการบ้าน 3 ประเด็นเพื่อช่วยหาคำตอบจะทำอย่างไรที่จะส่งเสริมความเท่าเทียมระหว่างเพศให้เกิดขึ้นได้ ในโลกความเป็นจริงและเป็นรูปธรรม อ่านต่อ : https://www.democrat.or.th/newsDetail/1019 -- ติดตามข่าวสารเพิ่มเติมได้ที่ Instagram : Democratparty.th Twitter : @democratTH YouTube : พรรคประชาธิปัตย์ Democrat Party, Thailand #DemocratPartyTH #พรรคประชาธิปัตย์",
    "postengagement": 2582,
    "postreaction": 2460,
    "postcomment": 84,
    "postshare": 38,
    "posturl": "https://www.facebook.com/296508406790/posts/10156442392861791"
  },
  {
    "topic": "ความเท่าเทียมทางเพศ",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2022-06-04",
    "postmessage": "‘เพื่อไทย’ ร่วมแสดงจุดยืนสร้างความเท่าเทียมและศักดิ์ศรีคุณค่าความเป็นมนุษย์ของกลุ่มอัตลักษณ์ที่หลากหลาย ในกิจกรรม BANGKOK NARUEMIT PRIDE 2022 พร้อมรับฟังข้อเสนอเพื่อศึกษาและผลักดันเป็นนโยบาย - - - - - พรรคเพื่อไทย นำโดย นายแพทย์พรหมินทร์ เลิศสุริย์เดช กรรมการยุทธศาสตร์และทิศทางการเมือง จุลพันธ์ อมรวิวัฒน์ ส.ส.เชียงใหม่และรองหัวหน้าพรรค ธีรรัตน์ สําเร็จวาณิชย์ ส.ส.กทม.และโฆษกพรรค ณหทัย ทิวไผ่งาม กรรมการบริหารพรรค ธีราภา ไพโรหกุล กรรมการบริหารพรรค ตรีชฎา ศรีธาดา รองโฆษกพรรค ขัตติยา สวัสดิผล อดีต ส.ส.บัญชีรายชื่อ วิสาระดี เตชะธีราวัฒน์ อดีต ส.ส.เชียงราย วิพุธ ศรีวะอุไร ส.ก. เขตบางรัก และ ชานันท์ ยอดหงษ์ ผู้รับผิดชอบนโยบายด้านอัตลักษณ์และความหลากหลายพรรคเพื่อไทย พร้อมด้วยสมาชิกพรรคเพื่อไทยและทีมคนรุ่นใหม่ เข้าร่วมเดินแสดงพลังความเท่าเทียมทางเพศ ในกิจกรรม BANGKOK NARUEMIT PRIDE 2022 ซึ่งมีเป้าหมายเพื่อสื่อสารสาธารณะถึงการยอมรับศักดิ์ศรีคุณค่าความเป็นมนุษย์ของกลุ่มอัตลักษณ์ที่หลากหลาย สะท้อนปัญหาที่เกิดขึ้นต่อกลุ่ม LGBTQ ทั้งในเรื่องเศรษฐกิจ สังคม คุณภาพชีวิต การถูกเลือกปฏิบัติโดยกฎหมายและรัฐ . ชานันท์ ยอดหงษ์ เปิดเผยว่า ทีมพรรคเพื่อไทย ร่วมกิจกรรมขบวนพาเหรดในโซนสีเหลือง ที่มีความหมายถึงการเติบโตอย่างมีความหวัง เพื่อแสดงความจริงใจถึงการให้ความสำคัญกับคุณภาพชีวิต สิทธิและเสรีภาพทางเพศ อันเป็นส่วนหนึ่งของประชาธิปไตย สนใจรับฟังเสียงของกลุ่ม LGBTQ พร้อมจะมีส่วนร่วมกับกิจกรรมที่ประชาชนร่วมกันจัด และยืนยันเจตนารมณ์ในการแก้ไขปัญหาที่เกิดกับทุกอัตลักษณ์ความหลากหลาย . โดยตลอดระยะทางของขบวนไพรด์ ได้สื่อสารเสนอข้อเรียกร้อง เพื่อ LGBTQ และกลุ่มอัตลักษณ์ต่างๆ อย่างหลากหลาย อาทิ . - การสมรสเท่าเทียม ซึ่งเป็นการการเสยอให้แก้ไขเพิ่มเติมประมวลกฎหมายแพ่งและพาณิชย์ บรรพ 5 – 6 โดยเฉพาะมาตรา 1448 ซึ่งหัวใจหลักคือ ให้บุคคลสองคนสามารถจดทะเบียนสมรสได้ โดยไม่กำหนดเฉพาะ ‘ชายกับหญิง’ เท่านั้น เพื่อให้คู่รักทั้งเพศเดียวกันและรักต่างเพศสามารถจดทะเบียนสมรสได้อย่างเสมอภาคกัน เพื่อให้ทุกอัตลักษณ์ที่หลากหลาย มีศักดิ์ศรีอย่างเท่าเทียมกัน ไม่ถูกเลือกปฏิบัติ . - การไม่เห็นด้วยกับการมี พ.ร.บ.คู่ชีวิต พราะนั่นคือการเลือกปฏิบัติ ไม่ยอมรับว่าคนรักเพศเดียวกันจะได้รับการยอมรับทางกฎหมายเทียบเท่าคนรักต่างเพศ และไม่ว่าคู่สัมพันธ์เพศวิถีใดก็สามารถเป็นคู่งชีวิตกันได้ . - การแก้กฎหมายคำนำหน้านาม โดยไม่ต้องยึดติดกับเพศกำเนิด ให้แต่ละเพศสภาพสามารถเลือกใช้คำนำหน้านามตามความต้องการ . - การแก้กฎหมายคุ้มครองแรงงานให้ มีวันลาปวดประจำเดือน ลาเพื่อข้ามเพศได้ โดยได้รับค่าจ้าง นายจ้างกับประกันสังคมจ่ายร่วมกัน . - กระบวนการข้ามเพศ อยู่ใน สปสช. . - สวัสดิการผ้าอนามัยฟรีถ้วนหน้า ซึ่งเรื่องนี้พรรคเพื่อไทยได้ดำเนินศึกษาพร้อมทำโครงการทดลอง เผยแพร่ในรูปแบบนิทรรศกี เมือเดือนมีนาคม 2565 ที่ผ่านมา . - เสรีทรงผมเครื่องแต่งกายและในสถานศึกษา สิ่งแวดล้อมและบรรยากาศในสถานศึกษาที่เป็นมิตรกับทุกเพศสภาพที่หลากหลาย แก้ไขหลักสูตรการศึกษาให้เป็น non-binary สร้างความรู้ความเข้าใจความหลากหลายทางเพศ . - ต่อต้านความรุนแรงต่อ LGBTQ non-binary ทั้งในบ้านและนอกบ้าน ขจัดการเลือกปฏิบัติในการสมัครงาน . - Sex work is work , sex creator is worker ต้อง decriminalized . - เรือนจำที่ non-binary และปลอดภัยกับทุกเพศ . - การยุติการตั้งครรภ์อย่างปลอดภัย . - สิทธิอนามัยเจริญพันธุ์ คนไร้สัญชาติ , คนไร้รัฐได้รับการคุ้มครอง และยุติความรุนแรง . - สันติภาพโลก พม่า ยูเครน ปาเลสไตน์ make love not war . “ข้อเรียกร้องของประชาชนทุกข้อพรรคเพื่อไทยให้ความสำคัญรับฟังและพร้อมที่จะศึกษาเพื่อพัฒนาเป็นนโยบาย เพื่อสร้างความเท่าเทียมให้กับคนทุกกลุ่มในสังคม” ผู้รับผิดชอบนโยบายด้านอัตลักษณ์และความหลากหลาย กล่าวย้ำ . #BangkokPride2022 #ไพรด์พาเหรด #นฤมิตไพรด์ #Pridemonth2022",
    "postengagement": 17502,
    "postreaction": 16072,
    "postcomment": 209,
    "postshare": 1221,
    "posturl": "https://www.facebook.com/508952780600376/posts/590439192451734"
  },
  {
    "topic": "ความเท่าเทียมทางเพศ",
    "party": "ก้าวไกล",
    "postchannel": "twitter",
    "postdate": "2022-06-14",
    "postmessage": "ผ่านแล้ว!!! สภามีมติรับร่าง #สมรสเท่าเทียม ของพรรคก้าวไกล ด้วยคะแนนเสียง 210-180 เสียง https://t.co/sS1u2DbsS2",
    "postengagement": 17206,
    "postreaction": 4871,
    "postcomment": 0,
    "postshare": 12335,
    "posturl": "http://www.twitter.com/1236249400143298560/status/1537004748880023553"
  },
  {
    "topic": "การชุมนุม",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-02-26",
    "postmessage": "เพราะเยาวชนคือ ... อนาคตของชาติ ที่ผ่านมารัฐบาลได้ให้ความสำคัญกับคนกลุ่มนี้มาโดยตลอด พร้อมรับฟังความเห็นต่างที่เป็นประโยชน์ เพื่อนำไปปรับปรุง แก้ไข หรือทำความเข้าใจซึ่งกันและกัน โดยนายกฯลุงตู่ ยืนยัน ไม่เคยแม้แต่จะคิด ที่จะโกรธลูก ๆ หลาน ๆ ที่ออกมาเคลื่อนไหว เพราะถือเป็นสิทธิ์ ตราบใดที่ยังอยู่ในขอบเขตของกฎหมาย #อภิปรายไม่ไว้วางใจ",
    "postengagement": 5361,
    "postreaction": 4035,
    "postcomment": 921,
    "postshare": 405,
    "posturl": "https://www.facebook.com/493026767870664/posts/824396724733665"
  },
  {
    "topic": "การชุมนุม",
    "party": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2020-10-25",
    "postmessage": "สิริพงศ์ ชี้ทางออกรัฐบาล เปิดโต๊ะเจรจา เร่งแก้รัฐธรรมนูญ และไม่ปิดกั้นสื่อ . ในวันแรกของการเปิดรัฐสภาสมัยวิสามัญหาทางออกประเทศ เพื่ออภิปรายทั่วไปโดยไม่ลงมติ สิริพงศ์ อังคสกุลเกียรติ ส.ส.ศรีสะเกษ พรรคภูมิใจไทย ได้แนะวิธีหาทางออกของความขัดแย้งให้กับรัฐบาล โดยรัฐบาลต้องเปิดโต๊ะเจรจากับผู้ชุมนุมโดยด่วน และต้องไม่ใช้ความรุนแรงกับผู้ชุมนุม จากนั้นเดินหน้าแก้รัฐธรรมนูญ (ไม่แก้หมวด 1 และ หมวด 2 ที่เกี่ยวข้องกับพระมหากษัตริย์) เพื่อให้ได้รัฐธรรมนูญฉบับประชาชนโดยเร็วที่สุด . ทั้งนี้รัฐบาลต้องไม่ปิดกั้นสื่อ ปล่อยให้สื่อมีอิสรภาพในการทำหน้าที่อย่างเต็มที่ด้วย สิริพงศ์ อังคสกุลเกียรติ ส.ส.ศรีสะเกษ พรรคภูมิใจไทย อภิปราย ณ วันที่ 26 ตุลาคม 2563 #สิริพงศ์ #อภิปราย #พรรคภูมิใจไทย #คนภูมิใจไทย",
    "postengagement": 1829,
    "postreaction": 1237,
    "postcomment": 257,
    "postshare": 335,
    "posturl": "https://www.facebook.com/182657125936067/posts/732692147599226"
  },
  {
    "topic": "การชุมนุม",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2020-09-24",
    "postmessage": "“ราเมศ”สอน “รุ้ง” ให้กลับไปถามพ่อกับแม่ว่า คำที่ใช้ด่า “ชวน”เหมาะหรือไม่ นายราเมศ รัตนะเชวงโฆษกพรรคประชาธิปัตย์ ได้กล่าวถึงกรณีที่นางสาว ปนัสยา สิทธิจิรวัฒนกุล หรือน้องรุ้ง แกนนำผู้ชุมนุมได้กล่าวพาดพิงนายชวน หลีกภัย ประธานรัฐสภาว่า การทำหน้าที่ของนายชวน หลีกภัย ประธานรัฐสภาตลอดระยะเวลาที่ผ่านมาตรงไปตรงมา ยึดข้อบังคับยึดรัฐธรรมนูญมาโดยตลอด ไม่มีแบ่งว่าใครจะเป็นฝ่ายรัฐบาล ใครเป็นฝ่ายค้านหรือเป็นสมาชิกวุฒิสภา เหตุการณ์เมื่อวานนี้การที่มี สมาชิกรัฐสภาได้ใช้สิทธิ์อาศัยข้อบังคับการประชุมรัฐสภา พ.ศ. 2563 ข้อที่ 121 วรรคที่สาม ขอเสนอให้ที่ประชุมรัฐสภาตั้งคณะกรรมาธิการพิจารณาการแก้ไขเพิ่มเติมรัฐธรรมนูญก่อนรับหลักการ เมื่อเป็นเช่นนั้นนายชวน หลีกภัย ในฐานะประธานรัฐสภา ไม่สามารถหลีกเลี่ยงหรือบังคับสมาชิกรัฐสภาได้ แต่เป็นเรื่องของสมาชิกรัฐสภาทุกคนที่จะแสดงสิทธิ์ว่าเห็นด้วยหรือไม่เห็นด้วย สุดท้ายที่ประชุมมีมติให้ตั้งคณะกรรมาธิการวิสามัญก่อนรับหลักการก็เป็นเพราะมติของสมาชิกรัฐสภา ประธานรัฐสภาทำหน้าที่อย่างตรงไปตรงมาตามหลักการตามข้อบังคับและรัฐธรรมนูญทุกประการ ไม่ทราบเรื่องดังกล่าวมาก่อน แม้แต่พรรคประชาธิปัตย์เองก็ไม่ทราบมาก่อนล่วงหน้า และเพิ่งมาทราบในเวลาไม่ถึงชั่วโมง ต่อมานางสาว ปนัสยา สิทธิจิรวัฒนกุล ได้ใช้โซเชียลมีเดียคือ Twitter ทวีตถ้อยคำที่หยาบคาย หากใครได้อ่านก็ไม่สามารถรับได้ และคิดว่าคนที่อ้างว่าเป็นคนรุ่นใหม่แต่กลับใช้ถ้อยคำที่ต่ำเตี้ย หยาบคาย ใช้คำที่มีความหมายถึงอวัยวะเพศของผู้ชายพาดพิงนายชวน และมีการแชร์ข้อความนี้เป็นจำนวนมาก จากการติดตามความเคลื่อนไหวของน้องรุ้งมาโดยตลอดถึงเมื่อวาน นายชวน หลีกภัย ได้แสดงความเป็นห่วงต่อผู้ชุมนุมอยู่เสมอ อีกทั้งยังได้กำชับให้ดูเรื่องความเรียบร้อย เน้นย้ำถึงความปลอดภัยของผู้ชุมนุมและกำชับให้เจ้าหน้าที่ดูแลด้วยมิตรไมตรี ไม่ให้ใช้ความรุนแรง รวมทั้งตัวผมเองยังเดินทักทายผู้ชุมนุมโดยใช้เวลาอยู่หลายชั่วโมง เพราะเราเห็นว่ารัฐสภาคือที่ของราษฎรคนที่ทำหน้าที่สมาชิกรัฐสภาคือตัวแทนของราษฎรประชาชนย่อมมาแสดงความคิดเห็นได้ คำพูดที่นางสาวรุ้งใช้กล่าวพาดพิงนายชวน หลีกภัยในลักษณะเช่นนี้จึงจำต้องขอบอกว่าถ้าไม่มีใครบอกน้องได้ว่าถ้อยคำดังกล่าวมันเตี้ยต่ำ หยาบคายขนาดไหน ขอให้กลับไปถามพ่อกับแม่น้องดูว่าคำพูดเช่นนั้นควรพูดออกมาหรือไม่ ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter: @democratTH Instagram: @Democratparty.th YouTube: พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH",
    "postengagement": 11352,
    "postreaction": 4965,
    "postcomment": 5168,
    "postshare": 1219,
    "posturl": "https://www.facebook.com/296508406790/posts/10157281014091791"
  },
  {
    "topic": "การชุมนุม",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2020-10-15",
    "postmessage": "แถลงการณ์พรรคร่วมฝ่ายค้าน เรื่อง ขอประณามการใช้ความรุนแรงของรัฐบาล และเรียกร้องให้เปิดประชุมรัฐสภาฯสมัยวิสามัญ โดยเร็วที่สุด พรรคร่วมฝ่ายค้าน ขอประณามการกระทำที่เกินกว่าเหตุของรัฐบาลในการสลายการชุมชนของนักเรียน นักศึกษาและประชาชน ที่บริเวณสี่แยกปทุมวัน ทั้งที่กลุ่มผู้ชุมนุมคือลูกหลานที่เป็นอนาคตของชาติ มารวมตัวเพื่อแสดงความคิดเห็นต้องการเห็นบ้านเมืองพัฒนาไปในทางที่ดี และเป็นการแสดงออกตามสิทธิที่รัฐธรรมนูญให้ไว้ การชุมนุมเป็นสิทธิตามรัฐธรรมนูญ แต่รัฐบาลใช้อำนาจ พ.ร.ก.ฉุกเฉิน อยู่เหนือรัฐธรรมนูญที่เป็นกฎหมายสูงสุดแล้วเลือกใช้วีธีการสลายการชุมนุมโดยใช้กำลังปราบปราม เป็นการโหมไฟความชิงชัง และวิกฤติศรัทธาให้เพิ่มมากขึ้น วิธีการดังกล่าวเป็นการกระทำของประเทศที่ปกครองด้วยระบบเผด็จการ ซึ่งจะส่งผลซ้ำเติมเศรษฐกิจของประเทศทุกด้าน ทั้งนี้หากประเทศเกิดความเสียหาย พลเอกประยุทธ์ จันทร์โอชา ในฐานะผู้นำรัฐบาลต้องรับผิดชอบในผลพวงที่เกิดขึ้นในอนาคตอย่างหลีกเลี่ยงไม่ได้ • ขอประณามการใช้ความรุนแรงของรัฐบาล • ขอให้หยุดสร้างเงื่อนไขทุกประการที่จะนำประเทศไปสู่ความหายนะโดยทันที • เร่งเปิดประชุมรัฐสภาฯสมัยวิสามัญ โดยเร็วที่สุด พรรคเพื่อไทย พรรคก้าวไกล พรรคเสรีรวมไทย พรรคประชาชาติ พรรคเพื่อชาติ พรรคพลังปวงชนไทย 16 ตุลาคม 2563 ติดตามข่าวสารพรรคเพื่อไทย https://bit.ly/3lTYsWy #พรรคเพื่อไทย #ผนึกกำลังเพื่อไทย",
    "postengagement": 29845,
    "postreaction": 24479,
    "postcomment": 3203,
    "postshare": 2163,
    "posturl": "https://www.facebook.com/149079361791677/posts/3725089840857260"
  },
  {
    "topic": "การชุมนุม",
    "party": "ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2019-12-13",
    "postmessage": "[ #ไม่ถอยไม่ทน ประชาชนออกมาแสดงออกเนืองแน่นสกายวอล์คหลายพันคน!!! ธนาธรลั่นไม่ทนไม่ถอยให้กับเผด็จการอีกต่อไป “วันนี้แค่ชิมลาง” ปิยบุตรชี้นี่คือการต่อสู้เพื่ออนาคตของคนไทยทุกคน-ระบุปัญหาประเทศแก้ไม่ได้ถ้ารัฐบาลนี้ยังอยู่ ] . แม้ว่าในวันนี้ การเดินทางนั้นค่อนข้างยากลำบาก เนื่องจากรถไฟฟ้าบีทีเอสประกาศว่าขัดข้อง ส่งผลกระทบต่อการเดินทางของพี่น้องประชนในวงกว้างเป็นเวลากว่าครึ่งวันจนถึงเวลาเริ่มกิจกรรม แต่ประชาชนจำนวนมาก ก็ยังสามารถเดินทางมาร่วมกิจกรรม \"ส่งเสียงประชาชน\" แสดงพลังต่อต้านรัฐบาลสืบทอดอำนาจ โดยต่างทยอยเข้าร่วมเขียนข้อความแสดงความคิดเห็นบนกระดาษโพสต์อิท ก่อนจะติดลงบนป้ายไวนิลที่เตรียมไว้ เพื่อที่กิจกรรมในช่วงท้าย แกนนำพรรคอนาคตใหม่ ซึ่งนำโดย ธนาธร จึงรุ่งเรืองกิจ หัวหน้าพรรค ปิยบุตร แสงกนกกุล เลขาธิการ พรรณิการ์ วานิช โฆษกพรรค พร้อมทั้ง ส.ส. และทีมงานพรรคอนาคตใหม่ จะช่วยกันอ่านข้อความดังกล่าว เป็นการส่งเสียงไปถึงรัฐบาล . เวลา 17.00 น. ธนาธร เดินทางโดยเรือด่วนคลองแสนแสบ หลังเสร็จกิจกรรมร่วมกับ 7 พรรคร่วมฝ่ายค้าน จากท่าเรือยมราช มาลงที่ท่าเรือสะพานหัวช้าง ซึ่งตลอดทางมีสื่อมวลชนร่วมเกาะติดบรรยากาศ ขณะที่ประชาชนที่โดยสารมาบนเรือต่างขอถ่ายรูป และให้กำลังใจธนาธร จากนั้น เมื่อขึ้นเรือที่ท่าเรือสะพานหัวช้างแล้ว เดินเท้าต่อมาที่บริเวณสกายวอล์ค ท่ามกลางประชาชนที่มารอต้อนรับเนืองแน่น และเพิ่มจำนวนมากขึ้นเรื่อยๆ จนล้นสกายวอล์คทุกทิศทาง ไม่ว่าจะเป็นทางด้านสนามกีฬาแห่งชาติ เอ็มบีเค สยาม และล้นลงไปอยู่บริเวณลานด้านหน้าหอศิลปวัฒนธรรมแห่งกรุงเทพมหานคร . ธนาธรกล่าวว่า กิจกรรมส่งเสียงประชาชนวันนี้ ไม่ได้มีแต่ที่กรุงเทพฯ เท่านั้น แต่ยังมีการเคลื่อนไหวของพี่น้องประชาชนในอีกหลายจังหวัดทั่วประเทศ เราต้องการส่งเสียงถึงผู้มีอำนาจ เป็นการแสดงตน แสดงพลังว่า เราจะไม่ทน ไม่ถอยให้กับระบอบเผด็จการอีกแล้ว ที่ผ่านมาเขาทำให้เรากลัว ใครลุกขึ้นสู้ก็ถูกจับยับคดีใส่ ถูกเรียกไปปรับทัศนคติ นี่คือการเมืองของเขา แต่เขาไม่มีทางชนะความหวังของพี่น้องประชาชนได้ อย่างตอนนี้ ถ้าไม่ให้ลงถนน ก็ไม่รู้จะทำอย่างไรแล้ว เพราะประชาชนที่มาร่วมแสดงตนมีเยอะมาก และเดือนหน้า เราจะได้ลงถนนกันแน่ๆ ให้ซ้อมวิ่งกันไว้ได้แล้ว เพราะการจัดกิจกรรมในวันนี้เป็นแค่การ “ชิมลาง” เท่านั้น . \"นอกจากพวกเขาจะทำให้เรากลัวแล้ว ยังทำให้พ่อแม่พี่น้องประชาชนเกลียดชังกันเอง เพราะยิ่งเมื่อเราเกลียดกันเอง ก็จะเป็นข้ออ้างให้เขาทำรัฐประหาร วันนี้ เขากล่าวหาว่าเราชังชาติ แต่ที่เรามาที่นี่ เราไม่ได้ชังชาติ แต่ชาติคือประชาชน เรารักประชาชน วันนี้ ไม่ต้องพูดกันเยอะ ขอให้ส่งเสียงพร้อมกันว่า ประชาธิปไตยจงเจริญ เผด็จการออกไป\" ธนาธรกล่าว ขณะที่ประชาชนที่มาร่วมกิจกรรมต่างส่งเสียงรับพร้อมกัน \"ประชาธิปไตยจงเจริญ เผด็จการออกไป\" ดังลั่น . ปิยบุตรกล่าวว่าการปกครองรัฐบาลชุดนี้ การปกครองของระบอบ คสช. เป็นการปกครองที่ไม่เห็นหัวประชาชน ไม่เคารพรัฐธรรมนูญ มีข้อยกเว้นให้ตัวเองได้เสมอ ประเทศไทยมีต้นทุนมหาศาล มีทรัพยากร มีโอกาสจำนวนมาก แต่เราต้องใช้จ่ายสิ่งเหล่านี้ไปเพียงเพื่อให้คณะนายทหารชุดนี้ได้ครองอำนาจต่อไปเรื่อยๆ ซึ่งเราจะไม่ยอม เพราะตั้งแต่เขายึดอำนาจอยู่มา 5 ปี อยู่แล้วก็อยากอยู่ต่อ จึงลงทุนเขียนรัฐธรรมนูญที่เอื้อประโยชน์ตัวเองให้ได้สืบทอดอำนาจ เอา ส.ว. มาร่วมโหวตให้ ออกแบบรัฐธรรมนูญให้ได้เป็นรัฐบาลเสียงปริ่มน้ำ แก้ปัญหาปากท้องก็ไม่ได้ ระบบรัฐสภาพังพินาศ เพราะมีทั้งซื้องูเห่า แจกกล้วย โหวตแพ้แล้วก็ไม่รู้จักแพ้ ยอมทำทุกอย่างเพื่อให้นายทหารคณะนี้อยู่ในอำนาจเรื่อยๆ ถ้าวันนี้เราไม่ลุกขึ้นมาแสดงออก ว่ามีประชาชนคนไทยจำนวนมากที่เป็นคนรักชาติ และเราไม่ปรารถนาให้คณะผู้ปกครองชุดนี้ได้อยู่ต่อไป . \"วันนี้คือจุดเริ่มต้นของการแสดงพลัง แสดงออกให้พวกเขารู้ว่า ประชาชนเป็นผู้ทรงอำนาจสูงสุดในประเทศนี้ เห็นหัวประชาชนบ้าง เรามารวมกันวันนี้ นี่คือการต่อสู้เพื่ออนาคตของคนไทยทุกคน ปัญหาทุกอย่างของประเทศนี้ ไม่มีทางแก้ได้ถ้ารัฐธรรมนูญชุดนี้ยังอยู่ ไม่มีทางแก้ไขได้ถ้ารัฐบาลชุดนี้ยังอยู่\" ปิยบุตร กล่าว จากนั้นได้ชวนผู้ร่วมกิจกรรมตะโกนคำว่า \"เห็นหัวประชาชน\" . จากนั้นแกนนำพรรคอนาคตใหม่ และ ส.ส.ของพรรคได้แยกย้ายพบปะกับประชาชนและถ่ายรูปกันตามจุดต่างๆ ทั้งนี้ ภายหลังการปราศรัย ประชาชนต่างตะโกนดังลั่นพร้อมทั้งแสดงสัญลักษณ์ \"ชู 3 นิ้ว\" ต่อต้านระบอบเผด็จการ และนอกจากนี้ประชาชนยังร่วมเปิดไฟฉายโทรศัพท์มือถือพร้อมกับตะโกน \"เผด็จการออกไป\" ดังลั่น โดยแม้กิจกรรมจะใช้ระยะเวลาสั้นๆ เพียง 1 ชั่วโมง โดยเลิกไปในเวลา 18.00 น. หลังเคารพธงชาติเสร็จ อย่างไรก็ตาม ยังมีประชาชนที่มาร่วมกิจกรรมยังอยู่พบปะพูดคุยกันอีกเป็นจำนวนมาก . โดยจนถึงตอนนี้ (22.00 น.) มีผู้ทวีตถึงแฮชแท็ก #ไม่ถอยไม่ทน สูงถึง 1.43 ล้านครั้ง และกลายเป็นแฮชแท็กอันดับ 1 ในเมืองไทยอยู่หลายชั่วโมง . #กลัวที่ไหน #ไม่ถอยไม่ทน",
    "postengagement": 38190,
    "postreaction": 34336,
    "postcomment": 1120,
    "postshare": 2734,
    "posturl": "https://www.facebook.com/1620426454699609/posts/2647128538696057"
  },
  {
    "topic": "การชุมนุม",
    "party": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2020-09-16",
    "postmessage": "6 พรรคร่วมฝ่ายค้าน ออกแถลงการณ์ 3 ข้อ ร่วมแก้ไขรัฐธรรมนูญ . 17 กันยายน 2563 ณ รัฐสภา พรรคเสรีรวมไทย และพรรคร่วมฝ่ายค้าน ร่วมออกแถลงการณ์ เรื่องสิทธิเสรีภาพการแสดงออกของประชาชนและการแก้ไขรัฐธรรมนูญเพื่อหาทางออกให้กับประเทศ โดยออกแถลงการ 3 ข้อ ได้แก่ 1.เรียกร้องการแก้รัฐธรรมนูญ 2.เรียกร้องความปลอดภัยในการแสดงความคิดเห็นของประชาชน 3.เรียกร้องให้ ส.ว. เห็นแก่ประโยชน์ส่วนรวม มากกว่าส่วนตนของจริงมันให้หนักหนัก . ด้านพลตำรวจเอกเสรีพิศุทธิ์ เตมียเวส หัวหน้าพรรคเสรีรวมไทย กล่าวว่า นายกฯ ไม่มีหัวใจที่เป็นประชาธิปไตย โกงเลือกตั้งเข้ามา และเชื่อว่านายกฯ ไม่ยอมรับฟังข้อเรียกร้องของนักศึกษา ประชาชนในการชุมนุม และที่ผ่านมานายกฯ บริหารงานล้มเหลว งบฯไม่เพียงพอในการจ่ายเบี้ยยังชีพผู้สูงอายุ อนาคตอาจไม่มีเงินเดือนจ่ายให้ข้าราชการ ดังนั้น ขอให้นายกรัฐมนตรี ยอมรับสิ่งต่างๆที่เกิดขึ้นและยอมรับความผิดพลาด เพราะทุกวันนี้นายกฯยังไม่ยอมรับความคิดและบอกให้ประชาชนสนับสนุนการทำงาน ผู้นำที่ดีจะต้องมีทั้งความซื่อสัตย์ กล้าหาญ เสียสละ แต่พลเอกประยุทธ์ ไม่มีตรงนี้ และหากยังดึงดันไม่ยอมรับสภาพเช่นนี้ต่อไป ให้ระวังจะไม่มีแผ่นดินอยู่",
    "postengagement": 6343,
    "postreaction": 4666,
    "postcomment": 232,
    "postshare": 1445,
    "posturl": "https://www.facebook.com/161052211196800/posts/670461106922572"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "พลังประชารัฐ",
    "postchannel": "facebook",
    "postdate": "2020-10-17",
    "postmessage": "พรรคพลังประชารัฐ ขอปกป้อง เทิดทูนชาติ ศาสน์ กษัตริย์ ตราบนิรันดร์",
    "postengagement": 7889,
    "postreaction": 6769,
    "postcomment": 840,
    "postshare": 280,
    "posturl": "https://www.facebook.com/493026767870664/posts/1007762133063789"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "ภูมิใจไทย",
    "postchannel": "facebook",
    "postdate": "2021-11-05",
    "postmessage": "อนุทินย้ำจุดยืน พรรคภูมิใจไทย ไม่แก้ไขมาตรา 112 . นายอนุทิน ชาญวีรกูล รองนายกรัฐมนตรี และรัฐมนตรีว่าการกระทรวงสาธารณสุข ในฐานะหัวหน้าพรรคภูมิใจไทย (ภท.) กล่าวถึงจุดยืนของพรรคเรื่องการแก้ไขมาตรา 112 ว่า ตนพูดมาตั้งแต่ก่อตั้งพรรค ว่ามาตรา 112 จะแตะไม่ได้ และพรรคภูมิใจไทยมีจุดยืนชัดเจน ว่าจะไม่แก้ไขในมาตรานี้อย่างเด็ดขาด #อนุทิน #สาธารณสุข #มาตรา112 #คนภูมิใจไทย",
    "postengagement": 4429,
    "postreaction": 4086,
    "postcomment": 265,
    "postshare": 78,
    "posturl": "https://www.facebook.com/182657125936067/posts/965591707642601"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "ประชาธิปัตย์",
    "postchannel": "facebook",
    "postdate": "2020-10-22",
    "postmessage": "“ชวน” นำข้าราชการสภา ทำจิตอาสาบำเพ็ญประโยชน์ ถวายเป็นพระราชกุศลเนื่องในวันคล้ายวันสวรรคต ร.9 (22 ต.ค. 63) นายชวน หลีกภัย ประธานสภาผู้แทนราษฎร เป็นประธานเปิดโครงการสภาผู้แทนราษฎรรวมใจบำเพ็ญประโยชน์ถวายเป็นพระราชกุศล เนื่องในโอกาสวันคล้ายวันสวรรคต พระบาทสมเด็จพระบรมชนกาธิเบศรมหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร (รัชกาลที่ 9) ณบริเวณถนนทหาร (ด้านข้างวัดแก้วฟ้าจุฬามณี) และบริเวณถนนสามเสน (ด้านหน้าอาคารรัฐสภา) โดยมีนายศุภชัย โพธิ์สุ รองประธานสภาผู้แทนราษฎร คนที่สอง นางพรพิศ เพชรเจริญเลขาธิการสภาผู้แทนราษฎร สมาชิกสภาผู้แทนราษฎร คณะจิตอาสา และบุคลากรสำนักงานเลขาธิการสภาผู้แทนราษฎร เข้าร่วมโครงการ ด้าน ประธานสภาผู้แทนราษฎร กล่าวน้อมรำลึกในพระมหากรุณาธิคุณ เนื่องในวันคล้ายวันสวรรคต พระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร ความว่า ตลอดระยะเวลา 70 ปี แห่งการครองราชย์ นับแต่พุทธศักราช2489 ตราบจนกระทั่งเสด็จสวรรคตเมื่อวันที่ 13 ตุลาคม พ.ศ. 2559 ได้ทรงดำรงมั่นอยู่ในทศพิธราชธรรมและทรงยึดมั่นในพระปฐมบรมราชโองการ \"เราจะครองแผ่นดินโดยธรรมเพื่อประโยชน์สุขแห่งมหาชนชาวสยาม\" อีกทั้ง ทรงพระวิริยะอุตสาหะปฏิบัติบำเพ็ญ พระราชกรณียกิจน้อยใหญ่นานัปการ ตลอดจนทุกคราที่ชาติบ้านเมืองประสบความทุกข์ยากจากวิกฤตภัยต่างๆ พระองค์ได้ทรงพระราชทานพระบรมราชนุเคราะห์ และพระราชทานแนวทาง เพื่อบรรเทาหรือขจัดปัญหาให้ผ่านพ้นไปด้วยดี แม้คราวใดที่เกิดความขัดแย้งกันในกลุ่มคน จนไม่สามารถหาข้อยุติได้ พระองค์ทรงไม่เคยละเลยที่จะเข้าไปคลี่คลายและยุติปัญหาเหล่านั้น เพื่อนำความสงบสุขมาสู่ประเทศและอาณาประชาราษฎร์โครงการอันเนื่องมาจากพระราชดำริกว่า 4,000 โครงการ ล้วนเป็นการพัฒนาประเทศอันก่อประโยชน์ต่อประชาชนโดยตรง ทุกโครงการมีความคุ้มค่า ยั่งยืน แม้ในบางระยะเวลาสถานการณ์บ้านเมืองจะไม่ราบรื่น ขาดความต่อเนื่องแต่โครงการ อันเนื่องมาจากพระราชดำริต่าง ๆ ก็ยังสามารถดำเนินต่อไปได้โดยที่การพัฒนามิได้สะดุดหยุดลง เมื่อเกิดวิกฤตทางการเมืองและเศรษฐกิจขึ้นในประเทศเพื่อนบ้านอย่างรุนแรงจนคาดหมายกันว่าประเทศไทยจะล้มไปตามทฤษฎีโดมิโน แต่ประเทศสามารถผ่านพ้นวิกฤตร้ายแรงนั้นมาได้ ก็ด้วยพลังความเคารพรักศรัทธาที่ประชาชนได้ร่วมกันปกป้องประเทศโดยยึดตามแนวทางแห่งพระบรมราโชวาทในเรื่องความตระหนักและความตั้งใจปฏิบัติหน้าที่ของตนให้ดีที่สุด ด้วยสำนึกในพระมหากรุณาธิคุณเป็นล้นพ้นอันหาที่สุดมิได้ สภาผู้แทนราษฎรจึงได้จัดโครงการดังกล่าวขึ้นเพื่อถวายเป็นพระราชกุศลเนื่องในโอกาสวันคล้ายวันสวรรคต รัชกาลที่ 9 จากนั้น ประธานสภาผู้แทนราษฎร รองประธานสภาผู้แทนราษฎร คนที่สอง สมาชิกสภาผู้แทนราษฎร บุคลากรของสำนักงานเลขาธิการสภาผู้แทนราษฎร เจ้าหน้าที่สำนักงานเขตดุสิต และคณะจิตอาสาได้ร่วมกันบำเพ็ญประโยชน์ พัฒนาทำความสะอาดพื้นที่และปรับภูมิทัศน์โดยรอบอาคารรัฐสภา โดยมีกิจกรรมทำความสะอาดพื้นทางเดินบริเวณท่าเรือเกียกกาย ตัดแต่งกิ่งไม้เก็บกวาดขยะ เศษใบไม้ และจัดเก็บผักตบชวา ติดตามข่าวสารเพิ่มเติมได้ที่ Twitter: @democratTH Instagram: @Democratparty.th YouTube: พรรคประชาธิปัตย์ Democrat Party, Thailand #ทำได้ไวทำได้จริง #พรรคประชาธิปัตย์ #DemocratPartyTH",
    "postengagement": 10030,
    "postreaction": 9305,
    "postcomment": 182,
    "postshare": 543,
    "posturl": "https://www.facebook.com/296508406790/posts/10157339216161791"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "เพื่อไทย",
    "postchannel": "facebook",
    "postdate": "2021-10-30",
    "postmessage": "ปัญหาการใช้กฎหมายอาญาดำเนินคดีเพื่อจำกัดความคิดเห็นทางการเมืองที่แตกต่างอย่างล้นเกิน ไม่ว่าจะเป็นประมวลกฎหมายอาญามาตรา 112 มาตรา 116 พระราชบัญญัติการกระทำอันเป็นความผิดเกี่ยวกับคอมพิวเตอร์ฯ หรือความผิดฐานฝ่าฝืนประกาศที่ออกตามพระราชกำหนดการบริหารราชการในสถานการณ์ฉุกเฉิน สร้างผลกระทบให้ประชาชนเสียหายจากกระบวนการยุติธรรมที่ประชาชนสงสัยว่า ไม่เป็นไปตามหลักนิติรัฐนิติธรรม และเจ้าหน้าที่ที่เกี่ยวข้องได้ปฏิบัติหน้าที่ในส่วนที่เกี่ยวข้องกับคดีดังกล่าวโดยมิชอบด้วยหลักกฎหมายและสิทธิมนุษยชน ซึ่งทำให้ประชาชนขาดความเชื่อมั่นในหลักกฎหมายและหลักความยุติธรรมของประเทศ . ตามที่ภาคประชาชนได้เรียกร้องและเสนอร่างแก้ไขข้อกฎหมายที่เกี่ยวข้องกับการกระทำดังกล่าว พรรคเพื่อไทยในฐานะพรรคที่มีเสียงสมาชิกมากที่สุดในสภาผู้แทนราษฎร พร้อมนำข้อเสนอดังกล่าวเข้าสู่วาระการประชุมรัฐสภา เพื่อตรวจสอบระบบการทำงานของบุคคลในกระบวนการยุติธรรม ตั้งแต่ เจ้าหน้าที่ตำรวจ อัยการ ศาล และราชทัณฑ์ ว่าได้ปฏิบัติหน้าที่หรือใช้ดุลยพินิจไม่เป็นไปตามเจตนารมณ์ของกฎหมายหรือไม่ และตรวจสอบการสั่งการโดยรัฐบาล รวมถึงการแก้ไขกฎหมาย ระเบียบปฏิบัติที่ไม่เป็นธรรม เพื่อให้นักโทษทางความคิดได้รับการปล่อยตัว และไม่ให้เกิดนักโทษทางความคิดเพิ่มขึ้นอีก ซึ่งจะเป็นจุดเริ่มต้นของการฟื้นฟูความเชื่อมั่นในระบบยุติธรรมของประเทศไทย . ชัยเกษม นิติสิริ ประธานคณะกรรมการยุทธศาสตร์และทิศทางการเมืองพรรคเพื่อไทย 31 ตุลาคม 2564 #ม็อบ31ตุลา64",
    "postengagement": 14349,
    "postreaction": 10994,
    "postcomment": 868,
    "postshare": 2487,
    "posturl": "https://www.facebook.com/149079361791677/posts/4854486987917534/"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "ก้าวไกล",
    "postchannel": "facebook",
    "postdate": "2021-08-20",
    "postmessage": "[ ทำไมงบสถาบันพระมหากษัตริย์ถึงต้องปฏิรูป? ] . อย่างที่พรรคก้าวไกลได้อภิปรายไปแล้วในการพิจารณา พ.ร.บ. งบประมาณ ปี 65 วาระที่ 1 ว่ามีงบที่เกี่ยวข้องกับสถาบันกษัตริย์ทั้งทางตรงและทางอ้อมกระจัดกระจายอยู่รวมๆ อย่างน้อย 33,712 ล้านบาท จากงบประมาณแผ่นดินทั้งหมด 3.1 ล้านล้านบาท . ------ . ***งบส่วนราชการในพระองค์เพิ่มขึ้น หลังออก พ.ร.บ.ระเบียบบริหารราชการในพระองค์ พ.ศ. 2560*** . ในเงินทั้งหมดก้อนนี้ ส่วนที่เกี่ยวข้องกับสถาบันพระมหากษัตริย์ทั้งหมดคือ งบประมาณของ “ส่วนราชการในพระองค์” 8,761 ล้านบาท ซึ่งงบประมาณส่วนนี้เพิ่มสูงขึ้นอย่างต่อเนื่อง ภายหลังจากปี 2560 ที่รัฐบาล คสช. ออก พระราชบัญญัติระเบียบบริหารราชการในพระองค์ เพื่อรวมหน่วยงานต่างๆ ที่เกี่ยวข้องกับสถาบันพระมหากษัตริย์ เข้าไว้ด้วยกัน . โดยปี 60 ที่งบสถาบันกษัตริย์ทั้ง 5 ส่วน ยังคงรับงบประมาณแยกกัน เรามีค่าใช้จ่ายในส่วนนี้รวม 5,674 ล้านบาท แต่หลังกฎหมายฉบับใหม่ออกมาแล้ว ภายในปีเดียว สถาบันพระมหากษัตริย์กลับได้รับงบประมาณรวมเพิ่มขึ้นเป็น 6,391 ล้านบาท แถมยังมีงบคาอยู่ที่หน่วยงานถวายความปลอดภัยเดิมอีก ไม่ว่าจะเป็นกระทรวงกลาโหม และสำนักงานตำรวจแห่งชาติ อีก 3,055 ล้านบาท ทำให้รวมเบ็ดเสร็จแล้วกว่า 9,446 ล้านบาท และงบประมาณส่วนนี้เพิ่มขึ้นทุกปี จนในปีนี้ สภากำลังจะผ่านงบประมาณส่วนนี้รวมกันถึง 12,176 ล้านบาท . ------ . ***งบประมาณที่สถาบันพระมหากษัตริย์ได้ สูงเกินไปหรือไม่?*** . ทำให้เราเห็นได้ว่า 6 ปีที่ผ่านมา งบประมาณของส่วนราชการในพระองค์และงบถวายความปลอดภัย เพิ่มขึ้นกว่า 114% เร็วกว่างบประมาณแผ่นดิน เพิ่มขึ้นเพียง 13% เท่านั้น . นี่ทำให้เราตั้งคำถามว่า งบประมาณแผ่นดินที่เราจัดสรรให้สถาบันพระมหากษัตริย์ สูงเกินไปหรือไม่? . ยกตัวอย่างประเทศที่มีกษัตริย์ใต้รัฐธรรมนูญจำนวนหนึ่ง เราจะเห็นว่ากษัตริย์ไทยได้รับงบประมาณมากที่สุด มากกว่ากษัตริย์อังกฤษ ที่ได้งบประมาณ 3,565 ล้านบาท 1 เท่าตัว และมากกว่าสวีเดน ที่สถาบันกษัตริย์ได้งบประมาณ 266 ล้านบาท เกือบ 33 เท่า . นอกจากนี้ ถ้าเราเปรียบเทียบกับส่วนราชการอื่นๆ ที่มีสถานะเทียบเท่ากัน ส่วนราชการในพระองค์ได้รับงบประมาณมากกว่ากระทรวงถึง 7 กระทรวง ได้แก่ กระทรวงการต่างประเทศ, กระทรวงวัฒนธรรม, กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม, กระทรวงพาณิชย์, กระทรวงการท่องเที่ยวและกีฬา, กระทรวงอุตสาหกรรม, และกระทรวงพลังงาน . อาจมีบางท่านแย้งว่าที่ส่วนราชการในพระองค์ต้องได้รับจัดสรรงบประมาณมากขนาดนี้ นั่นเพราะต้องดูแลข้าราชบริพาร ซึ่งจากการชี้แจงชั้นกรรมาธิการเราได้รับทราบตัวเลขว่ามีข้าราชบริพารประมาณ 14,275 คน . ซึ่งถ้าเทียบจำนวนบุคลากรจำนวนนี้ มากกว่ากระทรวงอื่นถึง 14 กระทรวง และมากกว่ากระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์ที่มีหน้าที่ดูแลเด็ก คนชรา ผู้พิการ และคนเปราะบางกลุ่มต่างๆ ทั้งประเทศไทยถึงเกือบ 5 เท่า . เราไม่ได้กำลังบอกให้เพิ่มจำนวนบุคลากรให้กับหน่วยงานรัฐอื่น เพราะปัจจุบันค่าใช้จ่ายบุคลากรภาครัฐก็เป็นจำนวนที่กดดันภาระงบประมาณในทุกๆปีอยู่แล้ว แต่เรากำลังตั้งคำถามถึงจำนวนบุคลากรที่มากเกินความจำเป็น . ------ . ***งบสถาบันที่ไม่มีรายละเอียดเป็นสิ่งที่เพิ่งเกิดขึ้นหลังปี 2560*** . นอกจากจำนวนเงินที่สูงเกินไปแล้ว ปัญหาใหญ่ที่สำคัญที่สุดของการพิจารณางบสถาบันกษัตริย์ คือความโปร่งใส . การพิจารณางบประมาณแผ่นดินของสภาผู้แทนราษฎร หน่วยงานต่างๆ จะต้องชี้แจงรายละเอียดการใช้งบประมาณและตัวชี้วัด ว่าเงินทุกบาท ที่ได้จากภาษีประชาชน จะถูกนำไปใช้อย่างไร ต้องโปร่งใส ตรวจสอบได้ . ที่น่าแปลกใจ คือการพิจารณางบส่วนราชการในพระองค์ ซึ่งมีงบประมาณมากกว่ากระทรวงดิจิทัล, กระทรวงพาณิชย์, และกระทรวงอุตสาหกรรม กลับมีเอกสารมาให้สภาพิจารณาเพียง 7 หน้า ไม่บอกรายละเอียดการใช้งบประมาณ และไม่มีผู้แทนหน่วยงานมาชี้แจงต่อสภาเหมือนหน่วยงานอื่น . การไม่มีรายละเอียดทำให้เกิดข้อสงสัย หน่วยรับงบประมาณปกติ เมื่อใช้จ่ายงบประมาณไม่เต็มวงเงิน ต้องส่งเงินคืนคลัง แต่ส่วนราชการในพระองค์ กลับเบิกจ่ายงบเต็มจำนวน 100% และบางปีก็มีการเบิกจ่ายเกินด้วย เช่น ในปี 61 เบิกจ่ายเกินมา 52% เป็นเงิน 2,195 ล้านบาท และ ในปี 63 เบิกจ่ายเกินมา 28% คิดเป็นเงิน 2,129 ล้านบาท โดยที่เราไม่ทราบรายละเอียด เพราะไม่มีการชี้แจงใดๆ ถึงเหตุผลและความจำเป็นดังกล่าว . อาจมีข้อโต้แย้งว่าการเบิกจ่ายงบเต็มจำนวน ส่วนที่ใช้ไม่หมดก็เก็บเป็นเงินสะสม เป็นลักษณะเดียวกับองค์การมหาชน แต่อย่าลืมว่าองค์การมหามีรายงานงบการเงินอย่างโปร่งใสทุกปี ว่างบใช้อย่างไร มีเงินสะสมเหลือเท่าไหร่ แต่ส่วนราชการในพระองค์เราไม่เห็นเอกสารเหล่านั้น . เราต้องขอย้ำว่าการไม่มีรายละเอียดงบส่วนราชการในพระองค์ ไม่ใช่เรื่องปกติ! แต่เป็นผลจาก พ.ร.บ. ระเบียบบริหารราชการในพระองค์ พ.ศ. 2560 โดยก่อนปี 2560 ในเอกสารงบประมาณ ถึงแม้จะไม่ละเอียด แต่เรายังพอสามารถเห็นได้ว่างบประมาณส่วนราชการในพระองค์ถูกใช้ไปที่หน่วยงานใดเป็นเงินเท่าไหร่ และมีรายการใช้จ่ายอะไรบ้าง . ------ . ***บทสรุป: ความไม่โปร่งใสไม่ได้มีแค่นี้ เราต้องปฏิรูปงบประมาณที่เกี่ยวข้องกับสถาบันพระมหากษัตริย์ในทุกมิติ*** . นอกจากความไม่โปร่งใสในงบประมาณที่เราได้กล่าวไปแล้ว ในความเป็นจริงยังมีงบโดยตรงของสถาบันกษัตริย์ที่ซุกซ่อน และกระจัดกระจายอยู่ในหน่วยราชการอื่นอีก เช่น * งบซื้อเครื่องบินและเฮลิคอปเตอร์พระที่นั่ง วงเงินรวม 12,000 ล้านบาท (ตั้งแต่ปี 61-65) และค่าซ่อมบำรุงและเชื้อเพลิงอีกปีละ 1,500 ล้านบาท ที่ตั้งในสำนักนายกรัฐมนตรี * งบที่เขียนว่า “โครงการสนับสนุนกิจกรรมพิเศษหลวง 1,500 ล้านบาท” จริงๆ ซึ่งใช้ในการปรับปรุงวังที่ประทับต่างๆ ที่ตั้งอยู่ในกระทรวงมหาดไทย . ยังไม่นับงบประมาณของโครงการที่มีนามสกุลห้อยท้าย \"ในพระราชดำริ\" \"เฉลิมพระเกียรติ\" อื่นๆ ที่ตั้งกระจัดกระจายอยู่ในหลายกระทรวง โดยไม่มีการตรวจสอบ ไม่มีการตั้งคำถาม และไม่มีการปรับงบประมาณ ทั้งที่บางโครงการตั้งขึ้นมาติดต่อกันกว่า 30 ปี . ทั้งหมดที่พูดมา ทำให้เราเห็นความจำเป็นของการปฏิรูปงบประมาณสถาบันพระมหากษัตริย์ เราเรียกร้องการลดงบประมาณให้มีความเหมาะสม สอดคล้องกับสถานการณ์ประเทศ โดยเฉพาะช่วงที่ประชาชนกำลังยากลำบากจากวิกฤตครั้งใหญ่ที่สุดในชั่วชีวิตของพวกเรา . และในการปฏิรูปเราเลี่ยงไม่ได้ที่ต้องปรับปรุงแก้ไข พ.ร.บ.ระเบียบบริหารราชการในพระองค์ พ.ศ. 2560 ที่เกิดในยุค คสช. ที่ทำให้งบสถาบันพระมหากษัตริย์ไม่โปร่งใส ตรวจสอบไม่ได้ และไม่ถูกต้องตามหลักการของระบอบประชาธิปไตย ที่องค์พระมหากษัตริย์ อยู่ใต้รัฐธรรมนูญอย่างแท้จริง... . #ก้าวไกล #ประชุมสภา #งบประมาณปี65 #งบสถาบันกษัตริย์",
    "postengagement": 77964,
    "postreaction": 54944,
    "postcomment": 2774,
    "postshare": 20246,
    "posturl": "https://www.facebook.com/100106918288004/posts/380392850259408"
  },
  {
    "topic": "สถาบันพระมหากษัตริย์",
    "party": "เสรีรวมไทย",
    "postchannel": "facebook",
    "postdate": "2021-11-02",
    "postmessage": "พล.ต.อ.เสรีพิศุทธ์ เตมียเวส หัวหน้าพรรคเสรีรวมไทย แถลงจุดยืน ของพรรคเสรีรวมไทย ต่อ ม.112 #พรรคเสรีรวมไทย #ม112 Cr.VoiceTV",
    "postengagement": 5153,
    "postreaction": 4533,
    "postcomment": 302,
    "postshare": 318,
    "posturl": "https://www.facebook.com/161052211196800/posts/929202551048425/"
  }

]

import React, { useState, useEffect, useRef, SyntheticEvent, BaseSyntheticEvent } from 'react'
import moment from 'moment'
import 'moment/locale/th'
import ScrollableArrow from '../../../utils/scrollable-arrow'


type Props = {}

const TopicPostCollection = ({ topic }: {
  topic: string
}) => {
  const [postItem, setPostItem] = useState<typeof TOPIC_COMMUNICATION_POST>([])
  useEffect(() => {
    setPostItem(TOPIC_COMMUNICATION_POST.filter((data) => data.topic === topic))
  }, [topic])

  const getLogo = (party: string) => {
    switch (party) {
      case "พลังประชารัฐ": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/พลังประชารัฐ.png")] bg-contain bg-center' />
      case "ภูมิใจไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ภูมิใจไทย.png")] bg-contain bg-center' />
      case "ประชาธิปัตย์": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ประชาธิปัตย์.png")] bg-contain bg-center' />
      case "เพื่อไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/เพื่อไทย.png")] bg-contain bg-center' />
      case "ก้าวไกล": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/ก้าวไกล.png")] bg-contain bg-center' />
      case "เสรีรวมไทย": return <div className='w-[30px] h-[30px] bg-[url("/design_assets/party_logo/เสรีรวมไทย.png")] bg-contain bg-center' />
      default:
        break;
    }
  }

  const getPostChanelLogo = (postchannel: string) => {
    switch (postchannel) {
      case "facebook": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path fillRule="evenodd" clipRule="evenodd" d="M7.46972 15C11.5954 15 14.9394 11.6424 14.9394 7.5C14.9394 3.35756 11.5954 0 7.46972 0C3.344 0 0 3.35756 0 7.5C0 11.6424 3.344 15 7.46972 15ZM6.3006 9.23724C6.30084 9.41264 6.30109 9.58805 6.30109 9.76345V11.8485C6.30109 11.9754 6.32478 12.0269 6.46691 12.023C6.97621 12.015 7.48946 12.015 7.99875 12.023C8.14089 12.0269 8.17642 11.9913 8.17642 11.8446C8.1705 10.8131 8.17124 9.78377 8.17198 8.75336C8.17222 8.40973 8.17247 8.06597 8.17247 7.72196C8.17247 7.61428 8.16765 7.56751 8.18847 7.54776C8.2098 7.52753 8.25803 7.53565 8.36592 7.53565C8.66203 7.53169 8.96208 7.53169 9.25818 7.53565C9.34504 7.53565 9.39242 7.51583 9.40032 7.41673C9.4398 6.97275 9.47928 6.53274 9.52665 6.09273C9.5385 5.97778 9.50296 5.95399 9.39242 5.95399C9.11099 5.95994 8.82735 5.95919 8.54481 5.95845C8.4508 5.9582 8.35692 5.95795 8.26328 5.95795C8.25902 5.95795 8.25477 5.958 8.25054 5.95804C8.19587 5.95856 8.14512 5.95905 8.14878 5.87075C8.15207 5.76007 8.15193 5.64939 8.1518 5.539C8.15161 5.38449 8.15141 5.23054 8.16063 5.07793C8.18037 4.74892 8.37777 4.57846 8.7094 4.57846C8.95418 4.5745 9.20291 4.5745 9.45164 4.57846C9.5306 4.57846 9.55429 4.55468 9.55429 4.4754C9.55034 4.03539 9.55034 3.59141 9.55429 3.14744C9.55429 3.07608 9.5306 3.0523 9.45954 3.0523C9.30038 3.05352 9.14122 3.05324 8.98218 3.05296C8.6244 3.05232 8.2672 3.05169 7.9119 3.06816C7.4105 3.09194 6.97621 3.28221 6.67221 3.7024C6.43138 4.03142 6.32083 4.41197 6.31293 4.82027C6.30504 5.15325 6.30504 5.48623 6.31293 5.81921C6.31293 5.93813 6.28925 5.9857 6.15896 5.97778C6.02626 5.97064 5.89214 5.97207 5.7583 5.9735C5.66915 5.97445 5.58013 5.9754 5.49174 5.97381C5.40488 5.97381 5.38119 6.00156 5.38119 6.0848C5.38514 6.52085 5.38514 6.96086 5.38119 7.39691C5.37725 7.48808 5.41278 7.51583 5.49964 7.51187C5.59448 7.51017 5.68861 7.51065 5.78231 7.51114C5.90704 7.51179 6.03102 7.51243 6.15501 7.5079C6.27345 7.50394 6.30504 7.53961 6.30504 7.65854C6.29912 8.18477 6.29986 8.711 6.3006 9.23724Z" fill="#2094FF" />
      </svg>
      case "twitter": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path d="M12.7976 2.20238C11.4286 0.833336 9.58333 0 7.5 0C5.41666 0 3.57143 0.833336 2.20238 2.20238C0.833332 3.57143 0 5.41667 0 7.5C0 11.369 2.97619 14.5833 6.78571 14.9405C7.02381 14.9405 7.2619 15 7.5 15C8.03571 15 8.5119 14.9405 8.98809 14.8214C10.4762 14.5238 11.7857 13.8095 12.7976 12.7976C14.1667 11.4286 15 9.58333 15 7.5C15 5.41667 14.1667 3.57143 12.7976 2.20238ZM12.7976 4.46428C12.6786 4.64285 12.5 4.82143 12.381 5C12.2024 5.17857 12.0238 5.29762 11.8452 5.47619L11.7857 5.53571C11.7857 5.71428 11.7857 5.83333 11.7857 6.0119C11.7857 6.13095 11.7857 6.25 11.7857 6.36905C11.7857 6.54762 11.7262 6.66666 11.7262 6.84523C11.6667 7.14285 11.6071 7.44048 11.4881 7.67857C11.4286 7.85714 11.369 8.03571 11.25 8.21428C11.1309 8.39286 11.0714 8.63095 10.9524 8.80952C10.8333 9.04762 10.6548 9.22619 10.5357 9.46429C10.4167 9.64286 10.2976 9.76191 10.119 9.94048C9.94048 10.1191 9.7619 10.2976 9.58333 10.4167C9.46428 10.4762 9.40476 10.5952 9.28571 10.6548C9.04761 10.8333 8.80952 10.9524 8.57143 11.0714C8.39285 11.131 8.21429 11.25 8.03572 11.3095C7.79762 11.4286 7.5 11.4881 7.20238 11.5476C7.0238 11.6071 6.84524 11.6071 6.66667 11.6071C6.54762 11.6071 6.42857 11.6071 6.25 11.6071C6.13095 11.6071 6.0119 11.6071 5.89285 11.6071C5.83333 11.6071 5.83333 11.6071 5.77381 11.6071C5.65476 11.6071 5.53571 11.6071 5.41666 11.5476C5.23809 11.5476 5 11.4881 4.82142 11.4286C4.58333 11.3691 4.40476 11.3095 4.16667 11.25C3.92857 11.1905 3.75 11.0714 3.57143 11.0119C3.39286 10.8929 3.21428 10.8333 3.03571 10.7143C3.03571 10.7143 3.03571 10.7143 3.09524 10.7143C3.15476 10.7143 3.15476 10.7143 3.21428 10.7143C3.27381 10.7143 3.39286 10.7143 3.45238 10.7143C3.51191 10.7143 3.57142 10.7143 3.63095 10.7143C3.69047 10.7143 3.75 10.7143 3.80952 10.7143C3.92857 10.7143 4.04762 10.7143 4.10714 10.6548C4.46428 10.5952 4.76191 10.5357 5.05952 10.3571C5.29762 10.2381 5.53571 10.1191 5.77381 9.94048C5.83333 9.88096 5.89286 9.88095 5.95238 9.82142C5.71429 9.82142 5.53571 9.7619 5.35714 9.70238C5.17857 9.64286 5 9.52381 4.82142 9.40476C4.64285 9.28571 4.52381 9.10714 4.40476 8.9881C4.28571 8.80952 4.10714 8.51191 4.10714 8.45238C4.28571 8.45238 4.40476 8.5119 4.58333 8.5119C4.7619 8.5119 5 8.45238 5.05952 8.45238C4.88095 8.39286 4.7619 8.33333 4.58333 8.27381C4.40476 8.15476 4.22619 8.03571 4.04762 7.91666C3.86905 7.73809 3.75 7.55953 3.69047 7.38095C3.63095 7.20238 3.57143 7.08333 3.5119 6.90476C3.45238 6.78571 3.45238 6.60714 3.45238 6.4881C3.45238 6.4881 3.45238 6.48809 3.45238 6.42857C3.63095 6.54762 3.86904 6.60715 4.10714 6.66667C4.16666 6.66667 4.28572 6.66667 4.34524 6.66667C4.28572 6.60715 4.22619 6.54762 4.10714 6.4881C3.92857 6.30953 3.74999 6.13095 3.63095 5.89286C3.5119 5.65476 3.45238 5.35714 3.39286 5.05952C3.39286 5 3.39286 4.88095 3.39286 4.82143C3.39286 4.64286 3.45238 4.52381 3.5119 4.34524C3.57143 4.22619 3.63095 4.10715 3.69047 3.9881C3.80952 4.10715 3.86905 4.22619 3.98809 4.28572C4.10714 4.40477 4.22619 4.52381 4.34524 4.64285C4.52381 4.82143 4.70238 4.94047 4.88095 5.05952C5.11905 5.23809 5.41666 5.41666 5.71428 5.53571C5.89285 5.59524 6.07143 5.71429 6.25 5.77381C6.54762 5.89286 6.84524 5.95238 7.14286 6.0119C7.32143 6.0119 7.44048 6.07143 7.61905 6.07143C7.67857 6.07143 7.73809 6.07143 7.85714 6.07143C7.91667 6.07143 7.91667 6.07143 7.91667 6.0119C7.91667 5.89286 7.85714 5.77381 7.85714 5.65476C7.85714 5.53571 7.85714 5.41666 7.85714 5.35714C7.91667 5.11904 7.97619 4.88095 8.09523 4.64285C8.21428 4.46428 8.33334 4.28572 8.51191 4.10714C8.63095 3.9881 8.80952 3.86905 8.98809 3.80953C9.22619 3.69048 9.52381 3.63095 9.82143 3.63095C9.88095 3.63095 9.88095 3.63095 9.94048 3.63095C10.0595 3.63095 10.119 3.63095 10.2381 3.63095C10.5357 3.69048 10.7738 3.80952 11.0119 3.92857C11.131 3.98809 11.25 4.10714 11.3095 4.16666H11.369C11.4286 4.16666 11.4881 4.10714 11.6071 4.10714C11.7857 4.04762 11.9048 3.98809 12.0833 3.92857C12.2619 3.86905 12.4405 3.75 12.619 3.63095C12.5595 3.75 12.5 3.92857 12.4405 4.04762C12.3809 4.16666 12.2619 4.28572 12.2024 4.40476C12.1429 4.46429 12.0238 4.58333 11.9643 4.64285C11.9048 4.70238 11.8452 4.70238 11.7857 4.7619C11.8452 4.7619 11.8452 4.7619 11.9048 4.7619C12.1429 4.70238 12.3214 4.70238 12.5595 4.58334C12.5595 4.52381 12.6786 4.52381 12.7976 4.46428Z" fill="#00D1FF" />
      </svg>
      case "youtube": return <svg width={15} height={15} viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
        <rect width={15} height={15} rx="7.5" fill="white" />
        <path fillRule="evenodd" clipRule="evenodd" d="M15 7.5C15 11.6421 11.6421 15 7.5 15C3.35786 15 0 11.6421 0 7.5C0 3.35786 3.35786 0 7.5 0C11.6421 0 15 3.35786 15 7.5ZM10.9323 4.62466C11.4036 4.67734 11.7951 5.03046 11.9053 5.5091C12.0608 6.18517 12.0608 6.92266 12.0608 7.6194V7.63658C12.0608 8.33828 12.0602 9.08225 11.9033 9.76388C11.7931 10.2425 11.4015 10.5956 10.9305 10.6483C9.81467 10.773 8.68525 10.7736 7.56047 10.773C6.43587 10.7736 5.30617 10.773 4.19022 10.6483C3.71892 10.5955 3.32761 10.2424 3.21761 9.76388C3.06079 9.08234 3.06079 8.33837 3.06079 7.63658C3.06079 6.93479 3.06256 6.19073 3.21938 5.5091C3.32956 5.03046 3.72078 4.67734 4.19179 4.62466C5.30784 4.50008 6.43764 4.49943 7.56223 4.50008C8.68664 4.49943 9.81625 4.50008 10.9323 4.62466ZM6.39936 6.05713V9.03347C6.80142 8.82499 7.202 8.6173 7.60239 8.40972C8.15437 8.12354 8.70598 7.83755 9.2606 7.5499L6.39936 6.05713Z" fill="#FF4747" />
      </svg>
      default:
        break;
    }
  }

  const [showArrow, setShowArrow] = useState(false)
  return (
    <div className='w-fit max-w-[100vw] mx-auto'>
      <div className='relative overflow-hidden desktop:ml-[50px]'>
        <div className='flex flex-row flex-nowrap gap-x-[10px] overflow-x-scroll items-baseline pr-[10px] scrollbar-hide
        desktop:pr-[50px]'
          onScroll={(e: React.UIEvent<HTMLDivElement>) => {
            const target: EventTarget = e.target;
            const targetDiv: HTMLDivElement = target as HTMLDivElement
            setShowArrow(targetDiv.offsetWidth + targetDiv.scrollLeft < targetDiv.scrollWidth)
          }}>
          {postItem.map(({ topic,
            party,
            postchannel,
            postdate,
            postmessage,
            postengagement,
            postreaction,
            postcomment,
            postshare,
            posturl, }) => (
            <a key={`${party}-${topic}`}
              className='flex-none w-[260px] bg-white rounded-[5px] p-[15px] h-auto'
              href={posturl} target="_blank" rel='noreferrer'>
              <div className='flex flex-row justify-between items-center'>
                <div className='flex flex-row items-center'>
                  <div>{getLogo(party)}</div>
                  <div className='-ml-[5px]'>{getPostChanelLogo(postchannel)}</div>
                </div>
                <div className='wv-font-anuphan 
             wv-b7 text-black opacity-60'>
                  {moment(postdate, "YYYY-MM-DD").locale('th').format('ll')}
                </div>
              </div >
              <div className='wv-font-anuphan text-left break-words 
             wv-b5 text-black scrollbar-hide line-clamp-6
             border-b-[1px] border-gray !mt-[5px] pb-[2px] '>
                {postmessage}
              </div>
              <div className=' mt-[5px]'>
                <div className='flex items-start text-black gap-x-[5px]'>
                  <div className='wv-font-anuphan wv-font-bold wv-b6'>{postengagement}</div>
                  <div className='wv-font-anuphan wv-b6'>Engagement</div>
                </div>
                <div className='wv-font-anuphan wv-b7 text-black opacity-70 text-left'>
                  {`${postreaction} reactions + ${postcomment} comments + ${postshare} shares`}
                </div>
              </div>
            </a >
          ))}
        </div>
        <ScrollableArrow show={showArrow} />
      </div >
    </div>
  )
}

export default TopicPostCollection